*** crates/backend/utils/adt/quote/src/lib.rs:21:9: replace QuotedIdent<'_, '_>::as_bytes -> &[u8] with Vec::leak(vec![1])

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace QuotedIdent<'_, '_>::as_bytes -> &[u8] with Vec::leak(vec![1])
@@ -13,20 +13,17 @@
 
 pub enum QuotedIdent<'a, 'mcx> {
     Plain(&'a [u8]),
     Quoted(PgVec<'mcx, u8>),
 }
 
 impl QuotedIdent<'_, '_> {
     pub fn as_bytes(&self) -> &[u8] {
-        match self {
-            QuotedIdent::Plain(s) => s,
-            QuotedIdent::Quoted(v) => v,
-        }
+        Vec::leak(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub fn quote_identifier<'a, 'mcx>(
     mcx: Mcx<'mcx>,
     ident: &'a [u8],
 ) -> PgResult<QuotedIdent<'a, 'mcx>> {
     let mut nquotes = 0usize;

*** result: Success
