*** crates/backend/utils/adt/quote/src/lib.rs:36:13: delete match arm b'a'..= b'z' | b'0'..= b'9' | b'_' in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ delete match arm b'a'..= b'z' | b'0'..= b'9' | b'_' in quote_identifier
@@ -28,17 +28,17 @@
 pub fn quote_identifier<'a, 'mcx>(
     mcx: Mcx<'mcx>,
     ident: &'a [u8],
 ) -> PgResult<QuotedIdent<'a, 'mcx>> {
     let mut nquotes = 0usize;
     let mut safe = matches!(ident.first(), Some(b'a'..=b'z' | b'_'));
     for &ch in ident {
         match ch {
-            b'a'..=b'z' | b'0'..=b'9' | b'_' => {}
+             /* ~ changed by cargo-mutants ~ */
             b'"' => {
                 safe = false;
                 nquotes += 1;
             }
             _ => safe = false,
         }
     }

---- tests::ident_safe_forms stdout ----

thread 'tests::ident_safe_forms' (6348) panicked at crates/backend/utils/adt/quote/src/tests.rs:37:9:
assertion `left == right` failed: abc
  left: [34, 97, 98, 99, 34]
 right: [97, 98, 99]

failures:
    tests::ident_safe_forms

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
