*** crates/backend/utils/adt/quote/src/lib.rs:37:13: delete match arm b'"' in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ delete match arm b'"' in quote_identifier
@@ -29,20 +29,17 @@
     mcx: Mcx<'mcx>,
     ident: &'a [u8],
 ) -> PgResult<QuotedIdent<'a, 'mcx>> {
     let mut nquotes = 0usize;
     let mut safe = matches!(ident.first(), Some(b'a'..=b'z' | b'_'));
     for &ch in ident {
         match ch {
             b'a'..=b'z' | b'0'..=b'9' | b'_' => {}
-            b'"' => {
-                safe = false;
-                nquotes += 1;
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => safe = false,
         }
     }
 
     if guc_tables::vars::quote_all_identifiers.read() {
         safe = false;
     }

*** result: Success
