*** crates/backend/utils/adt/quote/src/lib.rs:39:25: replace += with -= in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace += with -= in quote_identifier
@@ -31,17 +31,17 @@
 ) -> PgResult<QuotedIdent<'a, 'mcx>> {
     let mut nquotes = 0usize;
     let mut safe = matches!(ident.first(), Some(b'a'..=b'z' | b'_'));
     for &ch in ident {
         match ch {
             b'a'..=b'z' | b'0'..=b'9' | b'_' => {}
             b'"' => {
                 safe = false;
-                nquotes += 1;
+                nquotes -= /* ~ changed by cargo-mutants ~ */ 1;
             }
             _ => safe = false,
         }
     }
 
     if guc_tables::vars::quote_all_identifiers.read() {
         safe = false;
     }

---- tests::ident_quoted_forms stdout ----

thread 'tests::ident_quoted_forms' (6859) panicked at crates/backend/utils/adt/quote/src/lib.rs:39:17:
attempt to subtract with overflow

---- tests::ident_safe_forms stdout ----

thread 'tests::ident_safe_forms' (6860) panicked at crates/backend/utils/adt/quote/src/tests.rs:20:21:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    tests::ident_quoted_forms
    tests::ident_safe_forms

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
