*** crates/backend/utils/adt/quote/src/lib.rs:39:25: replace += with *= in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace += with *= in quote_identifier
@@ -31,17 +31,17 @@
 ) -> PgResult<QuotedIdent<'a, 'mcx>> {
     let mut nquotes = 0usize;
     let mut safe = matches!(ident.first(), Some(b'a'..=b'z' | b'_'));
     for &ch in ident {
         match ch {
             b'a'..=b'z' | b'0'..=b'9' | b'_' => {}
             b'"' => {
                 safe = false;
-                nquotes += 1;
+                nquotes *= /* ~ changed by cargo-mutants ~ */ 1;
             }
             _ => safe = false,
         }
     }
 
     if guc_tables::vars::quote_all_identifiers.read() {
         safe = false;
     }

*** result: Success
