*** crates/backend/utils/adt/quote/src/lib.rs:51:18: replace >= with < in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace >= with < in quote_identifier
@@ -43,17 +43,17 @@
     }
 
     if guc_tables::vars::quote_all_identifiers.read() {
         safe = false;
     }
 
     if safe {
         let kwnum = ScanKeywordLookup(ident, &ScanKeywords);
-        if kwnum >= 0 && ScanKeywordCategories[kwnum as usize] != KeywordCategory::Unreserved {
+        if kwnum < /* ~ changed by cargo-mutants ~ */ 0 && ScanKeywordCategories[kwnum as usize] != KeywordCategory::Unreserved {
             safe = false;
         }
     }
 
     if safe {
         return Ok(QuotedIdent::Plain(ident));
     }

---- tests::ident_quoted_forms stdout ----

thread 'tests::ident_quoted_forms' (6924) panicked at crates/backend/utils/adt/quote/src/tests.rs:73:9:
assertion `left == right` failed: select
  left: [115, 101, 108, 101, 99, 116]
 right: [34, 115, 101, 108, 101, 99, 116, 34]

---- tests::ident_safe_forms stdout ----

thread 'tests::ident_safe_forms' (6925) panicked at crates/backend/utils/adt/quote/src/tests.rs:20:21:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    tests::ident_quoted_forms
    tests::ident_safe_forms

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
