*** crates/backend/utils/adt/quote/src/lib.rs:51:23: replace && with || in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace && with || in quote_identifier
@@ -43,17 +43,17 @@
     }
 
     if guc_tables::vars::quote_all_identifiers.read() {
         safe = false;
     }
 
     if safe {
         let kwnum = ScanKeywordLookup(ident, &ScanKeywords);
-        if kwnum >= 0 && ScanKeywordCategories[kwnum as usize] != KeywordCategory::Unreserved {
+        if kwnum >= 0 || /* ~ changed by cargo-mutants ~ */ ScanKeywordCategories[kwnum as usize] != KeywordCategory::Unreserved {
             safe = false;
         }
     }
 
     if safe {
         return Ok(QuotedIdent::Plain(ident));
     }

---- tests::ident_safe_forms stdout ----

thread 'tests::ident_safe_forms' (6911) panicked at crates/backend/utils/adt/quote/src/lib.rs:51:61:
index out of bounds: the len is 494 but the index is 18446744073709551615

failures:
    tests::ident_safe_forms

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
