*** crates/backend/utils/adt/quote/src/lib.rs:60:72: replace + with - in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace + with - in quote_identifier
@@ -52,17 +52,17 @@
             safe = false;
         }
     }
 
     if safe {
         return Ok(QuotedIdent::Plain(ident));
     }
 
-    let mut out = mcx::vec_with_capacity_in(mcx, ident.len() + nquotes + 2)?;
+    let mut out = mcx::vec_with_capacity_in(mcx, ident.len() + nquotes - /* ~ changed by cargo-mutants ~ */ 2)?;
     out.push(b'"');
     let mut start = 0;
     for (i, &ch) in ident.iter().enumerate() {
         if ch == b'"' {
             mcx::vec_append_bytes(&mut out, &ident[start..=i])?;
             out.push(b'"');
             start = i + 1;
         }

---- tests::ident_quoted_forms stdout ----

thread 'tests::ident_quoted_forms' (7073) panicked at crates/backend/utils/adt/quote/src/lib.rs:60:50:
attempt to subtract with overflow

---- tests::ident_quote_all_guc stdout ----

thread 'tests::ident_quote_all_guc' (7071) panicked at crates/backend/utils/adt/quote/src/tests.rs:20:21:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

---- tests::ident_safe_forms stdout ----

thread 'tests::ident_safe_forms' (7076) panicked at crates/backend/utils/adt/quote/src/tests.rs:20:21:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    tests::ident_quote_all_guc
    tests::ident_quoted_forms
    tests::ident_safe_forms

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
