*** crates/backend/utils/adt/quote/src/lib.rs:60:72: replace + with * in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace + with * in quote_identifier
@@ -52,17 +52,17 @@
             safe = false;
         }
     }
 
     if safe {
         return Ok(QuotedIdent::Plain(ident));
     }
 
-    let mut out = mcx::vec_with_capacity_in(mcx, ident.len() + nquotes + 2)?;
+    let mut out = mcx::vec_with_capacity_in(mcx, ident.len() + nquotes * /* ~ changed by cargo-mutants ~ */ 2)?;
     out.push(b'"');
     let mut start = 0;
     for (i, &ch) in ident.iter().enumerate() {
         if ch == b'"' {
             mcx::vec_append_bytes(&mut out, &ident[start..=i])?;
             out.push(b'"');
             start = i + 1;
         }

*** result: Success
