*** crates/backend/utils/adt/quote/src/lib.rs:67:23: replace + with - in quote_identifier

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace + with - in quote_identifier
@@ -59,17 +59,17 @@
 
     let mut out = mcx::vec_with_capacity_in(mcx, ident.len() + nquotes + 2)?;
     out.push(b'"');
     let mut start = 0;
     for (i, &ch) in ident.iter().enumerate() {
         if ch == b'"' {
             mcx::vec_append_bytes(&mut out, &ident[start..=i])?;
             out.push(b'"');
-            start = i + 1;
+            start = i - /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
     mcx::vec_append_bytes(&mut out, &ident[start..])?;
     out.push(b'"');
     Ok(QuotedIdent::Quoted(out))
 }
 
 pub fn quote_ident<'mcx>(mcx: Mcx<'mcx>, ident: &[u8]) -> PgResult<Varlena<'mcx>> {

---- tests::ident_quoted_forms stdout ----

thread 'tests::ident_quoted_forms' (7234) panicked at crates/backend/utils/adt/quote/src/tests.rs:73:9:
assertion `left == right` failed: a"b
  left: [34, 97, 34, 34, 97, 34, 98, 34]
 right: [34, 97, 34, 34, 98, 34]

---- tests::ident_safe_forms stdout ----

thread 'tests::ident_safe_forms' (7235) panicked at crates/backend/utils/adt/quote/src/tests.rs:20:21:
called `Result::unwrap()` on an `Err` value: PoisonError { .. }

failures:
    tests::ident_quoted_forms
    tests::ident_safe_forms

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
