*** crates/backend/utils/adt/quote/src/lib.rs:85:53: replace * with / in quote_literal

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace * with / in quote_literal
@@ -77,17 +77,17 @@
         QuotedIdent::Plain(s) => varlena::cstring_to_text(mcx, s),
         QuotedIdent::Quoted(v) => varlena::cstring_to_text(mcx, &v),
     }
 }
 
 // Behavior must not depend on standard_conforming_strings (quote.c note): the
 // E'' prefix appears whenever a backslash forces doubled-backslash escaping.
 pub fn quote_literal<'mcx>(mcx: Mcx<'mcx>, src: &[u8]) -> PgResult<Varlena<'mcx>> {
-    let mut out = varlena::image_with_header(mcx, 2 * src.len() + 3)?;
+    let mut out = varlena::image_with_header(mcx, 2 / /* ~ changed by cargo-mutants ~ */ src.len() + 3)?;
     if src.contains(&b'\\') {
         out.push(b'E');
     }
     out.push(b'\'');
     let mut start = 0;
     for (i, &ch) in src.iter().enumerate() {
         if ch == b'\'' || ch == b'\\' {
             mcx::vec_append_bytes(&mut out, &src[start..=i])?;

---- tests::literal_forms stdout ----

thread 'tests::literal_forms' (7495) panicked at crates/backend/utils/adt/quote/src/lib.rs:85:51:
attempt to divide by zero

failures:
    tests::literal_forms

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
