*** crates/backend/utils/adt/quote/src/lib.rs:92:24: replace || with && in quote_literal

*** mutation diff:
--- crates/backend/utils/adt/quote/src/lib.rs
+++ replace || with && in quote_literal
@@ -84,17 +84,17 @@
 pub fn quote_literal<'mcx>(mcx: Mcx<'mcx>, src: &[u8]) -> PgResult<Varlena<'mcx>> {
     let mut out = varlena::image_with_header(mcx, 2 * src.len() + 3)?;
     if src.contains(&b'\\') {
         out.push(b'E');
     }
     out.push(b'\'');
     let mut start = 0;
     for (i, &ch) in src.iter().enumerate() {
-        if ch == b'\'' || ch == b'\\' {
+        if ch == b'\'' && /* ~ changed by cargo-mutants ~ */ ch == b'\\' {
             mcx::vec_append_bytes(&mut out, &src[start..=i])?;
             out.push(ch);
             start = i + 1;
         }
     }
     mcx::vec_append_bytes(&mut out, &src[start..])?;
     out.push(b'\'');
     Ok(Varlena::from_image(out))

---- tests::literal_forms stdout ----

thread 'tests::literal_forms' (7643) panicked at crates/backend/utils/adt/quote/src/tests.rs:105:9:
assertion `left == right` failed: it's
  left: [39, 105, 116, 39, 115, 39]
 right: [39, 105, 116, 39, 39, 115, 39]

failures:
    tests::literal_forms

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
