*** crates/backend/utils/mb/mbutils/src/builtins.rs:20:41: replace == with != in name_str

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/builtins.rs
+++ replace == with != in name_str
@@ -12,17 +12,17 @@
 ) -> PgResult<Datum> {
     let name = crate::GetDatabaseEncodingName();
     let mut buf = [0u8; 64];
     buf[..name.len()].copy_from_slice(name.as_bytes());
     byref_result(fcinfo.result_mcx(), &buf)
 }
 
 fn name_str(name: &[u8; 64]) -> &str {
-    let n = name.iter().position(|&b| b == 0).unwrap_or(64);
+    let n = name.iter().position(|&b| b != /* ~ changed by cargo-mutants ~ */ 0).unwrap_or(64);
     core::str::from_utf8(&name[..n]).unwrap_or("")
 }
 
 #[track_caller]
 #[cold]
 fn invalid_encoding_name(which: &str, name: &str) -> Box<PgError> {
     Box::new(
         PgError::error(format!("invalid {which} encoding name \"{name}\""))

*** result: Success
