*** crates/backend/utils/mb/mbutils/src/builtins.rs:58:21: replace < with <= in fc_pg_convert

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/builtins.rs
+++ replace < with <= in fc_pg_convert
@@ -50,17 +50,17 @@
         }
     }
 }
 
 // BYTEA convert(BYTEA string, NAME src_encoding_name, NAME dest_encoding_name)
 pub fn fc_pg_convert(_flinfo: Option<&mut FmgrInfo>, fcinfo: &mut Fcinfo) -> PgResult<Datum> {
     let src_name = name_str(unsafe { fcinfo.arg_name(1) });
     let src_encoding = crate::pg_char_to_encoding(src_name);
-    if src_encoding < 0 {
+    if src_encoding <= /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(invalid_encoding_name("source", src_name));
     }
     let dest_name = name_str(unsafe { fcinfo.arg_name(2) });
     let dest_encoding = crate::pg_char_to_encoding(dest_name);
     if dest_encoding < 0 {
         return Err(invalid_encoding_name("destination", dest_name));
     }
     convert_common(fcinfo, 0, src_encoding, dest_encoding)

*** result: Success
