*** crates/backend/utils/mb/mbutils/src/builtins.rs:63:22: replace < with <= in fc_pg_convert

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/builtins.rs
+++ replace < with <= in fc_pg_convert
@@ -55,17 +55,17 @@
 pub fn fc_pg_convert(_flinfo: Option<&mut FmgrInfo>, fcinfo: &mut Fcinfo) -> PgResult<Datum> {
     let src_name = name_str(unsafe { fcinfo.arg_name(1) });
     let src_encoding = crate::pg_char_to_encoding(src_name);
     if src_encoding < 0 {
         return Err(invalid_encoding_name("source", src_name));
     }
     let dest_name = name_str(unsafe { fcinfo.arg_name(2) });
     let dest_encoding = crate::pg_char_to_encoding(dest_name);
-    if dest_encoding < 0 {
+    if dest_encoding <= /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(invalid_encoding_name("destination", dest_name));
     }
     convert_common(fcinfo, 0, src_encoding, dest_encoding)
 }
 
 // TEXT convert_from(BYTEA string, NAME src_encoding_name); dest = DB encoding.
 pub fn fc_pg_convert_from(_flinfo: Option<&mut FmgrInfo>, fcinfo: &mut Fcinfo) -> PgResult<Datum> {
     let src_name = name_str(unsafe { fcinfo.arg_name(1) });

*** result: Success
