*** crates/backend/utils/mb/mbutils/src/builtins.rs:73:21: replace < with == in fc_pg_convert_from

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/builtins.rs
+++ replace < with == in fc_pg_convert_from
@@ -65,17 +65,17 @@
     }
     convert_common(fcinfo, 0, src_encoding, dest_encoding)
 }
 
 // TEXT convert_from(BYTEA string, NAME src_encoding_name); dest = DB encoding.
 pub fn fc_pg_convert_from(_flinfo: Option<&mut FmgrInfo>, fcinfo: &mut Fcinfo) -> PgResult<Datum> {
     let src_name = name_str(unsafe { fcinfo.arg_name(1) });
     let src_encoding = crate::pg_char_to_encoding(src_name);
-    if src_encoding < 0 {
+    if src_encoding == /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(invalid_encoding_name("source", src_name));
     }
     convert_common(fcinfo, 0, src_encoding, crate::GetDatabaseEncoding())
 }
 
 // BYTEA convert_to(TEXT string, NAME dest_encoding_name); src = DB encoding.
 pub fn fc_pg_convert_to(_flinfo: Option<&mut FmgrInfo>, fcinfo: &mut Fcinfo) -> PgResult<Datum> {
     let dest_name = name_str(unsafe { fcinfo.arg_name(1) });

*** result: Success
