*** crates/backend/utils/mb/mbutils/src/lib.rs:1017:9: delete match arm SS2 in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete match arm SS2 in pg_eucjp_increment
@@ -1009,31 +1009,17 @@
 }
 
 pub fn pg_eucjp_increment(charptr: &mut [u8]) -> bool {
     const SS2: u8 = 0x8e;
     const SS3: u8 = 0x8f;
     let length = charptr.len();
     let c1 = charptr[0];
     match c1 {
-        SS2 => {
-            if length != 2 {
-                return false;
-            }
-            let c2 = charptr[1];
-            if c2 >= 0xdf {
-                charptr[0] = 0xa1;
-                charptr[1] = 0xa1;
-            } else if c2 < 0xa1 {
-                charptr[1] = 0xa1;
-            } else {
-                charptr[1] += 1;
-            }
-            true
-        }
+         /* ~ changed by cargo-mutants ~ */
         SS3 => {
             if length != 3 {
                 return false;
             }
             for i in (1..=2).rev() {
                 let c2 = charptr[i];
                 if c2 < 0xa1 {
                     charptr[i] = 0xa1;

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (109704) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:402:5:
assertion `left == right` failed
  left: [142, 224]
 right: [161, 161]

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
