*** crates/backend/utils/mb/mbutils/src/lib.rs:1018:23: replace != with == in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in pg_eucjp_increment
@@ -1010,17 +1010,17 @@
 
 pub fn pg_eucjp_increment(charptr: &mut [u8]) -> bool {
     const SS2: u8 = 0x8e;
     const SS3: u8 = 0x8f;
     let length = charptr.len();
     let c1 = charptr[0];
     match c1 {
         SS2 => {
-            if length != 2 {
+            if length == /* ~ changed by cargo-mutants ~ */ 2 {
                 return false;
             }
             let c2 = charptr[1];
             if c2 >= 0xdf {
                 charptr[0] = 0xa1;
                 charptr[1] = 0xa1;
             } else if c2 < 0xa1 {
                 charptr[1] = 0xa1;

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (109896) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:401:5:
assertion failed: pg_eucjp_increment(&mut c)

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
