*** crates/backend/utils/mb/mbutils/src/lib.rs:1022:19: replace >= with < in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace >= with < in pg_eucjp_increment
@@ -1014,17 +1014,17 @@
     let length = charptr.len();
     let c1 = charptr[0];
     match c1 {
         SS2 => {
             if length != 2 {
                 return false;
             }
             let c2 = charptr[1];
-            if c2 >= 0xdf {
+            if c2 < /* ~ changed by cargo-mutants ~ */ 0xdf {
                 charptr[0] = 0xa1;
                 charptr[1] = 0xa1;
             } else if c2 < 0xa1 {
                 charptr[1] = 0xa1;
             } else {
                 charptr[1] += 1;
             }
             true

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (109906) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:402:5:
assertion `left == right` failed
  left: [142, 224]
 right: [161, 161]

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
