*** crates/backend/utils/mb/mbutils/src/lib.rs:1025:26: replace < with > in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with > in pg_eucjp_increment
@@ -1017,17 +1017,17 @@
         SS2 => {
             if length != 2 {
                 return false;
             }
             let c2 = charptr[1];
             if c2 >= 0xdf {
                 charptr[0] = 0xa1;
                 charptr[1] = 0xa1;
-            } else if c2 < 0xa1 {
+            } else if c2 > /* ~ changed by cargo-mutants ~ */ 0xa1 {
                 charptr[1] = 0xa1;
             } else {
                 charptr[1] += 1;
             }
             true
         }
         SS3 => {
             if length != 3 {

*** result: Success
