*** crates/backend/utils/mb/mbutils/src/lib.rs:1028:28: replace += with *= in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_eucjp_increment
@@ -1020,17 +1020,17 @@
             }
             let c2 = charptr[1];
             if c2 >= 0xdf {
                 charptr[0] = 0xa1;
                 charptr[1] = 0xa1;
             } else if c2 < 0xa1 {
                 charptr[1] = 0xa1;
             } else {
-                charptr[1] += 1;
+                charptr[1] *= /* ~ changed by cargo-mutants ~ */ 1;
             }
             true
         }
         SS3 => {
             if length != 3 {
                 return false;
             }
             for i in (1..=2).rev() {

*** result: Success
