*** crates/backend/utils/mb/mbutils/src/lib.rs:1032:9: delete match arm SS3 in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete match arm SS3 in pg_eucjp_increment
@@ -1024,32 +1024,17 @@
                 charptr[1] = 0xa1;
             } else if c2 < 0xa1 {
                 charptr[1] = 0xa1;
             } else {
                 charptr[1] += 1;
             }
             true
         }
-        SS3 => {
-            if length != 3 {
-                return false;
-            }
-            for i in (1..=2).rev() {
-                let c2 = charptr[i];
-                if c2 < 0xa1 {
-                    charptr[i] = 0xa1;
-                    return true;
-                } else if c2 < 0xfe {
-                    charptr[i] += 1;
-                    return true;
-                }
-            }
-            false
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {
             if c1 & 0x80 != 0 {
                 if length != 2 {
                     return false;
                 }
                 for i in (0..=1).rev() {
                     let c2 = charptr[i];
                     if c2 < 0xa1 {

*** result: Success
