*** crates/backend/utils/mb/mbutils/src/lib.rs:1033:23: replace != with == in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in pg_eucjp_increment
@@ -1025,17 +1025,17 @@
             } else if c2 < 0xa1 {
                 charptr[1] = 0xa1;
             } else {
                 charptr[1] += 1;
             }
             true
         }
         SS3 => {
-            if length != 3 {
+            if length == /* ~ changed by cargo-mutants ~ */ 3 {
                 return false;
             }
             for i in (1..=2).rev() {
                 let c2 = charptr[i];
                 if c2 < 0xa1 {
                     charptr[i] = 0xa1;
                     return true;
                 } else if c2 < 0xfe {

*** result: Success
