*** crates/backend/utils/mb/mbutils/src/lib.rs:1041:30: replace < with <= in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_eucjp_increment
@@ -1033,17 +1033,17 @@
             if length != 3 {
                 return false;
             }
             for i in (1..=2).rev() {
                 let c2 = charptr[i];
                 if c2 < 0xa1 {
                     charptr[i] = 0xa1;
                     return true;
-                } else if c2 < 0xfe {
+                } else if c2 <= /* ~ changed by cargo-mutants ~ */ 0xfe {
                     charptr[i] += 1;
                     return true;
                 }
             }
             false
         }
         _ => {
             if c1 & 0x80 != 0 {

*** result: Success
