*** crates/backend/utils/mb/mbutils/src/lib.rs:1042:32: replace += with -= in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_eucjp_increment
@@ -1034,17 +1034,17 @@
                 return false;
             }
             for i in (1..=2).rev() {
                 let c2 = charptr[i];
                 if c2 < 0xa1 {
                     charptr[i] = 0xa1;
                     return true;
                 } else if c2 < 0xfe {
-                    charptr[i] += 1;
+                    charptr[i] -= /* ~ changed by cargo-mutants ~ */ 1;
                     return true;
                 }
             }
             false
         }
         _ => {
             if c1 & 0x80 != 0 {
                 if length != 2 {

*** result: Success
