*** crates/backend/utils/mb/mbutils/src/lib.rs:1050:27: replace != with == in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in pg_eucjp_increment
@@ -1042,17 +1042,17 @@
                     charptr[i] += 1;
                     return true;
                 }
             }
             false
         }
         _ => {
             if c1 & 0x80 != 0 {
-                if length != 2 {
+                if length == /* ~ changed by cargo-mutants ~ */ 2 {
                     return false;
                 }
                 for i in (0..=1).rev() {
                     let c2 = charptr[i];
                     if c2 < 0xa1 {
                         charptr[i] = 0xa1;
                         return true;
                     } else if c2 < 0xfe {

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (111165) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:404:5:
assertion failed: pg_eucjp_increment(&mut c)

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
