*** crates/backend/utils/mb/mbutils/src/lib.rs:1055:27: replace < with <= in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_eucjp_increment
@@ -1047,17 +1047,17 @@
         }
         _ => {
             if c1 & 0x80 != 0 {
                 if length != 2 {
                     return false;
                 }
                 for i in (0..=1).rev() {
                     let c2 = charptr[i];
-                    if c2 < 0xa1 {
+                    if c2 <= /* ~ changed by cargo-mutants ~ */ 0xa1 {
                         charptr[i] = 0xa1;
                         return true;
                     } else if c2 < 0xfe {
                         charptr[i] += 1;
                         return true;
                     }
                 }
                 false

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (111335) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:405:5:
assertion `left == right` failed
  left: [161, 254]
 right: [162, 254]

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
