*** crates/backend/utils/mb/mbutils/src/lib.rs:1058:34: replace < with == in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in pg_eucjp_increment
@@ -1050,17 +1050,17 @@
                 if length != 2 {
                     return false;
                 }
                 for i in (0..=1).rev() {
                     let c2 = charptr[i];
                     if c2 < 0xa1 {
                         charptr[i] = 0xa1;
                         return true;
-                    } else if c2 < 0xfe {
+                    } else if c2 == /* ~ changed by cargo-mutants ~ */ 0xfe {
                         charptr[i] += 1;
                         return true;
                     }
                 }
                 false
             } else {
                 if c1 > 0x7e {
                     return false;

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (111536) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:405:5:
assertion `left == right` failed
  left: [161, 255]
 right: [162, 254]

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
