*** crates/backend/utils/mb/mbutils/src/lib.rs:1065:23: replace > with == in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with == in pg_eucjp_increment
@@ -1057,17 +1057,17 @@
                         return true;
                     } else if c2 < 0xfe {
                         charptr[i] += 1;
                         return true;
                     }
                 }
                 false
             } else {
-                if c1 > 0x7e {
+                if c1 == /* ~ changed by cargo-mutants ~ */ 0x7e {
                     return false;
                 }
                 charptr[0] += 1;
                 true
             }
         }
     }
 }

*** result: Success
