*** crates/backend/utils/mb/mbutils/src/lib.rs:1065:23: replace > with < in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with < in pg_eucjp_increment
@@ -1057,17 +1057,17 @@
                         return true;
                     } else if c2 < 0xfe {
                         charptr[i] += 1;
                         return true;
                     }
                 }
                 false
             } else {
-                if c1 > 0x7e {
+                if c1 < /* ~ changed by cargo-mutants ~ */ 0x7e {
                     return false;
                 }
                 charptr[0] += 1;
                 true
             }
         }
     }
 }

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (111922) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:398:5:
assertion failed: pg_eucjp_increment(&mut c)

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
