*** crates/backend/utils/mb/mbutils/src/lib.rs:1068:28: replace += with *= in pg_eucjp_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_eucjp_increment
@@ -1060,17 +1060,17 @@
                         return true;
                     }
                 }
                 false
             } else {
                 if c1 > 0x7e {
                     return false;
                 }
-                charptr[0] += 1;
+                charptr[0] *= /* ~ changed by cargo-mutants ~ */ 1;
                 true
             }
         }
     }
 }
 
 pub fn pg_verifymbstr(mbstr: &[u8], no_error: bool) -> PgResult<bool> {
     pg_verify_mbstr(database_encoding(), mbstr, no_error)

---- tests::eucjp_increment_cases stdout ----

thread 'tests::eucjp_increment_cases' (112094) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:399:5:
assertion `left == right` failed
  left: [65]
 right: [66]

failures:
    tests::eucjp_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
