*** crates/backend/utils/mb/mbutils/src/lib.rs:1082:14: replace != with == in pg_verify_mbstr

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in pg_verify_mbstr
@@ -1074,17 +1074,17 @@
 
 pub fn pg_verifymbstr(mbstr: &[u8], no_error: bool) -> PgResult<bool> {
     pg_verify_mbstr(database_encoding(), mbstr, no_error)
 }
 
 pub fn pg_verify_mbstr(encoding: pg_enc, mbstr: &[u8], no_error: bool) -> PgResult<bool> {
     debug_assert!(pg_valid_encoding(encoding));
     let oklen = pg_encoding_verifymbstr(encoding, mbstr) as usize;
-    if oklen != mbstr.len() {
+    if oklen == /* ~ changed by cargo-mutants ~ */ mbstr.len() {
         if no_error {
             return Ok(false);
         }
         return Err(report_invalid_encoding(encoding, &mbstr[oklen..]));
     }
     Ok(true)
 }

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (112308) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:277:62:

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (112306) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:260:57:

---- tests::do_encoding_conversion_identity_and_validation stdout ----

thread 'tests::do_encoding_conversion_identity_and_validation' (112313) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:303:5:
assertion failed: pg_do_encoding_conversion(ctx.mcx(), b"\xff", PG_SQL_ASCII, PG_UTF8).is_err()

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::ascii_server_rejects_highbit_from_client_only_encoding
    tests::do_encoding_conversion_identity_and_validation
    tests::no_conversion_returns_none_without_allocating
    tests::seams_installed
    tests::verify_mbstr_reports_c_message

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
