*** crates/backend/utils/mb/mbutils/src/lib.rs:1095:41: replace <= with > in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace <= with > in pg_verify_mbstr_len
@@ -1087,17 +1087,17 @@
     }
     Ok(true)
 }
 
 /// Verify and count characters: `Ok(count)`, or `Ok(-1)` with `no_error`.
 pub fn pg_verify_mbstr_len(encoding: pg_enc, mbstr: &[u8], no_error: bool) -> PgResult<i32> {
     debug_assert!(pg_valid_encoding(encoding));
 
-    if pg_encoding_max_length(encoding) <= 1 {
+    if pg_encoding_max_length(encoding) > /* ~ changed by cargo-mutants ~ */ 1 {
         return match mbstr.iter().position(|&b| b == 0) {
             None => Ok(mbstr.len() as i32),
             Some(_) if no_error => Ok(-1),
             Some(nullpos) => Err(report_invalid_encoding(encoding, &mbstr[nullpos..])),
         };
     }
 
     let mut mb_len = 0;

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (112581) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:247:5:
assertion `left == right` failed
  left: 6
 right: 3

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
