*** crates/backend/utils/mb/mbutils/src/lib.rs:1098:24: replace match guard no_error with true in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace match guard no_error with true in pg_verify_mbstr_len
@@ -1090,17 +1090,17 @@
 
 /// Verify and count characters: `Ok(count)`, or `Ok(-1)` with `no_error`.
 pub fn pg_verify_mbstr_len(encoding: pg_enc, mbstr: &[u8], no_error: bool) -> PgResult<i32> {
     debug_assert!(pg_valid_encoding(encoding));
 
     if pg_encoding_max_length(encoding) <= 1 {
         return match mbstr.iter().position(|&b| b == 0) {
             None => Ok(mbstr.len() as i32),
-            Some(_) if no_error => Ok(-1),
+            Some(_) if true /* ~ changed by cargo-mutants ~ */ => Ok(-1),
             Some(nullpos) => Err(report_invalid_encoding(encoding, &mbstr[nullpos..])),
         };
     }
 
     let mut mb_len = 0;
     let mut pos = 0usize;
     while pos < mbstr.len() {
         let remaining = &mbstr[pos..];

*** result: Success
