*** crates/backend/utils/mb/mbutils/src/lib.rs:1105:15: replace < with <= in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_verify_mbstr_len
@@ -1097,17 +1097,17 @@
             None => Ok(mbstr.len() as i32),
             Some(_) if no_error => Ok(-1),
             Some(nullpos) => Err(report_invalid_encoding(encoding, &mbstr[nullpos..])),
         };
     }
 
     let mut mb_len = 0;
     let mut pos = 0usize;
-    while pos < mbstr.len() {
+    while pos <= /* ~ changed by cargo-mutants ~ */ mbstr.len() {
         let remaining = &mbstr[pos..];
         if remaining[0] & 0x80 == 0 {
             if remaining[0] == 0 {
                 if no_error {
                     return Ok(-1);
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (112976) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1107:12:
index out of bounds: the len is 0 but the index is 0

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
