*** crates/backend/utils/mb/mbutils/src/lib.rs:1107:25: replace & with | in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace & with | in pg_verify_mbstr_len
@@ -1099,17 +1099,17 @@
             Some(nullpos) => Err(report_invalid_encoding(encoding, &mbstr[nullpos..])),
         };
     }
 
     let mut mb_len = 0;
     let mut pos = 0usize;
     while pos < mbstr.len() {
         let remaining = &mbstr[pos..];
-        if remaining[0] & 0x80 == 0 {
+        if remaining[0] | /* ~ changed by cargo-mutants ~ */ 0x80 == 0 {
             if remaining[0] == 0 {
                 if no_error {
                     return Ok(-1);
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }
             mb_len += 1;
             pos += 1;

*** result: Success
