*** crates/backend/utils/mb/mbutils/src/lib.rs:1107:32: replace == with != in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_verify_mbstr_len
@@ -1099,17 +1099,17 @@
             Some(nullpos) => Err(report_invalid_encoding(encoding, &mbstr[nullpos..])),
         };
     }
 
     let mut mb_len = 0;
     let mut pos = 0usize;
     while pos < mbstr.len() {
         let remaining = &mbstr[pos..];
-        if remaining[0] & 0x80 == 0 {
+        if remaining[0] & 0x80 != /* ~ changed by cargo-mutants ~ */ 0 {
             if remaining[0] == 0 {
                 if no_error {
                     return Ok(-1);
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }
             mb_len += 1;
             pos += 1;

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (113020) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:247:5:
assertion `left == right` failed
  left: 6
 right: 3

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
