*** crates/backend/utils/mb/mbutils/src/lib.rs:1114:20: replace += with -= in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_verify_mbstr_len
@@ -1106,17 +1106,17 @@
         let remaining = &mbstr[pos..];
         if remaining[0] & 0x80 == 0 {
             if remaining[0] == 0 {
                 if no_error {
                     return Ok(-1);
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }
-            mb_len += 1;
+            mb_len -= /* ~ changed by cargo-mutants ~ */ 1;
             pos += 1;
             continue;
         }
         let l = pg_encoding_verifymbchar(encoding, remaining);
         if l < 0 {
             if no_error {
                 return Ok(-1);
             }

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (113372) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:247:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
