*** crates/backend/utils/mb/mbutils/src/lib.rs:1115:17: replace += with *= in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_verify_mbstr_len
@@ -1107,17 +1107,17 @@
         if remaining[0] & 0x80 == 0 {
             if remaining[0] == 0 {
                 if no_error {
                     return Ok(-1);
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }
             mb_len += 1;
-            pos += 1;
+            pos *= /* ~ changed by cargo-mutants ~ */ 1;
             continue;
         }
         let l = pg_encoding_verifymbchar(encoding, remaining);
         if l < 0 {
             if no_error {
                 return Ok(-1);
             }
             return Err(report_invalid_encoding(encoding, remaining));

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (113562) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1114:13:
attempt to add with overflow

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 10.93s

*** result: Failure(101)
