*** crates/backend/utils/mb/mbutils/src/lib.rs:1119:14: replace < with == in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in pg_verify_mbstr_len
@@ -1111,17 +1111,17 @@
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }
             mb_len += 1;
             pos += 1;
             continue;
         }
         let l = pg_encoding_verifymbchar(encoding, remaining);
-        if l < 0 {
+        if l == /* ~ changed by cargo-mutants ~ */ 0 {
             if no_error {
                 return Ok(-1);
             }
             return Err(report_invalid_encoding(encoding, remaining));
         }
         pos += l as usize;
         mb_len += 1;
     }

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (113622) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1125:9:
attempt to add with overflow

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
