*** crates/backend/utils/mb/mbutils/src/lib.rs:1119:14: replace < with <= in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_verify_mbstr_len
@@ -1111,17 +1111,17 @@
                 }
                 return Err(report_invalid_encoding(encoding, remaining));
             }
             mb_len += 1;
             pos += 1;
             continue;
         }
         let l = pg_encoding_verifymbchar(encoding, remaining);
-        if l < 0 {
+        if l <= /* ~ changed by cargo-mutants ~ */ 0 {
             if no_error {
                 return Ok(-1);
             }
             return Err(report_invalid_encoding(encoding, remaining));
         }
         pos += l as usize;
         mb_len += 1;
     }

*** result: Success
