*** crates/backend/utils/mb/mbutils/src/lib.rs:1121:27: delete - in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete - in pg_verify_mbstr_len
@@ -1113,17 +1113,17 @@
             }
             mb_len += 1;
             pos += 1;
             continue;
         }
         let l = pg_encoding_verifymbchar(encoding, remaining);
         if l < 0 {
             if no_error {
-                return Ok(-1);
+                return Ok( /* ~ changed by cargo-mutants ~ */1);
             }
             return Err(report_invalid_encoding(encoding, remaining));
         }
         pos += l as usize;
         mb_len += 1;
     }
     Ok(mb_len)
 }

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (113852) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:251:5:
assertion `left == right` failed
  left: 1
 right: -1

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
