*** crates/backend/utils/mb/mbutils/src/lib.rs:1125:13: replace += with -= in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_verify_mbstr_len
@@ -1117,17 +1117,17 @@
         }
         let l = pg_encoding_verifymbchar(encoding, remaining);
         if l < 0 {
             if no_error {
                 return Ok(-1);
             }
             return Err(report_invalid_encoding(encoding, remaining));
         }
-        pos += l as usize;
+        pos -= /* ~ changed by cargo-mutants ~ */ l as usize;
         mb_len += 1;
     }
     Ok(mb_len)
 }
 
 /// C `CHECK_ENCODING_CONVERSION_ARGS`; `-1` expected-encoding means "any".
 pub fn check_encoding_conversion_args(
     src_encoding: pg_enc,

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (113889) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1125:9:
attempt to subtract with overflow

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
