*** crates/backend/utils/mb/mbutils/src/lib.rs:1126:16: replace += with *= in pg_verify_mbstr_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_verify_mbstr_len
@@ -1118,17 +1118,17 @@
         let l = pg_encoding_verifymbchar(encoding, remaining);
         if l < 0 {
             if no_error {
                 return Ok(-1);
             }
             return Err(report_invalid_encoding(encoding, remaining));
         }
         pos += l as usize;
-        mb_len += 1;
+        mb_len *= /* ~ changed by cargo-mutants ~ */ 1;
     }
     Ok(mb_len)
 }
 
 /// C `CHECK_ENCODING_CONVERSION_ARGS`; `-1` expected-encoding means "any".
 pub fn check_encoding_conversion_args(
     src_encoding: pg_enc,
     dest_encoding: pg_enc,

---- tests::verify_mbstr_len_counts_and_rejects stdout ----

thread 'tests::verify_mbstr_len_counts_and_rejects' (114104) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:247:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    tests::verify_mbstr_len_counts_and_rejects

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
