*** crates/backend/utils/mb/mbutils/src/lib.rs:1139:8: delete ! in check_encoding_conversion_args

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in check_encoding_conversion_args
@@ -1131,17 +1131,17 @@
 /// C `CHECK_ENCODING_CONVERSION_ARGS`; `-1` expected-encoding means "any".
 pub fn check_encoding_conversion_args(
     src_encoding: pg_enc,
     dest_encoding: pg_enc,
     len: i32,
     expected_src_encoding: pg_enc,
     expected_dest_encoding: pg_enc,
 ) -> PgResult<()> {
-    if !pg_valid_encoding(src_encoding) {
+    if  /* ~ changed by cargo-mutants ~ */pg_valid_encoding(src_encoding) {
         return Err(internal_error(&format!(
             "invalid source encoding ID: {src_encoding}"
         )));
     }
     if src_encoding != expected_src_encoding && expected_src_encoding >= 0 {
         return Err(internal_error(&format!(
             "expected source encoding \"{}\", but got \"{}\"",
             enc_name(expected_src_encoding),

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (114204) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:422:5:
assertion failed: check_encoding_conversion_args(PG_UTF8, PG_LATIN1, 4, PG_UTF8,
        PG_LATIN1).is_ok()

failures:
    tests::check_conversion_args

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
