*** crates/backend/utils/mb/mbutils/src/lib.rs:1144:46: replace && with || in check_encoding_conversion_args

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace && with || in check_encoding_conversion_args
@@ -1136,17 +1136,17 @@
     expected_src_encoding: pg_enc,
     expected_dest_encoding: pg_enc,
 ) -> PgResult<()> {
     if !pg_valid_encoding(src_encoding) {
         return Err(internal_error(&format!(
             "invalid source encoding ID: {src_encoding}"
         )));
     }
-    if src_encoding != expected_src_encoding && expected_src_encoding >= 0 {
+    if src_encoding != expected_src_encoding || /* ~ changed by cargo-mutants ~ */ expected_src_encoding >= 0 {
         return Err(internal_error(&format!(
             "expected source encoding \"{}\", but got \"{}\"",
             enc_name(expected_src_encoding),
             enc_name(src_encoding)
         )));
     }
     if !pg_valid_encoding(dest_encoding) {
         return Err(internal_error(&format!(

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (114241) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:422:5:
assertion failed: check_encoding_conversion_args(PG_UTF8, PG_LATIN1, 4, PG_UTF8,
        PG_LATIN1).is_ok()

failures:
    tests::check_conversion_args

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
