*** crates/backend/utils/mb/mbutils/src/lib.rs:1144:71: replace >= with < in check_encoding_conversion_args

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace >= with < in check_encoding_conversion_args
@@ -1136,17 +1136,17 @@
     expected_src_encoding: pg_enc,
     expected_dest_encoding: pg_enc,
 ) -> PgResult<()> {
     if !pg_valid_encoding(src_encoding) {
         return Err(internal_error(&format!(
             "invalid source encoding ID: {src_encoding}"
         )));
     }
-    if src_encoding != expected_src_encoding && expected_src_encoding >= 0 {
+    if src_encoding != expected_src_encoding && expected_src_encoding < /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(internal_error(&format!(
             "expected source encoding \"{}\", but got \"{}\"",
             enc_name(expected_src_encoding),
             enc_name(src_encoding)
         )));
     }
     if !pg_valid_encoding(dest_encoding) {
         return Err(internal_error(&format!(

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (114402) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:83:5:
index out of bounds: the len is 42 but the index is 18446744073709551615

failures:
    tests::check_conversion_args

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
