*** crates/backend/utils/mb/mbutils/src/lib.rs:1156:48: replace && with || in check_encoding_conversion_args

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace && with || in check_encoding_conversion_args
@@ -1148,17 +1148,17 @@
             enc_name(src_encoding)
         )));
     }
     if !pg_valid_encoding(dest_encoding) {
         return Err(internal_error(&format!(
             "invalid destination encoding ID: {dest_encoding}"
         )));
     }
-    if dest_encoding != expected_dest_encoding && expected_dest_encoding >= 0 {
+    if dest_encoding != expected_dest_encoding || /* ~ changed by cargo-mutants ~ */ expected_dest_encoding >= 0 {
         return Err(internal_error(&format!(
             "expected destination encoding \"{}\", but got \"{}\"",
             enc_name(expected_dest_encoding),
             enc_name(dest_encoding)
         )));
     }
     if len < 0 {
         return Err(internal_error(

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (114563) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:422:5:
assertion failed: check_encoding_conversion_args(PG_UTF8, PG_LATIN1, 4, PG_UTF8,
        PG_LATIN1).is_ok()

failures:
    tests::check_conversion_args

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
