*** crates/backend/utils/mb/mbutils/src/lib.rs:1156:74: replace >= with < in check_encoding_conversion_args

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace >= with < in check_encoding_conversion_args
@@ -1148,17 +1148,17 @@
             enc_name(src_encoding)
         )));
     }
     if !pg_valid_encoding(dest_encoding) {
         return Err(internal_error(&format!(
             "invalid destination encoding ID: {dest_encoding}"
         )));
     }
-    if dest_encoding != expected_dest_encoding && expected_dest_encoding >= 0 {
+    if dest_encoding != expected_dest_encoding && expected_dest_encoding < /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(internal_error(&format!(
             "expected destination encoding \"{}\", but got \"{}\"",
             enc_name(expected_dest_encoding),
             enc_name(dest_encoding)
         )));
     }
     if len < 0 {
         return Err(internal_error(

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (114608) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:83:5:
index out of bounds: the len is 42 but the index is 18446744073709551615

failures:
    tests::check_conversion_args

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
