*** crates/backend/utils/mb/mbutils/src/lib.rs:1163:12: replace < with == in check_encoding_conversion_args

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in check_encoding_conversion_args
@@ -1155,17 +1155,17 @@
     }
     if dest_encoding != expected_dest_encoding && expected_dest_encoding >= 0 {
         return Err(internal_error(&format!(
             "expected destination encoding \"{}\", but got \"{}\"",
             enc_name(expected_dest_encoding),
             enc_name(dest_encoding)
         )));
     }
-    if len < 0 {
+    if len == /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(internal_error(
             "encoding conversion length must not be negative",
         ));
     }
     Ok(())
 }
 
 #[cold]

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (114759) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:430:5:
assertion failed: check_encoding_conversion_args(PG_UTF8, PG_LATIN1, -1, -1, -1).is_err()

failures:
    tests::check_conversion_args

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
