*** crates/backend/utils/mb/mbutils/src/lib.rs:1223:5: replace byte_sequence -> String with String::new()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace byte_sequence -> String with String::new()
@@ -1215,25 +1215,17 @@
         .with_sqlstate(ERRCODE_UNTRANSLATABLE_CHARACTER),
     )
 }
 
 /// The leading `min(mblen, len, 8)` bytes as space-separated `0xNN`.
 // pub for proofs/text-slice (Kani stubs the message-text construction;
 // visibility-only change per the 2026-07-28 shipped-edits ruling).
 pub fn byte_sequence(mbstr: &[u8], mblen: i32, len: i32) -> String {
-    let jlimit = (mblen.min(len).max(0) as usize).min(8).min(mbstr.len());
-    let mut p = String::with_capacity(jlimit * 5);
-    for (j, b) in mbstr[..jlimit].iter().enumerate() {
-        if j > 0 {
-            p.push(' ');
-        }
-        p.push_str(&format!("0x{b:02x}"));
-    }
-    p
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn c_string_len(bytes: &[u8]) -> usize {
     bytes.iter().position(|&b| b == 0).unwrap_or(bytes.len())
 }
 
 #[track_caller]
 #[cold]

---- tests::mbstrlen_with_len_errors_on_truncated_trailing_char stdout ----

thread 'tests::mbstrlen_with_len_errors_on_truncated_trailing_char' (115062) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:147:5:
assertion `left == right` failed
  left: "invalid byte sequence for encoding \"UTF8\": "
 right: "invalid byte sequence for encoding \"UTF8\": 0xc3"

---- tests::reporters_match_c_shapes stdout ----

thread 'tests::reporters_match_c_shapes' (115076) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:437:5:
assertion `left == right` failed
  left: "character with byte sequence  in encoding \"UTF8\" has no equivalent in encoding \"LATIN1\""
 right: "character with byte sequence 0xe4 0xb8 0x96 in encoding \"UTF8\" has no equivalent in encoding \"LATIN1\""

---- tests::verify_mbstr_reports_c_message stdout ----

thread 'tests::verify_mbstr_reports_c_message' (115108) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:236:5:
assertion `left == right` failed
  left: "invalid byte sequence for encoding \"UTF8\": "
 right: "invalid byte sequence for encoding \"UTF8\": 0xff"

failures:
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::reporters_match_c_shapes
    tests::verify_mbstr_reports_c_message

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
