*** crates/backend/utils/mb/mbutils/src/lib.rs:1226:14: replace > with < in byte_sequence

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with < in byte_sequence
@@ -1218,17 +1218,17 @@
 
 /// The leading `min(mblen, len, 8)` bytes as space-separated `0xNN`.
 // pub for proofs/text-slice (Kani stubs the message-text construction;
 // visibility-only change per the 2026-07-28 shipped-edits ruling).
 pub fn byte_sequence(mbstr: &[u8], mblen: i32, len: i32) -> String {
     let jlimit = (mblen.min(len).max(0) as usize).min(8).min(mbstr.len());
     let mut p = String::with_capacity(jlimit * 5);
     for (j, b) in mbstr[..jlimit].iter().enumerate() {
-        if j > 0 {
+        if j < /* ~ changed by cargo-mutants ~ */ 0 {
             p.push(' ');
         }
         p.push_str(&format!("0x{b:02x}"));
     }
     p
 }
 
 fn c_string_len(bytes: &[u8]) -> usize {

---- tests::reporters_match_c_shapes stdout ----

thread 'tests::reporters_match_c_shapes' (115257) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:437:5:
assertion `left == right` failed
  left: "character with byte sequence 0xe40xb80x96 in encoding \"UTF8\" has no equivalent in encoding \"LATIN1\""
 right: "character with byte sequence 0xe4 0xb8 0x96 in encoding \"UTF8\" has no equivalent in encoding \"LATIN1\""

failures:
    tests::reporters_match_c_shapes

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
