*** crates/backend/utils/mb/mbutils/src/lib.rs:1235:5: replace c_string_len -> usize with 1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace c_string_len -> usize with 1
@@ -1227,17 +1227,17 @@
             p.push(' ');
         }
         p.push_str(&format!("0x{b:02x}"));
     }
     p
 }
 
 fn c_string_len(bytes: &[u8]) -> usize {
-    bytes.iter().position(|&b| b == 0).unwrap_or(bytes.len())
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[track_caller]
 #[cold]
 fn internal_error(message: &str) -> Box<PgError> {
     Box::new(PgError::error(message.to_string()))
 }

*** result: Success
