*** crates/backend/utils/mb/mbutils/src/lib.rs:1317:5: replace init_seams with ()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace init_seams with ()
@@ -1309,30 +1309,17 @@
 
 #[track_caller]
 #[cold]
 fn invalid_codepoint_error() -> Box<PgError> {
     Box::new(PgError::error("invalid Unicode code point").with_sqlstate(ERRCODE_SYNTAX_ERROR))
 }
 
 pub fn init_seams() {
-    use mbutils_seams as seams;
-    seams::pg_server_to_client::set(pg_server_to_client);
-    seams::server_to_client_conversion_needed::set(server_to_client_conversion_needed);
-    seams::pg_database_encoding_max_length::set(pg_database_encoding_max_length);
-    seams::pg_mbstrlen_with_len::set(pg_mbstrlen_with_len);
-    seams::pg_mblen_range::set(pg_mblen_range);
-    seams::get_database_encoding::set(GetDatabaseEncoding);
-    seams::get_database_encoding_name::set(GetDatabaseEncodingName);
-    seams::set_database_encoding::set(SetDatabaseEncoding);
-    seams::initialize_client_encoding::set(InitializeClientEncoding);
-    seams::pg_mbcliplen::set(pg_mbcliplen);
-    seams::pg_mb2wchar_with_len::set(pg_mb2wchar_with_len);
-    seams::pg_wchar2mb_with_len::set(pg_wchar2mb_with_len);
-    seams::pg_encoding_mblen::set(wchar::pg_encoding_mblen);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests;
 
 #[cfg(test)]
 mod divergence10_regression {
     // Divergence #10: byte-wise cleaning must match C for non-UTF-8 names

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (115616) panicked at crates/backend/utils/mb/mbutils_seams/src/lib.rs:75:1:
seam not installed: mbutils_seams::set_database_encoding

failures:
    tests::seams_installed

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
