*** crates/backend/utils/mb/mbutils/src/lib.rs:175:5: replace clean_encoding_name -> usize with 0

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace clean_encoding_name -> usize with 0
@@ -167,24 +167,17 @@
     ("windows949", wchar::PG_UHC),
     ("windows950", wchar::PG_BIG5),
 ];
 
 const NAMEDATALEN: usize = 64;
 
 // clean_encoding_name (encnames.c): keep alnum, ASCII-lowercase.
 fn clean_encoding_name(key: &[u8], buf: &mut [u8; NAMEDATALEN]) -> usize {
-    let mut n = 0;
-    for &b in key {
-        if b.is_ascii_alphanumeric() {
-            buf[n] = b.to_ascii_lowercase();
-            n += 1;
-        }
-    }
-    n
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Byte-level entry: C (mbutils.c pg_char_to_encoding) cleans the name
 /// byte-wise and never encoding-validates it, so non-UTF-8 bytes must not
 /// reject the whole name — reachable via SQL_ASCII server encodings.
 /// Divergence #10 (proofs/encnames): the SQL wrapper's former
 /// from_utf8(..).unwrap_or("") returned -1 where C returns the cleaned
 /// match (ground-truthed glibc PG 18.4).

---- divergence10_regression::non_utf8_name_cleans_byte_wise stdout ----

thread 'divergence10_regression::non_utf8_name_cleans_byte_wise' (79421) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1335:9:
assertion `left == right` failed
  left: -1
 right: 6

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (79431) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:480:5:
assertion `left == right` failed
  left: -1
 right: 6

failures:
    divergence10_regression::non_utf8_name_cleans_byte_wise
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
