*** crates/backend/utils/mb/mbutils/src/lib.rs:179:15: replace += with -= in clean_encoding_name

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in clean_encoding_name
@@ -171,17 +171,17 @@
 const NAMEDATALEN: usize = 64;
 
 // clean_encoding_name (encnames.c): keep alnum, ASCII-lowercase.
 fn clean_encoding_name(key: &[u8], buf: &mut [u8; NAMEDATALEN]) -> usize {
     let mut n = 0;
     for &b in key {
         if b.is_ascii_alphanumeric() {
             buf[n] = b.to_ascii_lowercase();
-            n += 1;
+            n -= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
     n
 }
 
 /// Byte-level entry: C (mbutils.c pg_char_to_encoding) cleans the name
 /// byte-wise and never encoding-validates it, so non-UTF-8 bytes must not
 /// reject the whole name — reachable via SQL_ASCII server encodings.

---- divergence10_regression::non_utf8_name_cleans_byte_wise stdout ----

thread 'divergence10_regression::non_utf8_name_cleans_byte_wise' (80259) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:179:13:
attempt to subtract with overflow

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (80271) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:179:13:
attempt to subtract with overflow

failures:
    divergence10_regression::non_utf8_name_cleans_byte_wise
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
