*** crates/backend/utils/mb/mbutils/src/lib.rs:192:24: replace || with && in pg_char_to_encoding_bytes

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace || with && in pg_char_to_encoding_bytes
@@ -184,17 +184,17 @@
 
 /// Byte-level entry: C (mbutils.c pg_char_to_encoding) cleans the name
 /// byte-wise and never encoding-validates it, so non-UTF-8 bytes must not
 /// reject the whole name — reachable via SQL_ASCII server encodings.
 /// Divergence #10 (proofs/encnames): the SQL wrapper's former
 /// from_utf8(..).unwrap_or("") returned -1 where C returns the cleaned
 /// match (ground-truthed glibc PG 18.4).
 pub fn pg_char_to_encoding_bytes(name: &[u8]) -> pg_enc {
-    if name.is_empty() || name.len() >= NAMEDATALEN {
+    if name.is_empty() && /* ~ changed by cargo-mutants ~ */ name.len() >= NAMEDATALEN {
         return -1;
     }
     let mut buf = [0u8; NAMEDATALEN];
     let n = clean_encoding_name(name, &mut buf);
     let key = &buf[..n];
     match PG_ENCNAME.binary_search_by(|(nm, _)| nm.as_bytes().cmp(key)) {
         Ok(idx) => PG_ENCNAME[idx].1,
         Err(_) => -1,

*** result: Success
