*** crates/backend/utils/mb/mbutils/src/lib.rs:192:38: replace >= with < in pg_char_to_encoding_bytes

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace >= with < in pg_char_to_encoding_bytes
@@ -184,17 +184,17 @@
 
 /// Byte-level entry: C (mbutils.c pg_char_to_encoding) cleans the name
 /// byte-wise and never encoding-validates it, so non-UTF-8 bytes must not
 /// reject the whole name — reachable via SQL_ASCII server encodings.
 /// Divergence #10 (proofs/encnames): the SQL wrapper's former
 /// from_utf8(..).unwrap_or("") returned -1 where C returns the cleaned
 /// match (ground-truthed glibc PG 18.4).
 pub fn pg_char_to_encoding_bytes(name: &[u8]) -> pg_enc {
-    if name.is_empty() || name.len() >= NAMEDATALEN {
+    if name.is_empty() || name.len() < /* ~ changed by cargo-mutants ~ */ NAMEDATALEN {
         return -1;
     }
     let mut buf = [0u8; NAMEDATALEN];
     let n = clean_encoding_name(name, &mut buf);
     let key = &buf[..n];
     match PG_ENCNAME.binary_search_by(|(nm, _)| nm.as_bytes().cmp(key)) {
         Ok(idx) => PG_ENCNAME[idx].1,
         Err(_) => -1,

---- divergence10_regression::non_utf8_name_cleans_byte_wise stdout ----

thread 'divergence10_regression::non_utf8_name_cleans_byte_wise' (80517) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1342:9:
assertion `left == right` failed
  left: -1
 right: 6

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (80527) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:480:5:
assertion `left == right` failed
  left: -1
 right: 6

failures:
    divergence10_regression::non_utf8_name_cleans_byte_wise
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
