*** crates/backend/utils/mb/mbutils/src/lib.rs:192:5: replace pg_char_to_encoding_bytes -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_char_to_encoding_bytes -> pg_enc with Default::default()
@@ -184,26 +184,17 @@
 
 /// Byte-level entry: C (mbutils.c pg_char_to_encoding) cleans the name
 /// byte-wise and never encoding-validates it, so non-UTF-8 bytes must not
 /// reject the whole name — reachable via SQL_ASCII server encodings.
 /// Divergence #10 (proofs/encnames): the SQL wrapper's former
 /// from_utf8(..).unwrap_or("") returned -1 where C returns the cleaned
 /// match (ground-truthed glibc PG 18.4).
 pub fn pg_char_to_encoding_bytes(name: &[u8]) -> pg_enc {
-    if name.is_empty() || name.len() >= NAMEDATALEN {
-        return -1;
-    }
-    let mut buf = [0u8; NAMEDATALEN];
-    let n = clean_encoding_name(name, &mut buf);
-    let key = &buf[..n];
-    match PG_ENCNAME.binary_search_by(|(nm, _)| nm.as_bytes().cmp(key)) {
-        Ok(idx) => PG_ENCNAME[idx].1,
-        Err(_) => -1,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_char_to_encoding(name: &str) -> pg_enc {
     pg_char_to_encoding_bytes(name.as_bytes())
 }
 
 pub fn pg_valid_client_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);

---- divergence10_regression::non_utf8_name_cleans_byte_wise stdout ----

thread 'divergence10_regression::non_utf8_name_cleans_byte_wise' (80448) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1333:9:
assertion `left == right` failed
  left: 0
 right: 6

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (80478) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:480:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    divergence10_regression::non_utf8_name_cleans_byte_wise
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
