*** crates/backend/utils/mb/mbutils/src/lib.rs:200:19: delete - in pg_char_to_encoding_bytes

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete - in pg_char_to_encoding_bytes
@@ -192,17 +192,17 @@
     if name.is_empty() || name.len() >= NAMEDATALEN {
         return -1;
     }
     let mut buf = [0u8; NAMEDATALEN];
     let n = clean_encoding_name(name, &mut buf);
     let key = &buf[..n];
     match PG_ENCNAME.binary_search_by(|(nm, _)| nm.as_bytes().cmp(key)) {
         Ok(idx) => PG_ENCNAME[idx].1,
-        Err(_) => -1,
+        Err(_) =>  /* ~ changed by cargo-mutants ~ */1,
     }
 }
 
 pub fn pg_char_to_encoding(name: &str) -> pg_enc {
     pg_char_to_encoding_bytes(name.as_bytes())
 }
 
 pub fn pg_valid_client_encoding(name: &str) -> pg_enc {

---- divergence10_regression::non_utf8_name_cleans_byte_wise stdout ----

thread 'divergence10_regression::non_utf8_name_cleans_byte_wise' (80707) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:1344:9:
assertion `left == right` failed
  left: 1
 right: -1

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (80727) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:485:5:
assertion `left == right` failed
  left: 1
 right: -1

failures:
    divergence10_regression::non_utf8_name_cleans_byte_wise
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
