*** crates/backend/utils/mb/mbutils/src/lib.rs:209:5: replace pg_valid_client_encoding -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_valid_client_encoding -> pg_enc with Default::default()
@@ -201,21 +201,17 @@
     }
 }
 
 pub fn pg_char_to_encoding(name: &str) -> pg_enc {
     pg_char_to_encoding_bytes(name.as_bytes())
 }
 
 pub fn pg_valid_client_encoding(name: &str) -> pg_enc {
-    let enc = pg_char_to_encoding(name);
-    if enc < 0 || !pg_valid_fe_encoding(enc) {
-        return -1;
-    }
-    enc
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_valid_server_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);
     if enc < 0 || !pg_valid_be_encoding(enc) {
         return -1;
     }
     enc

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (80809) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:487:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
