*** crates/backend/utils/mb/mbutils/src/lib.rs:210:12: replace < with <= in pg_valid_client_encoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_valid_client_encoding
@@ -202,17 +202,17 @@
 }
 
 pub fn pg_char_to_encoding(name: &str) -> pg_enc {
     pg_char_to_encoding_bytes(name.as_bytes())
 }
 
 pub fn pg_valid_client_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);
-    if enc < 0 || !pg_valid_fe_encoding(enc) {
+    if enc <= /* ~ changed by cargo-mutants ~ */ 0 || !pg_valid_fe_encoding(enc) {
         return -1;
     }
     enc
 }
 
 pub fn pg_valid_server_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);
     if enc < 0 || !pg_valid_be_encoding(enc) {

*** result: Success
