*** crates/backend/utils/mb/mbutils/src/lib.rs:210:19: delete ! in pg_valid_client_encoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in pg_valid_client_encoding
@@ -202,17 +202,17 @@
 }
 
 pub fn pg_char_to_encoding(name: &str) -> pg_enc {
     pg_char_to_encoding_bytes(name.as_bytes())
 }
 
 pub fn pg_valid_client_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);
-    if enc < 0 || !pg_valid_fe_encoding(enc) {
+    if enc < 0 ||  /* ~ changed by cargo-mutants ~ */pg_valid_fe_encoding(enc) {
         return -1;
     }
     enc
 }
 
 pub fn pg_valid_server_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);
     if enc < 0 || !pg_valid_be_encoding(enc) {

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (81079) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:487:5:
assertion `left == right` failed
  left: -1
 right: 6

failures:
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
