*** crates/backend/utils/mb/mbutils/src/lib.rs:219:16: delete - in pg_valid_server_encoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete - in pg_valid_server_encoding
@@ -211,17 +211,17 @@
         return -1;
     }
     enc
 }
 
 pub fn pg_valid_server_encoding(name: &str) -> pg_enc {
     let enc = pg_char_to_encoding(name);
     if enc < 0 || !pg_valid_be_encoding(enc) {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     enc
 }
 
 pub fn pg_encoding_to_char(encoding: pg_enc) -> &'static str {
     if pg_valid_encoding(encoding) {
         enc_name(encoding)
     } else {

---- tests::encname_lookup_matches_encnames_c stdout ----

thread 'tests::encname_lookup_matches_encnames_c' (81646) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:489:5:
assertion `left == right` failed
  left: 1
 right: -1

failures:
    tests::encname_lookup_matches_encnames_c

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
