*** crates/backend/utils/mb/mbutils/src/lib.rs:263:5: replace database_encoding -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace database_encoding -> pg_enc with Default::default()
@@ -255,17 +255,17 @@
     static UTF8_TO_SERVER_CONV_PROC: Cell<Option<ResolvedConvProc>> = const { Cell::new(None) };
     // C ConvProcList lives in TopMemoryContext for the backend lifetime; no
     // arena outlives the backend thread, so a std Vec of Copy entries.
     static CONV_PROC_LIST: RefCell<Vec<ConvProcInfo>> = const { RefCell::new(Vec::new()) };
 }
 
 #[inline]
 fn database_encoding() -> pg_enc {
-    DATABASE_ENCODING.with(|e| e.get())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline]
 fn client_encoding() -> pg_enc {
     CLIENT_ENCODING.with(|e| e.get())
 }
 
 fn resolve_conv_proc(proc: Oid) -> PgResult<ResolvedConvProc> {

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (81861) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:262:5:
assertion failed: pg_any_to_server(ctx.mcx(), b"\xff", PG_SQL_ASCII).is_err()

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (81867) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:411:5:
assertion `left == right` failed
  left: 187650172654764
 right: 187650172651872

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (81872) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:78:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::charinc_dispatch_and_generic
    tests::database_encoding_accessors
    tests::mb2wchar_roundtrip_utf8
    tests::mbcharcliplen_counts_characters
    tests::mbcliplen_utf8_boundaries
    tests::mblen_family
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::prepare_outside_transaction_needs_cache
    tests::seams_installed
    tests::unicode_to_server_utf8_paths

test result: FAILED. 20 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
