*** crates/backend/utils/mb/mbutils/src/lib.rs:268:5: replace client_encoding -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace client_encoding -> pg_enc with Default::default()
@@ -260,17 +260,17 @@
 
 #[inline]
 fn database_encoding() -> pg_enc {
     DATABASE_ENCODING.with(|e| e.get())
 }
 
 #[inline]
 fn client_encoding() -> pg_enc {
-    CLIENT_ENCODING.with(|e| e.get())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn resolve_conv_proc(proc: Oid) -> PgResult<ResolvedConvProc> {
     let finfo = fmgr_seams::fmgr_info::call(proc)?;
     Ok(ResolvedConvProc {
         fn_addr: finfo.fn_addr,
     })
 }

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (81870) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:42:5:
assertion failed: server_to_client_conversion_needed()

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (81904) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:51:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    tests::conversion_needed_truth_table
    tests::pending_client_encoding_applied_at_startup

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
