*** crates/backend/utils/mb/mbutils/src/lib.rs:286:32: replace == with != in PrepareClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in PrepareClientEncoding
@@ -278,17 +278,17 @@
 pub fn PrepareClientEncoding(encoding: pg_enc) -> PgResult<i32> {
     if !pg_valid_fe_encoding(encoding) {
         return Ok(-1);
     }
     if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
-    if current_server_encoding == encoding
+    if current_server_encoding != /* ~ changed by cargo-mutants ~ */ encoding
         || current_server_encoding == PG_SQL_ASCII
         || encoding == PG_SQL_ASCII
     {
         return Ok(0);
     }
 
     if xact_seams::is_transaction_state::call() {
         let to_server_proc =

---- tests::prepare_outside_transaction_needs_cache stdout ----

thread 'tests::prepare_outside_transaction_needs_cache' (82598) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:69:5:
assertion `left == right` failed
  left: 0
 right: -1

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (82596) panicked at crates/backend/access/transam/xact_seams/src/lib.rs:95:1:
seam not installed: xact_seams::is_transaction_state

failures:
    tests::pending_client_encoding_applied_at_startup
    tests::prepare_outside_transaction_needs_cache

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
