*** crates/backend/utils/mb/mbutils/src/lib.rs:302:23: delete - in PrepareClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete - in PrepareClientEncoding
@@ -294,17 +294,17 @@
         let to_server_proc =
             namespace_seams::find_default_conversion_proc::call(encoding, current_server_encoding)?;
         if to_server_proc == InvalidOid {
             return Ok(-1);
         }
         let to_client_proc =
             namespace_seams::find_default_conversion_proc::call(current_server_encoding, encoding)?;
         if to_client_proc == InvalidOid {
-            return Ok(-1);
+            return Ok( /* ~ changed by cargo-mutants ~ */1);
         }
         let convinfo = ConvProcInfo {
             s_encoding: current_server_encoding,
             c_encoding: encoding,
             to_server: resolve_conv_proc(to_server_proc)?,
             to_client: resolve_conv_proc(to_client_proc)?,
         };
         // Newest entry at the head; SetClientEncoding prunes older duplicates.

*** result: Success
