*** crates/backend/utils/mb/mbutils/src/lib.rs:325:8: delete ! in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in SetClientEncoding
@@ -317,17 +317,17 @@
                 info.s_encoding == current_server_encoding && info.c_encoding == encoding
             })
         });
         Ok(if found { 0 } else { -1 })
     }
 }
 
 pub fn SetClientEncoding(encoding: pg_enc) -> PgResult<i32> {
-    if !pg_valid_fe_encoding(encoding) {
+    if  /* ~ changed by cargo-mutants ~ */pg_valid_fe_encoding(encoding) {
         return Ok(-1);
     }
     if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         PENDING_CLIENT_ENCODING.with(|c| c.set(encoding));
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
     if current_server_encoding == encoding

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (83377) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:258:32:

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (83393) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:35:32:

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (83384) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:268:32:

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::ascii_server_rejects_highbit_from_client_only_encoding
    tests::conversion_needed_truth_table
    tests::no_conversion_returns_none_without_allocating
    tests::pending_client_encoding_applied_at_startup
    tests::prepare_outside_transaction_needs_cache
    tests::seams_installed
    tests::server_to_any_identity_cases
    tests::set_client_encoding_rejects_invalid
    tests::sql_ascii_client_is_identity

test result: FAILED. 24 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
