*** crates/backend/utils/mb/mbutils/src/lib.rs:326:19: delete - in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete - in SetClientEncoding
@@ -318,17 +318,17 @@
             })
         });
         Ok(if found { 0 } else { -1 })
     }
 }
 
 pub fn SetClientEncoding(encoding: pg_enc) -> PgResult<i32> {
     if !pg_valid_fe_encoding(encoding) {
-        return Ok(-1);
+        return Ok( /* ~ changed by cargo-mutants ~ */1);
     }
     if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         PENDING_CLIENT_ENCODING.with(|c| c.set(encoding));
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
     if current_server_encoding == encoding
         || current_server_encoding == PG_SQL_ASCII

---- tests::set_client_encoding_rejects_invalid stdout ----

thread 'tests::set_client_encoding_rejects_invalid' (83402) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:59:5:
assertion `left == right` failed
  left: 1
 right: -1

failures:
    tests::set_client_encoding_rejects_invalid

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
