*** crates/backend/utils/mb/mbutils/src/lib.rs:328:8: delete ! in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in SetClientEncoding
@@ -320,17 +320,17 @@
         Ok(if found { 0 } else { -1 })
     }
 }
 
 pub fn SetClientEncoding(encoding: pg_enc) -> PgResult<i32> {
     if !pg_valid_fe_encoding(encoding) {
         return Ok(-1);
     }
-    if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
+    if  /* ~ changed by cargo-mutants ~ */BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         PENDING_CLIENT_ENCODING.with(|c| c.set(encoding));
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
     if current_server_encoding == encoding
         || current_server_encoding == PG_SQL_ASCII
         || encoding == PG_SQL_ASCII
     {

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (83579) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:49:5:
assertion `left == right` failed
  left: 6
 right: 0

---- tests::prepare_outside_transaction_needs_cache stdout ----

thread 'tests::prepare_outside_transaction_needs_cache' (83581) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:70:5:
assertion `left == right` failed
  left: 0
 right: -1

failures:
    tests::pending_client_encoding_applied_at_startup
    tests::prepare_outside_transaction_needs_cache

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
