*** crates/backend/utils/mb/mbutils/src/lib.rs:334:36: replace == with != in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in SetClientEncoding
@@ -326,17 +326,17 @@
         return Ok(-1);
     }
     if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         PENDING_CLIENT_ENCODING.with(|c| c.set(encoding));
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
     if current_server_encoding == encoding
-        || current_server_encoding == PG_SQL_ASCII
+        || current_server_encoding != /* ~ changed by cargo-mutants ~ */ PG_SQL_ASCII
         || encoding == PG_SQL_ASCII
     {
         CLIENT_ENCODING.with(|c| c.set(encoding));
         TO_SERVER_CONV_PROC.with(|p| p.set(None));
         TO_CLIENT_CONV_PROC.with(|p| p.set(None));
         return Ok(0);
     }

---- tests::prepare_outside_transaction_needs_cache stdout ----

thread 'tests::prepare_outside_transaction_needs_cache' (83864) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:70:5:
assertion `left == right` failed
  left: 0
 right: -1

failures:
    tests::prepare_outside_transaction_needs_cache

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
