*** crates/backend/utils/mb/mbutils/src/lib.rs:334:9: replace || with && in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace || with && in SetClientEncoding
@@ -326,17 +326,17 @@
         return Ok(-1);
     }
     if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         PENDING_CLIENT_ENCODING.with(|c| c.set(encoding));
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
     if current_server_encoding == encoding
-        || current_server_encoding == PG_SQL_ASCII
+        && /* ~ changed by cargo-mutants ~ */ current_server_encoding == PG_SQL_ASCII
         || encoding == PG_SQL_ASCII
     {
         CLIENT_ENCODING.with(|c| c.set(encoding));
         TO_SERVER_CONV_PROC.with(|p| p.set(None));
         TO_CLIENT_CONV_PROC.with(|p| p.set(None));
         return Ok(0);
     }

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (83659) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:50:32:

failures:
    tests::pending_client_encoding_applied_at_startup

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
