*** crates/backend/utils/mb/mbutils/src/lib.rs:335:21: replace == with != in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in SetClientEncoding
@@ -327,17 +327,17 @@
     }
     if !BACKEND_STARTUP_COMPLETE.with(|c| c.get()) {
         PENDING_CLIENT_ENCODING.with(|c| c.set(encoding));
         return Ok(0);
     }
     let current_server_encoding = database_encoding();
     if current_server_encoding == encoding
         || current_server_encoding == PG_SQL_ASCII
-        || encoding == PG_SQL_ASCII
+        || encoding != /* ~ changed by cargo-mutants ~ */ PG_SQL_ASCII
     {
         CLIENT_ENCODING.with(|c| c.set(encoding));
         TO_SERVER_CONV_PROC.with(|p| p.set(None));
         TO_CLIENT_CONV_PROC.with(|p| p.set(None));
         return Ok(0);
     }
 
     let mut found = false;

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (83808) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:258:32:

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (83816) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:35:32:

---- tests::no_conversion_returns_none_without_allocating stdout ----

thread 'tests::no_conversion_returns_none_without_allocating' (83839) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:11:32:

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::conversion_needed_truth_table
    tests::no_conversion_returns_none_without_allocating
    tests::prepare_outside_transaction_needs_cache
    tests::seams_installed
    tests::server_to_any_identity_cases
    tests::set_client_encoding_rejects_invalid
    tests::sql_ascii_client_is_identity

test result: FAILED. 26 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
