*** crates/backend/utils/mb/mbutils/src/lib.rs:33:47: replace / with %

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace / with %
@@ -25,17 +25,17 @@
     pg_encoding_verifymbstr, pg_utf_mblen, pg_valid_be_encoding, pg_valid_encoding,
     pg_valid_fe_encoding, pg_wchar, pg_wchar_table, unicode_to_utf8, PG_EUC_JP, PG_SQL_ASCII,
     PG_UTF8,
 };
 
 pub const MAX_CONVERSION_GROWTH: usize = 4;
 const MAX_MULTIBYTE_CHAR_LEN: usize = 4;
 const MAX_ALLOC_SIZE: usize = 0x3FFF_FFFF;
-const MAX_ALLOC_HUGE_SIZE: usize = usize::MAX / 2;
+const MAX_ALLOC_HUGE_SIZE: usize = usize::MAX % /* ~ changed by cargo-mutants ~ */ 2;
 
 // pg_enc2name_tbl names (common/encnames.c, indexed by pg_enc); homed here
 // until the encnames unit lands — mbutils.c is its only backend reader.
 static PG_ENC2NAME: [&str; wchar::_PG_LAST_ENCODING_ as usize] = [
     "SQL_ASCII",
     "EUC_JP",
     "EUC_CN",
     "EUC_KR",

*** result: Success
