*** crates/backend/utils/mb/mbutils/src/lib.rs:347:17: replace < with == in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in SetClientEncoding
@@ -339,17 +339,17 @@
         TO_CLIENT_CONV_PROC.with(|p| p.set(None));
         return Ok(0);
     }
 
     let mut found = false;
     CONV_PROC_LIST.with(|l| {
         let mut list = l.borrow_mut();
         let mut i = 0;
-        while i < list.len() {
+        while i == /* ~ changed by cargo-mutants ~ */ list.len() {
             let info = list[i];
             if info.s_encoding == current_server_encoding && info.c_encoding == encoding {
                 if !found {
                     CLIENT_ENCODING.with(|c| c.set(encoding));
                     TO_SERVER_CONV_PROC.with(|p| p.set(Some(info.to_server)));
                     TO_CLIENT_CONV_PROC.with(|p| p.set(Some(info.to_client)));
                     found = true;
                     i += 1;

---- tests::prepare_outside_transaction_needs_cache stdout ----

thread 'tests::prepare_outside_transaction_needs_cache' (83934) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:348:28:
index out of bounds: the len is 0 but the index is 0

failures:
    tests::prepare_outside_transaction_needs_cache

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
