*** crates/backend/utils/mb/mbutils/src/lib.rs:364:30: delete - in SetClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete - in SetClientEncoding
@@ -356,17 +356,17 @@
                 } else {
                     list.remove(i);
                 }
             } else {
                 i += 1;
             }
         }
     });
-    Ok(if found { 0 } else { -1 })
+    Ok(if found { 0 } else {  /* ~ changed by cargo-mutants ~ */1 })
 }
 
 pub fn InitializeClientEncoding() -> PgResult<()> {
     debug_assert!(!BACKEND_STARTUP_COMPLETE.with(|c| c.get()));
     BACKEND_STARTUP_COMPLETE.with(|c| c.set(true));
 
     let pending = PENDING_CLIENT_ENCODING.with(|c| c.get());
     if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? < 0 {

---- tests::prepare_outside_transaction_needs_cache stdout ----

thread 'tests::prepare_outside_transaction_needs_cache' (84615) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:70:5:
assertion `left == right` failed
  left: 1
 right: -1

failures:
    tests::prepare_outside_transaction_needs_cache

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
