*** crates/backend/utils/mb/mbutils/src/lib.rs:372:44: replace || with && in InitializeClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace || with && in InitializeClientEncoding
@@ -364,17 +364,17 @@
     Ok(if found { 0 } else { -1 })
 }
 
 pub fn InitializeClientEncoding() -> PgResult<()> {
     debug_assert!(!BACKEND_STARTUP_COMPLETE.with(|c| c.get()));
     BACKEND_STARTUP_COMPLETE.with(|c| c.set(true));
 
     let pending = PENDING_CLIENT_ENCODING.with(|c| c.get());
-    if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? < 0 {
+    if PrepareClientEncoding(pending)? < 0 && /* ~ changed by cargo-mutants ~ */ SetClientEncoding(pending)? < 0 {
         return Err(conversion_not_supported_fatal(pending));
     }
 
     let current_server_encoding = database_encoding();
     if current_server_encoding != PG_UTF8 && current_server_encoding != PG_SQL_ASCII {
         let utf8_to_server_proc =
             namespace_seams::find_default_conversion_proc::call(PG_UTF8, current_server_encoding)?;
         if utf8_to_server_proc != InvalidOid {

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (84828) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:51:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    tests::pending_client_encoding_applied_at_startup

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
