*** crates/backend/utils/mb/mbutils/src/lib.rs:372:75: replace < with == in InitializeClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in InitializeClientEncoding
@@ -364,17 +364,17 @@
     Ok(if found { 0 } else { -1 })
 }
 
 pub fn InitializeClientEncoding() -> PgResult<()> {
     debug_assert!(!BACKEND_STARTUP_COMPLETE.with(|c| c.get()));
     BACKEND_STARTUP_COMPLETE.with(|c| c.set(true));
 
     let pending = PENDING_CLIENT_ENCODING.with(|c| c.get());
-    if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? < 0 {
+    if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? == /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(conversion_not_supported_fatal(pending));
     }
 
     let current_server_encoding = database_encoding();
     if current_server_encoding != PG_UTF8 && current_server_encoding != PG_SQL_ASCII {
         let utf8_to_server_proc =
             namespace_seams::find_default_conversion_proc::call(PG_UTF8, current_server_encoding)?;
         if utf8_to_server_proc != InvalidOid {

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (85074) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:258:32:

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (85078) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:268:32:

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (85083) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:35:32:

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::ascii_server_rejects_highbit_from_client_only_encoding
    tests::conversion_needed_truth_table
    tests::no_conversion_returns_none_without_allocating
    tests::pending_client_encoding_applied_at_startup
    tests::prepare_outside_transaction_needs_cache
    tests::seams_installed
    tests::server_to_any_identity_cases
    tests::set_client_encoding_rejects_invalid
    tests::sql_ascii_client_is_identity

test result: FAILED. 24 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
