*** crates/backend/utils/mb/mbutils/src/lib.rs:377:32: replace != with == in InitializeClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in InitializeClientEncoding
@@ -369,17 +369,17 @@
     BACKEND_STARTUP_COMPLETE.with(|c| c.set(true));
 
     let pending = PENDING_CLIENT_ENCODING.with(|c| c.get());
     if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? < 0 {
         return Err(conversion_not_supported_fatal(pending));
     }
 
     let current_server_encoding = database_encoding();
-    if current_server_encoding != PG_UTF8 && current_server_encoding != PG_SQL_ASCII {
+    if current_server_encoding == /* ~ changed by cargo-mutants ~ */ PG_UTF8 && current_server_encoding != PG_SQL_ASCII {
         let utf8_to_server_proc =
             namespace_seams::find_default_conversion_proc::call(PG_UTF8, current_server_encoding)?;
         if utf8_to_server_proc != InvalidOid {
             let resolved = resolve_conv_proc(utf8_to_server_proc)?;
             UTF8_TO_SERVER_CONV_PROC.with(|p| p.set(Some(resolved)));
         }
     }
     Ok(())

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (85341) panicked at crates/backend/catalog/namespace_seams/src/lib.rs:129:1:
seam not installed: namespace_seams::find_default_conversion_proc

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (85348) panicked at crates/backend/catalog/namespace_seams/src/lib.rs:129:1:
seam not installed: namespace_seams::find_default_conversion_proc

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (85376) panicked at crates/backend/catalog/namespace_seams/src/lib.rs:129:1:
seam not installed: namespace_seams::find_default_conversion_proc

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::conversion_needed_truth_table
    tests::no_conversion_returns_none_without_allocating
    tests::pending_client_encoding_applied_at_startup
    tests::prepare_outside_transaction_needs_cache
    tests::seams_installed
    tests::server_to_any_identity_cases
    tests::set_client_encoding_rejects_invalid
    tests::sql_ascii_client_is_identity

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
