*** crates/backend/utils/mb/mbutils/src/lib.rs:377:70: replace != with == in InitializeClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in InitializeClientEncoding
@@ -369,17 +369,17 @@
     BACKEND_STARTUP_COMPLETE.with(|c| c.set(true));
 
     let pending = PENDING_CLIENT_ENCODING.with(|c| c.get());
     if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? < 0 {
         return Err(conversion_not_supported_fatal(pending));
     }
 
     let current_server_encoding = database_encoding();
-    if current_server_encoding != PG_UTF8 && current_server_encoding != PG_SQL_ASCII {
+    if current_server_encoding != PG_UTF8 && current_server_encoding == /* ~ changed by cargo-mutants ~ */ PG_SQL_ASCII {
         let utf8_to_server_proc =
             namespace_seams::find_default_conversion_proc::call(PG_UTF8, current_server_encoding)?;
         if utf8_to_server_proc != InvalidOid {
             let resolved = resolve_conv_proc(utf8_to_server_proc)?;
             UTF8_TO_SERVER_CONV_PROC.with(|p| p.set(Some(resolved)));
         }
     }
     Ok(())

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (85350) panicked at crates/backend/catalog/namespace_seams/src/lib.rs:129:1:
seam not installed: namespace_seams::find_default_conversion_proc

failures:
    tests::ascii_server_rejects_highbit_from_client_only_encoding

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
