*** crates/backend/utils/mb/mbutils/src/lib.rs:380:32: replace != with == in InitializeClientEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in InitializeClientEncoding
@@ -372,17 +372,17 @@
     if PrepareClientEncoding(pending)? < 0 || SetClientEncoding(pending)? < 0 {
         return Err(conversion_not_supported_fatal(pending));
     }
 
     let current_server_encoding = database_encoding();
     if current_server_encoding != PG_UTF8 && current_server_encoding != PG_SQL_ASCII {
         let utf8_to_server_proc =
             namespace_seams::find_default_conversion_proc::call(PG_UTF8, current_server_encoding)?;
-        if utf8_to_server_proc != InvalidOid {
+        if utf8_to_server_proc == /* ~ changed by cargo-mutants ~ */ InvalidOid {
             let resolved = resolve_conv_proc(utf8_to_server_proc)?;
             UTF8_TO_SERVER_CONV_PROC.with(|p| p.set(Some(resolved)));
         }
     }
     Ok(())
 }
 
 pub fn pg_get_client_encoding() -> pg_enc {

*** result: Success
