*** crates/backend/utils/mb/mbutils/src/lib.rs:389:5: replace pg_get_client_encoding -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_get_client_encoding -> pg_enc with Default::default()
@@ -381,17 +381,17 @@
             let resolved = resolve_conv_proc(utf8_to_server_proc)?;
             UTF8_TO_SERVER_CONV_PROC.with(|p| p.set(Some(resolved)));
         }
     }
     Ok(())
 }
 
 pub fn pg_get_client_encoding() -> pg_enc {
-    client_encoding()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_get_client_encoding_name() -> &'static str {
     enc_name(client_encoding())
 }
 
 /// Invoke a conversion proc (C `FunctionCall6`): `dest` gets the worst-case
 /// `len * MAX_CONVERSION_GROWTH + 1` buffer, the proc writes a NUL-terminated

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (85480) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:51:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    tests::pending_client_encoding_applied_at_startup

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
