*** crates/backend/utils/mb/mbutils/src/lib.rs:393:5: replace pg_get_client_encoding_name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_get_client_encoding_name -> &'static str with "xyzzy"
@@ -385,17 +385,17 @@
     Ok(())
 }
 
 pub fn pg_get_client_encoding() -> pg_enc {
     client_encoding()
 }
 
 pub fn pg_get_client_encoding_name() -> &'static str {
-    enc_name(client_encoding())
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Invoke a conversion proc (C `FunctionCall6`): `dest` gets the worst-case
 /// `len * MAX_CONVERSION_GROWTH + 1` buffer, the proc writes a NUL-terminated
 /// string into it and returns the source-byte count converted.
 fn convert_with_proc<'mcx>(
     mcx: Mcx<'mcx>,
     proc: ResolvedConvProc,

---- tests::pending_client_encoding_applied_at_startup stdout ----

thread 'tests::pending_client_encoding_applied_at_startup' (85612) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:52:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "UTF8"

failures:
    tests::pending_client_encoding_applied_at_startup

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
