*** crates/backend/utils/mb/mbutils/src/lib.rs:444:21: replace == with != in pg_do_encoding_conversion

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_do_encoding_conversion
@@ -436,17 +436,17 @@
     mcx: Mcx<'mcx>,
     src: &[u8],
     src_encoding: pg_enc,
     dest_encoding: pg_enc,
 ) -> PgResult<Option<PgVec<'mcx, u8>>> {
     if src.is_empty() {
         return Ok(None);
     }
-    if src_encoding == dest_encoding {
+    if src_encoding != /* ~ changed by cargo-mutants ~ */ dest_encoding {
         return Ok(None);
     }
     if dest_encoding == PG_SQL_ASCII {
         return Ok(None);
     }
     if src_encoding == PG_SQL_ASCII {
         pg_verify_mbstr(dest_encoding, src, false)?;
         return Ok(None);

---- tests::do_encoding_conversion_identity_and_validation stdout ----

thread 'tests::do_encoding_conversion_identity_and_validation' (87330) panicked at crates/backend/access/transam/xact_seams/src/lib.rs:95:1:
seam not installed: xact_seams::is_transaction_state

failures:
    tests::do_encoding_conversion_identity_and_validation

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
