*** crates/backend/utils/mb/mbutils/src/lib.rs:455:8: delete ! in pg_do_encoding_conversion

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in pg_do_encoding_conversion
@@ -447,17 +447,17 @@
     if dest_encoding == PG_SQL_ASCII {
         return Ok(None);
     }
     if src_encoding == PG_SQL_ASCII {
         pg_verify_mbstr(dest_encoding, src, false)?;
         return Ok(None);
     }
 
-    if !xact_seams::is_transaction_state::call() {
+    if  /* ~ changed by cargo-mutants ~ */xact_seams::is_transaction_state::call() {
         return Err(internal_error(
             "cannot perform encoding conversion outside a transaction",
         ));
     }
 
     let proc = namespace_seams::find_default_conversion_proc::call(src_encoding, dest_encoding)?;
     if proc == InvalidOid {
         return Err(no_default_conversion_error(src_encoding, dest_encoding));

*** result: Success
