*** crates/backend/utils/mb/mbutils/src/lib.rs:462:13: replace == with != in pg_do_encoding_conversion

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_do_encoding_conversion
@@ -454,17 +454,17 @@
 
     if !xact_seams::is_transaction_state::call() {
         return Err(internal_error(
             "cannot perform encoding conversion outside a transaction",
         ));
     }
 
     let proc = namespace_seams::find_default_conversion_proc::call(src_encoding, dest_encoding)?;
-    if proc == InvalidOid {
+    if proc != /* ~ changed by cargo-mutants ~ */ InvalidOid {
         return Err(no_default_conversion_error(src_encoding, dest_encoding));
     }
 
     if src.len() >= MAX_ALLOC_HUGE_SIZE / MAX_CONVERSION_GROWTH {
         return Err(too_long_error(src.len()));
     }
 
     // General case: C's OidFunctionCall6 re-resolves per call (only the

*** result: Success
