*** crates/backend/utils/mb/mbutils/src/lib.rs:529:32: replace || with && in pg_any_to_server

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace || with && in pg_any_to_server
@@ -521,17 +521,17 @@
     s: &[u8],
     encoding: pg_enc,
 ) -> PgResult<Option<PgVec<'mcx, u8>>> {
     if s.is_empty() {
         return Ok(None);
     }
     let db_encoding = database_encoding();
 
-    if encoding == db_encoding || encoding == PG_SQL_ASCII {
+    if encoding == db_encoding && /* ~ changed by cargo-mutants ~ */ encoding == PG_SQL_ASCII {
         pg_verify_mbstr(db_encoding, s, false)?;
         return Ok(None);
     }
 
     if db_encoding == PG_SQL_ASCII {
         // No conversion possible; validate under the client encoding if it is
         // server-legal, else reject NULs and high-bit bytes outright.
         if pg_valid_be_encoding(encoding) {

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (89766) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:261:5:
assertion failed: pg_any_to_server(ctx.mcx(), b"\xff", PG_UTF8).is_err()

failures:
    tests::any_to_server_validates_even_without_conversion

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
