*** crates/backend/utils/mb/mbutils/src/lib.rs:534:20: replace == with != in pg_any_to_server

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_any_to_server
@@ -526,17 +526,17 @@
     }
     let db_encoding = database_encoding();
 
     if encoding == db_encoding || encoding == PG_SQL_ASCII {
         pg_verify_mbstr(db_encoding, s, false)?;
         return Ok(None);
     }
 
-    if db_encoding == PG_SQL_ASCII {
+    if db_encoding != /* ~ changed by cargo-mutants ~ */ PG_SQL_ASCII {
         // No conversion possible; validate under the client encoding if it is
         // server-legal, else reject NULs and high-bit bytes outright.
         if pg_valid_be_encoding(encoding) {
             pg_verify_mbstr(encoding, s, false)?;
         } else {
             for &b in s {
                 if b == 0 || (b & 0x80) != 0 {
                     return Err(invalid_byte_value_error(b));

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (89861) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:271:63:
called `Result::unwrap_err()` on an `Ok` value: None

failures:
    tests::ascii_server_rejects_highbit_from_client_only_encoding

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
