*** crates/backend/utils/mb/mbutils/src/lib.rs:541:33: replace & with ^ in pg_any_to_server

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace & with ^ in pg_any_to_server
@@ -533,17 +533,17 @@
 
     if db_encoding == PG_SQL_ASCII {
         // No conversion possible; validate under the client encoding if it is
         // server-legal, else reject NULs and high-bit bytes outright.
         if pg_valid_be_encoding(encoding) {
             pg_verify_mbstr(encoding, s, false)?;
         } else {
             for &b in s {
-                if b == 0 || (b & 0x80) != 0 {
+                if b == 0 || (b ^ /* ~ changed by cargo-mutants ~ */ 0x80) != 0 {
                     return Err(invalid_byte_value_error(b));
                 }
             }
         }
         return Ok(None);
     }
 
     if encoding == client_encoding() {

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (90267) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:270:60:

failures:
    tests::ascii_server_rejects_highbit_from_client_only_encoding

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
