*** crates/backend/utils/mb/mbutils/src/lib.rs:573:20: replace == with != in pg_server_to_any

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_server_to_any
@@ -565,17 +565,17 @@
     if s.is_empty() {
         return Ok(None);
     }
     let db_encoding = database_encoding();
 
     if encoding == db_encoding || encoding == PG_SQL_ASCII {
         return Ok(None);
     }
-    if db_encoding == PG_SQL_ASCII {
+    if db_encoding != /* ~ changed by cargo-mutants ~ */ PG_SQL_ASCII {
         pg_verify_mbstr(encoding, s, false)?;
         return Ok(None);
     }
     if encoding == client_encoding() {
         return perform_default_encoding_conversion(mcx, s, false);
     }
     pg_do_encoding_conversion(mcx, s, db_encoding, encoding)
 }

*** result: Success
