*** crates/backend/utils/mb/mbutils/src/lib.rs:577:17: replace == with != in pg_server_to_any

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_server_to_any
@@ -569,17 +569,17 @@
 
     if encoding == db_encoding || encoding == PG_SQL_ASCII {
         return Ok(None);
     }
     if db_encoding == PG_SQL_ASCII {
         pg_verify_mbstr(encoding, s, false)?;
         return Ok(None);
     }
-    if encoding == client_encoding() {
+    if encoding != /* ~ changed by cargo-mutants ~ */ client_encoding() {
         return perform_default_encoding_conversion(mcx, s, false);
     }
     pg_do_encoding_conversion(mcx, s, db_encoding, encoding)
 }
 
 /// The hoistable per-message test: `pg_server_to_client` is a guaranteed
 /// no-op iff the client encoding is the server encoding or SQL_ASCII
 /// (printtup resolves this once per result set — strategy lever 2).

*** result: Success
