*** crates/backend/utils/mb/mbutils/src/lib.rs:587:5: replace server_to_client_conversion_needed -> bool with false

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace server_to_client_conversion_needed -> bool with false
@@ -579,18 +579,17 @@
     }
     pg_do_encoding_conversion(mcx, s, db_encoding, encoding)
 }
 
 /// The hoistable per-message test: `pg_server_to_client` is a guaranteed
 /// no-op iff the client encoding is the server encoding or SQL_ASCII
 /// (printtup resolves this once per result set — strategy lever 2).
 pub fn server_to_client_conversion_needed() -> bool {
-    let client = client_encoding();
-    client != database_encoding() && client != PG_SQL_ASCII
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Uses the SetClientEncoding-cached proc, so it is safe outside transactions;
 /// with no conversion set up it performs none.
 fn perform_default_encoding_conversion<'mcx>(
     mcx: Mcx<'mcx>,
     src: &[u8],
     is_client_to_server: bool,

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (91393) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:42:5:
assertion failed: server_to_client_conversion_needed()

failures:
    tests::conversion_needed_truth_table

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
