*** crates/backend/utils/mb/mbutils/src/lib.rs:588:35: replace && with || in server_to_client_conversion_needed

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace && with || in server_to_client_conversion_needed
@@ -580,17 +580,17 @@
     pg_do_encoding_conversion(mcx, s, db_encoding, encoding)
 }
 
 /// The hoistable per-message test: `pg_server_to_client` is a guaranteed
 /// no-op iff the client encoding is the server encoding or SQL_ASCII
 /// (printtup resolves this once per result set — strategy lever 2).
 pub fn server_to_client_conversion_needed() -> bool {
     let client = client_encoding();
-    client != database_encoding() && client != PG_SQL_ASCII
+    client != database_encoding() || /* ~ changed by cargo-mutants ~ */ client != PG_SQL_ASCII
 }
 
 /// Uses the SetClientEncoding-cached proc, so it is safe outside transactions;
 /// with no conversion set up it performs none.
 fn perform_default_encoding_conversion<'mcx>(
     mcx: Mcx<'mcx>,
     src: &[u8],
     is_client_to_server: bool,

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (91399) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:36:5:
assertion failed: !server_to_client_conversion_needed()

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (91439) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:458:5:
assertion failed: !mbutils_seams::server_to_client_conversion_needed::call()

---- tests::sql_ascii_client_is_identity stdout ----

thread 'tests::sql_ascii_client_is_identity' (91445) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:27:5:
assertion failed: !server_to_client_conversion_needed()

failures:
    tests::conversion_needed_truth_table
    tests::seams_installed
    tests::sql_ascii_client_is_identity

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
