*** crates/backend/utils/mb/mbutils/src/lib.rs:619:18: replace > with < in perform_default_encoding_conversion

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with < in perform_default_encoding_conversion
@@ -611,17 +611,17 @@
     let Some(proc) = proc else {
         return Ok(None);
     };
 
     if src.len() >= MAX_ALLOC_HUGE_SIZE / MAX_CONVERSION_GROWTH {
         return Err(too_long_error(src.len()));
     }
     let (_, result) = convert_with_proc(mcx, proc, src_encoding, dest_encoding, src, false)?;
-    if src.len() > 1_000_000 && result.len() >= MAX_ALLOC_SIZE {
+    if src.len() < /* ~ changed by cargo-mutants ~ */ 1_000_000 && result.len() >= MAX_ALLOC_SIZE {
         return Err(too_long_error(src.len()));
     }
     Ok(Some(result))
 }
 
 /// Convert one Unicode code point to the server encoding (no trailing NUL).
 /// Relies on the InitializeClientEncoding-cached UTF8-to-server proc, so it is
 /// safe outside transactions (the parser calls it in aborted transactions).

*** result: Success
