*** crates/backend/utils/mb/mbutils/src/lib.rs:629:8: delete ! in pg_unicode_to_server

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in pg_unicode_to_server
@@ -621,17 +621,17 @@
     }
     Ok(Some(result))
 }
 
 /// Convert one Unicode code point to the server encoding (no trailing NUL).
 /// Relies on the InitializeClientEncoding-cached UTF8-to-server proc, so it is
 /// safe outside transactions (the parser calls it in aborted transactions).
 pub fn pg_unicode_to_server<'mcx>(mcx: Mcx<'mcx>, c: pg_wchar) -> PgResult<PgVec<'mcx, u8>> {
-    if !is_valid_unicode_codepoint(c) {
+    if  /* ~ changed by cargo-mutants ~ */is_valid_unicode_codepoint(c) {
         return Err(invalid_codepoint_error());
     }
     if c <= 0x7F {
         return slice_in(mcx, &[c as u8]);
     }
     let server_encoding = database_encoding();
     if server_encoding == PG_UTF8 {
         let mut buf = [0u8; MAX_MULTIBYTE_CHAR_LEN];

---- tests::unicode_to_server_without_proc_fails stdout ----

thread 'tests::unicode_to_server_without_proc_fails' (92784) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:339:5:
assertion `left == right` failed
  left: "invalid Unicode code point"
 right: "conversion between UTF8 and LATIN1 is not supported"

---- tests::unicode_to_server_utf8_paths stdout ----

thread 'tests::unicode_to_server_utf8_paths' (92783) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:315:56:

failures:
    tests::unicode_to_server_utf8_paths
    tests::unicode_to_server_without_proc_fails

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
