*** crates/backend/utils/mb/mbutils/src/lib.rs:658:8: delete ! in pg_unicode_to_server_noerror

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in pg_unicode_to_server_noerror
@@ -650,17 +650,17 @@
     Ok(out)
 }
 
 /// Like [`pg_unicode_to_server`], but conversion failure is `Ok(None)`.
 pub fn pg_unicode_to_server_noerror<'mcx>(
     mcx: Mcx<'mcx>,
     c: pg_wchar,
 ) -> PgResult<Option<PgVec<'mcx, u8>>> {
-    if !is_valid_unicode_codepoint(c) {
+    if  /* ~ changed by cargo-mutants ~ */is_valid_unicode_codepoint(c) {
         return Ok(None);
     }
     if c <= 0x7F {
         return Ok(Some(slice_in(mcx, &[c as u8])?));
     }
     let server_encoding = database_encoding();
     if server_encoding == PG_UTF8 {
         let mut buf = [0u8; MAX_MULTIBYTE_CHAR_LEN];

---- tests::unicode_to_server_utf8_paths stdout ----

thread 'tests::unicode_to_server_utf8_paths' (93217) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:325:5:
assertion failed: pg_unicode_to_server_noerror(ctx.mcx(), 0x11_0000).unwrap().is_none()

failures:
    tests::unicode_to_server_utf8_paths

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
