*** crates/backend/utils/mb/mbutils/src/lib.rs:665:24: replace == with != in pg_unicode_to_server_noerror

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_unicode_to_server_noerror
@@ -657,17 +657,17 @@
 ) -> PgResult<Option<PgVec<'mcx, u8>>> {
     if !is_valid_unicode_codepoint(c) {
         return Ok(None);
     }
     if c <= 0x7F {
         return Ok(Some(slice_in(mcx, &[c as u8])?));
     }
     let server_encoding = database_encoding();
-    if server_encoding == PG_UTF8 {
+    if server_encoding != /* ~ changed by cargo-mutants ~ */ PG_UTF8 {
         let mut buf = [0u8; MAX_MULTIBYTE_CHAR_LEN];
         unicode_to_utf8(c, &mut buf);
         let n = pg_utf_mblen(&buf) as usize;
         return Ok(Some(slice_in(mcx, &buf[..n])?));
     }
 
     let Some(proc) = UTF8_TO_SERVER_CONV_PROC.with(|p| p.get()) else {
         return Ok(None);

---- tests::unicode_to_server_without_proc_fails stdout ----

thread 'tests::unicode_to_server_without_proc_fails' (93384) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:343:5:
assertion failed: pg_unicode_to_server_noerror(ctx.mcx(), 0xE9).unwrap().is_none()

---- tests::unicode_to_server_utf8_paths stdout ----

thread 'tests::unicode_to_server_utf8_paths' (93381) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:329:66:
called `Option::unwrap()` on a `None` value

failures:
    tests::unicode_to_server_utf8_paths
    tests::unicode_to_server_without_proc_fails

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
