*** crates/backend/utils/mb/mbutils/src/lib.rs:680:18: replace == with != in pg_unicode_to_server_noerror

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_unicode_to_server_noerror
@@ -672,17 +672,17 @@
     let Some(proc) = UTF8_TO_SERVER_CONV_PROC.with(|p| p.get()) else {
         return Ok(None);
     };
     let mut c_as_utf8 = [0u8; MAX_MULTIBYTE_CHAR_LEN];
     unicode_to_utf8(c, &mut c_as_utf8);
     let n = pg_utf_mblen(&c_as_utf8) as usize;
     let (consumed, out) =
         convert_with_proc(mcx, proc, PG_UTF8, server_encoding, &c_as_utf8[..n], true)?;
-    Ok((consumed == n as i32).then_some(out))
+    Ok((consumed != /* ~ changed by cargo-mutants ~ */ n as i32).then_some(out))
 }
 
 pub fn pg_mb2wchar_with_len<'mcx>(mcx: Mcx<'mcx>, from: &[u8]) -> PgResult<PgVec<'mcx, pg_wchar>> {
     pg_encoding_mb2wchar_with_len(mcx, database_encoding(), from)
 }
 
 pub fn pg_encoding_mb2wchar_with_len<'mcx>(
     mcx: Mcx<'mcx>,

*** result: Success
