*** crates/backend/utils/mb/mbutils/src/lib.rs:696:26: replace + with - in pg_encoding_mb2wchar_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with - in pg_encoding_mb2wchar_with_len
@@ -688,17 +688,17 @@
     mcx: Mcx<'mcx>,
     encoding: pg_enc,
     from: &[u8],
 ) -> PgResult<PgVec<'mcx, pg_wchar>> {
     let conv = pg_wchar_table[encoding as usize]
         .mb2wchar_with_len
         .unwrap_or_else(|| panic!("mb2wchar: client-only encoding {encoding} has no converter"));
     let mut to: PgVec<'mcx, pg_wchar> = vec_with_capacity_in(mcx, from.len() + 1)?;
-    to.resize(from.len() + 1, 0);
+    to.resize(from.len() - /* ~ changed by cargo-mutants ~ */ 1, 0);
     let n = conv(from, &mut to);
     to.truncate(n as usize);
     Ok(to)
 }
 
 pub fn pg_wchar2mb_with_len<'mcx>(
     mcx: Mcx<'mcx>,
     from: &[pg_wchar],

---- tests::mb2wchar_roundtrip_utf8 stdout ----

thread 'tests::mb2wchar_roundtrip_utf8' (93894) panicked at crates/common/wchar/src/lib.rs:460:5:
index out of bounds: the len is 2 but the index is 2

---- tests::mule_internal_lc1_lc2_roundtrip stdout ----

thread 'tests::mule_internal_lc1_lc2_roundtrip' (93927) panicked at crates/common/wchar/src/lib.rs:597:5:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::mb2wchar_roundtrip_utf8
    tests::mule_internal_lc1_lc2_roundtrip

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
