*** crates/backend/utils/mb/mbutils/src/lib.rs:717:26: replace * with / in pg_encoding_wchar2mb_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace * with / in pg_encoding_wchar2mb_with_len
@@ -709,17 +709,17 @@
 pub fn pg_encoding_wchar2mb_with_len<'mcx>(
     mcx: Mcx<'mcx>,
     encoding: pg_enc,
     from: &[pg_wchar],
 ) -> PgResult<PgVec<'mcx, u8>> {
     let conv = pg_wchar_table[encoding as usize]
         .wchar2mb_with_len
         .unwrap_or_else(|| panic!("wchar2mb: client-only encoding {encoding} has no converter"));
-    let cap = from.len() * pg_wchar_table[encoding as usize].maxmblen as usize + 1;
+    let cap = from.len() / /* ~ changed by cargo-mutants ~ */ pg_wchar_table[encoding as usize].maxmblen as usize + 1;
     let mut to: PgVec<'mcx, u8> = vec_with_capacity_in(mcx, cap)?;
     to.resize(cap, 0);
     let n = conv(from, &mut to);
     to.truncate(n as usize);
     Ok(to)
 }
 
 /// Byte length of the leading character, bounded by the slice end (C's

---- tests::mb2wchar_roundtrip_utf8 stdout ----

thread 'tests::mb2wchar_roundtrip_utf8' (94686) panicked at crates/common/wchar/src/lib.rs:1430:9:
index out of bounds: the len is 0 but the index is 0

---- tests::mule_internal_lc1_lc2_roundtrip stdout ----

thread 'tests::mule_internal_lc1_lc2_roundtrip' (94729) panicked at crates/common/wchar/src/lib.rs:631:13:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::mb2wchar_roundtrip_utf8
    tests::mule_internal_lc1_lc2_roundtrip

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
