*** crates/backend/utils/mb/mbutils/src/lib.rs:717:80: replace + with * in pg_encoding_wchar2mb_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with * in pg_encoding_wchar2mb_with_len
@@ -709,17 +709,17 @@
 pub fn pg_encoding_wchar2mb_with_len<'mcx>(
     mcx: Mcx<'mcx>,
     encoding: pg_enc,
     from: &[pg_wchar],
 ) -> PgResult<PgVec<'mcx, u8>> {
     let conv = pg_wchar_table[encoding as usize]
         .wchar2mb_with_len
         .unwrap_or_else(|| panic!("wchar2mb: client-only encoding {encoding} has no converter"));
-    let cap = from.len() * pg_wchar_table[encoding as usize].maxmblen as usize + 1;
+    let cap = from.len() * pg_wchar_table[encoding as usize].maxmblen as usize * /* ~ changed by cargo-mutants ~ */ 1;
     let mut to: PgVec<'mcx, u8> = vec_with_capacity_in(mcx, cap)?;
     to.resize(cap, 0);
     let n = conv(from, &mut to);
     to.truncate(n as usize);
     Ok(to)
 }
 
 /// Byte length of the leading character, bounded by the slice end (C's

*** result: Success
