*** crates/backend/utils/mb/mbutils/src/lib.rs:730:24: replace > with == in pg_mblen_range

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with == in pg_mblen_range
@@ -722,17 +722,17 @@
     Ok(to)
 }
 
 /// Byte length of the leading character, bounded by the slice end (C's
 /// `pg_mblen_range(mbstr, end)`); errors if the character overruns it.
 pub fn pg_mblen_range(mbstr: &[u8]) -> PgResult<i32> {
     debug_assert!(!mbstr.is_empty());
     let length = pg_encoding_mblen(database_encoding(), mbstr);
-    if length as usize > mbstr.len() {
+    if length as usize == /* ~ changed by cargo-mutants ~ */ mbstr.len() {
         return Err(report_invalid_encoding_db(mbstr, length, mbstr.len() as i32));
     }
     Ok(length)
 }
 
 pub fn pg_mblen_with_len(mbstr: &[u8], limit: i32) -> PgResult<i32> {
     pg_encoding_mblen_with_len(database_encoding(), mbstr, limit)
 }

---- tests::mblen_family stdout ----

thread 'tests::mblen_family' (94986) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:223:54:

failures:
    tests::mblen_family

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
