*** crates/backend/utils/mb/mbutils/src/lib.rs:746:15: replace > with < in pg_encoding_mblen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with < in pg_encoding_mblen_with_len
@@ -738,17 +738,17 @@
 }
 
 /// [`pg_mblen_with_len`] parameterized by encoding (mbutils.c
 /// `pg_mblen_with_len`, generalized the way `pg_encoding_mbstrlen_with_len`
 /// generalizes `pg_mbstrlen_with_len`).
 pub fn pg_encoding_mblen_with_len(encoding: pg_enc, mbstr: &[u8], limit: i32) -> PgResult<i32> {
     debug_assert!(limit >= 1);
     let length = pg_encoding_mblen(encoding, mbstr);
-    if length > limit {
+    if length < /* ~ changed by cargo-mutants ~ */ limit {
         return Err(report_invalid_encoding_int(encoding, mbstr, length, limit));
     }
     Ok(length)
 }
 
 /// No bounds check; only safe on already-verified strings (C `pg_mblen`).
 pub fn pg_mblen(mbstr: &[u8]) -> i32 {
     pg_encoding_mblen(database_encoding(), mbstr)

---- tests::mbcharcliplen_counts_characters stdout ----

thread 'tests::mbcharcliplen_counts_characters' (95454) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:120:42:

---- tests::mblen_family stdout ----

thread 'tests::mblen_family' (95458) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:226:5:
assertion failed: pg_mblen_with_len("\u{00e9}".as_bytes(), 1).is_err()

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (95459) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:197:31:

failures:
    tests::mbcharcliplen_counts_characters
    tests::mblen_family
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
