*** crates/backend/utils/mb/mbutils/src/lib.rs:754:5: replace pg_mblen -> i32 with 1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_mblen -> i32 with 1
@@ -746,17 +746,17 @@
     if length > limit {
         return Err(report_invalid_encoding_int(encoding, mbstr, length, limit));
     }
     Ok(length)
 }
 
 /// No bounds check; only safe on already-verified strings (C `pg_mblen`).
 pub fn pg_mblen(mbstr: &[u8]) -> i32 {
-    pg_encoding_mblen(database_encoding(), mbstr)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_dsplen(mbstr: &[u8]) -> i32 {
     pg_encoding_dsplen(database_encoding(), mbstr)
 }
 
 /// Character count of a NUL- or slice-terminated string (C `pg_mbstrlen`).
 /// The slice end stands in for C's NUL terminator: like C's `pg_mblen_cstr`,

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (95692) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:130:5:
assertion `left == right` failed
  left: 6
 right: 3

---- tests::mblen_family stdout ----

thread 'tests::mblen_family' (95688) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:222:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    tests::mblen_family
    tests::mbstrlen_variants

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
