*** crates/backend/utils/mb/mbutils/src/lib.rs:758:5: replace pg_dsplen -> i32 with 1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_dsplen -> i32 with 1
@@ -750,17 +750,17 @@
 }
 
 /// No bounds check; only safe on already-verified strings (C `pg_mblen`).
 pub fn pg_mblen(mbstr: &[u8]) -> i32 {
     pg_encoding_mblen(database_encoding(), mbstr)
 }
 
 pub fn pg_dsplen(mbstr: &[u8]) -> i32 {
-    pg_encoding_dsplen(database_encoding(), mbstr)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Character count of a NUL- or slice-terminated string (C `pg_mbstrlen`).
 /// The slice end stands in for C's NUL terminator: like C's `pg_mblen_cstr`,
 /// a multibyte character that would contain the terminator (a NUL byte, or
 /// the slice end) raises the invalid-byte-sequence error.
 /// Divergence (p1-laneah wcharfam_diff): the previous range-bounded walk
 /// silently stepped OVER a NUL embedded inside an invalid multibyte

---- tests::mblen_family stdout ----

thread 'tests::mblen_family' (95865) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:227:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    tests::mblen_family

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
