*** crates/backend/utils/mb/mbutils/src/lib.rs:769:42: replace == with != in pg_mbstrlen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_mbstrlen
@@ -761,17 +761,17 @@
 /// Character count of a NUL- or slice-terminated string (C `pg_mbstrlen`).
 /// The slice end stands in for C's NUL terminator: like C's `pg_mblen_cstr`,
 /// a multibyte character that would contain the terminator (a NUL byte, or
 /// the slice end) raises the invalid-byte-sequence error.
 /// Divergence (p1-laneah wcharfam_diff): the previous range-bounded walk
 /// silently stepped OVER a NUL embedded inside an invalid multibyte
 /// character where C's pg_mblen_cstr NUL-scan errors.
 pub fn pg_mbstrlen(mbstr: &[u8]) -> PgResult<i32> {
-    if pg_database_encoding_max_length() == 1 {
+    if pg_database_encoding_max_length() != /* ~ changed by cargo-mutants ~ */ 1 {
         return Ok(c_string_len(mbstr) as i32);
     }
     let mut len = 0;
     let mut pos = 0usize;
     while pos < mbstr.len() && mbstr[pos] != 0 {
         // C pg_mblen_cstr: scan bytes 1..length for the terminator.
         let length = pg_mblen(&mbstr[pos..]);
         for i in 1..length as usize {

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (96114) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:130:5:
assertion `left == right` failed
  left: 6
 right: 3

failures:
    tests::mbstrlen_variants

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
