*** crates/backend/utils/mb/mbutils/src/lib.rs:778:30: replace + with - in pg_mbstrlen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with - in pg_mbstrlen
@@ -770,17 +770,17 @@
         return Ok(c_string_len(mbstr) as i32);
     }
     let mut len = 0;
     let mut pos = 0usize;
     while pos < mbstr.len() && mbstr[pos] != 0 {
         // C pg_mblen_cstr: scan bytes 1..length for the terminator.
         let length = pg_mblen(&mbstr[pos..]);
         for i in 1..length as usize {
-            if mbstr.get(pos + i).copied().unwrap_or(0) == 0 {
+            if mbstr.get(pos - /* ~ changed by cargo-mutants ~ */ i).copied().unwrap_or(0) == 0 {
                 return Err(report_invalid_encoding_db(&mbstr[pos..], length, i as i32));
             }
         }
         pos += length as usize;
         len += 1;
     }
     Ok(len)
 }

*** result: Success
