*** crates/backend/utils/mb/mbutils/src/lib.rs:782:13: replace += with *= in pg_mbstrlen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_mbstrlen
@@ -774,17 +774,17 @@
     while pos < mbstr.len() && mbstr[pos] != 0 {
         // C pg_mblen_cstr: scan bytes 1..length for the terminator.
         let length = pg_mblen(&mbstr[pos..]);
         for i in 1..length as usize {
             if mbstr.get(pos + i).copied().unwrap_or(0) == 0 {
                 return Err(report_invalid_encoding_db(&mbstr[pos..], length, i as i32));
             }
         }
-        pos += length as usize;
+        pos *= /* ~ changed by cargo-mutants ~ */ length as usize;
         len += 1;
     }
     Ok(len)
 }
 
 /// Character count of the slice, stopping at a NUL (C `pg_mbstrlen_with_len`
 /// with `limit` = the slice length). Matches C: ereports if the last
 /// character's claimed length overruns the slice.

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (96821) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:783:9:
attempt to add with overflow

failures:
    tests::mbstrlen_variants

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 49.39s

*** result: Failure(101)
