*** crates/backend/utils/mb/mbutils/src/lib.rs:783:13: replace += with *= in pg_mbstrlen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_mbstrlen
@@ -775,17 +775,17 @@
         // C pg_mblen_cstr: scan bytes 1..length for the terminator.
         let length = pg_mblen(&mbstr[pos..]);
         for i in 1..length as usize {
             if mbstr.get(pos + i).copied().unwrap_or(0) == 0 {
                 return Err(report_invalid_encoding_db(&mbstr[pos..], length, i as i32));
             }
         }
         pos += length as usize;
-        len += 1;
+        len *= /* ~ changed by cargo-mutants ~ */ 1;
     }
     Ok(len)
 }
 
 /// Character count of the slice, stopping at a NUL (C `pg_mbstrlen_with_len`
 /// with `limit` = the slice length). Matches C: ereports if the last
 /// character's claimed length overruns the slice.
 pub fn pg_mbstrlen_with_len(mbstr: &[u8]) -> PgResult<i32> {

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (96865) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:130:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    tests::mbstrlen_variants

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
