*** crates/backend/utils/mb/mbutils/src/lib.rs:798:41: replace == with != in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_encoding_mbstrlen_with_len
@@ -790,17 +790,17 @@
 /// character's claimed length overruns the slice.
 pub fn pg_mbstrlen_with_len(mbstr: &[u8]) -> PgResult<i32> {
     pg_encoding_mbstrlen_with_len(database_encoding(), mbstr)
 }
 
 /// [`pg_mbstrlen_with_len`] parameterized by encoding (parser callers thread
 /// the server encoding explicitly).
 pub fn pg_encoding_mbstrlen_with_len(encoding: pg_enc, mbstr: &[u8]) -> PgResult<i32> {
-    if pg_encoding_max_length(encoding) == 1 {
+    if pg_encoding_max_length(encoding) != /* ~ changed by cargo-mutants ~ */ 1 {
         return Ok(mbstr.len() as i32);
     }
     let mut len = 0;
     let mut pos = 0usize;
     let mut limit = mbstr.len() as i32;
     while limit > 0 && mbstr[pos] != 0 {
         // ASCII bytes are mblen 1 in UTF-8; count a run in one SWAR sweep.
         // The `< 0x80` peek keeps the fast path OFF multibyte lead bytes

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (97216) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:129:5:
assertion `left == right` failed
  left: 6
 right: 3

---- tests::mbstrlen_with_len_errors_on_truncated_trailing_char stdout ----

thread 'tests::mbstrlen_with_len_errors_on_truncated_trailing_char' (97217) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:146:39:
called `Result::unwrap_err()` on an `Ok` value: 4

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (97215) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [0]
  left: 1
 right: 0

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
