*** crates/backend/utils/mb/mbutils/src/lib.rs:804:17: replace > with < in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with < in pg_encoding_mbstrlen_with_len
@@ -796,17 +796,17 @@
 /// the server encoding explicitly).
 pub fn pg_encoding_mbstrlen_with_len(encoding: pg_enc, mbstr: &[u8]) -> PgResult<i32> {
     if pg_encoding_max_length(encoding) == 1 {
         return Ok(mbstr.len() as i32);
     }
     let mut len = 0;
     let mut pos = 0usize;
     let mut limit = mbstr.len() as i32;
-    while limit > 0 && mbstr[pos] != 0 {
+    while limit < /* ~ changed by cargo-mutants ~ */ 0 && mbstr[pos] != 0 {
         // ASCII bytes are mblen 1 in UTF-8; count a run in one SWAR sweep.
         // The `< 0x80` peek keeps the fast path OFF multibyte lead bytes
         // (ascii_run would return 0 there) — one already-loaded byte compare,
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
         if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
             let run = ascii_run(&mbstr[pos..]);

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (97414) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:129:5:
assertion `left == right` failed
  left: 0
 right: 3

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (97413) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61]
  left: 0
 right: 1

---- tests::mbstrlen_with_len_errors_on_truncated_trailing_char stdout ----

thread 'tests::mbstrlen_with_len_errors_on_truncated_trailing_char' (97415) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:146:39:
called `Result::unwrap_err()` on an `Ok` value: 0

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
