*** crates/backend/utils/mb/mbutils/src/lib.rs:804:17: replace > with >= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with >= in pg_encoding_mbstrlen_with_len
@@ -796,17 +796,17 @@
 /// the server encoding explicitly).
 pub fn pg_encoding_mbstrlen_with_len(encoding: pg_enc, mbstr: &[u8]) -> PgResult<i32> {
     if pg_encoding_max_length(encoding) == 1 {
         return Ok(mbstr.len() as i32);
     }
     let mut len = 0;
     let mut pos = 0usize;
     let mut limit = mbstr.len() as i32;
-    while limit > 0 && mbstr[pos] != 0 {
+    while limit >= /* ~ changed by cargo-mutants ~ */ 0 && mbstr[pos] != 0 {
         // ASCII bytes are mblen 1 in UTF-8; count a run in one SWAR sweep.
         // The `< 0x80` peek keeps the fast path OFF multibyte lead bytes
         // (ascii_run would return 0 there) — one already-loaded byte compare,
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
         if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
             let run = ascii_run(&mbstr[pos..]);

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (97452) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:60:
index out of bounds: the len is 6 but the index is 6

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (97451) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:60:
index out of bounds: the len is 0 but the index is 0

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (97459) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:60:
index out of bounds: the len is 3 but the index is 3

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::seams_installed

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
