*** crates/backend/utils/mb/mbutils/src/lib.rs:811:46: replace < with <= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_encoding_mbstrlen_with_len
@@ -803,17 +803,17 @@
     let mut limit = mbstr.len() as i32;
     while limit > 0 && mbstr[pos] != 0 {
         // ASCII bytes are mblen 1 in UTF-8; count a run in one SWAR sweep.
         // The `< 0x80` peek keeps the fast path OFF multibyte lead bytes
         // (ascii_run would return 0 there) — one already-loaded byte compare,
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
-        if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
+        if encoding == PG_UTF8 && mbstr[pos] <= /* ~ changed by cargo-mutants ~ */ 0x80 {
             let run = ascii_run(&mbstr[pos..]);
             pos += run;
             limit -= run as i32;
             len += run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }

*** result: Success
