*** crates/backend/utils/mb/mbutils/src/lib.rs:813:17: replace += with -= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_encoding_mbstrlen_with_len
@@ -805,17 +805,17 @@
         // ASCII bytes are mblen 1 in UTF-8; count a run in one SWAR sweep.
         // The `< 0x80` peek keeps the fast path OFF multibyte lead bytes
         // (ascii_run would return 0 there) — one already-loaded byte compare,
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
         if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
             let run = ascii_run(&mbstr[pos..]);
-            pos += run;
+            pos -= /* ~ changed by cargo-mutants ~ */ run;
             limit -= run as i32;
             len += run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
         limit -= l;

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (97905) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:813:13:
attempt to subtract with overflow

---- tests::mbstrlen_with_len_errors_on_truncated_trailing_char stdout ----

thread 'tests::mbstrlen_with_len_errors_on_truncated_trailing_char' (97906) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:813:13:
attempt to subtract with overflow

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (97904) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:813:13:
attempt to subtract with overflow

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
