*** crates/backend/utils/mb/mbutils/src/lib.rs:814:19: replace -= with += in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace -= with += in pg_encoding_mbstrlen_with_len
@@ -806,17 +806,17 @@
         // The `< 0x80` peek keeps the fast path OFF multibyte lead bytes
         // (ascii_run would return 0 there) — one already-loaded byte compare,
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
         if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
             let run = ascii_run(&mbstr[pos..]);
             pos += run;
-            limit -= run as i32;
+            limit += /* ~ changed by cargo-mutants ~ */ run as i32;
             len += run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
         limit -= l;
         pos += l as usize;

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (98061) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:24:
index out of bounds: the len is 6 but the index is 6

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (98060) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:816:30:
index out of bounds: the len is 1 but the index is 1

---- tests::mbstrlen_with_len_errors_on_truncated_trailing_char stdout ----

thread 'tests::mbstrlen_with_len_errors_on_truncated_trailing_char' (98062) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:24:
index out of bounds: the len is 4 but the index is 5

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
