*** crates/backend/utils/mb/mbutils/src/lib.rs:815:17: replace += with -= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_encoding_mbstrlen_with_len
@@ -807,17 +807,17 @@
         // (ascii_run would return 0 there) — one already-loaded byte compare,
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
         if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
             let run = ascii_run(&mbstr[pos..]);
             pos += run;
             limit -= run as i32;
-            len += run as i32;
+            len -= /* ~ changed by cargo-mutants ~ */ run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
         limit -= l;
         pos += l as usize;
         len += 1;

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (98231) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:129:5:
assertion `left == right` failed
  left: 1
 right: 3

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (98229) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61]
  left: -1
 right: 1

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (98240) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:459:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::seams_installed

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
