*** crates/backend/utils/mb/mbutils/src/lib.rs:816:27: replace || with && in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace || with && in pg_encoding_mbstrlen_with_len
@@ -808,17 +808,17 @@
         // so a fully-multibyte string pays no fast-path tax. NUL is excluded
         // by the while guard. Every input scores identically to the plain
         // per-char loop; the run is pure acceleration.
         if encoding == PG_UTF8 && mbstr[pos] < 0x80 {
             let run = ascii_run(&mbstr[pos..]);
             pos += run;
             limit -= run as i32;
             len += run as i32;
-            if limit <= 0 || mbstr[pos] == 0 {
+            if limit <= 0 && /* ~ changed by cargo-mutants ~ */ mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
         limit -= l;
         pos += l as usize;
         len += 1;
     }

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (98296) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:816:65:
index out of bounds: the len is 5 but the index is 5

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (98295) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:816:65:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
