*** crates/backend/utils/mb/mbutils/src/lib.rs:821:15: replace -= with /= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace -= with /= in pg_encoding_mbstrlen_with_len
@@ -813,17 +813,17 @@
             pos += run;
             limit -= run as i32;
             len += run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
-        limit -= l;
+        limit /= /* ~ changed by cargo-mutants ~ */ l;
         pos += l as usize;
         len += 1;
     }
     Ok(len)
 }
 
 /// Length of the leading run of bytes in 0x01..=0x7F.
 #[inline]

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (98635) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:129:40:

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (98633) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:24:
index out of bounds: the len is 1 but the index is 1

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (98648) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:804:24:
index out of bounds: the len is 3 but the index is 3

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::seams_installed

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
