*** crates/backend/utils/mb/mbutils/src/lib.rs:822:13: replace += with -= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_encoding_mbstrlen_with_len
@@ -814,17 +814,17 @@
             limit -= run as i32;
             len += run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
         limit -= l;
-        pos += l as usize;
+        pos -= /* ~ changed by cargo-mutants ~ */ l as usize;
         len += 1;
     }
     Ok(len)
 }
 
 /// Length of the leading run of bytes in 0x01..=0x7F.
 #[inline]
 fn ascii_run(s: &[u8]) -> usize {

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (98644) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:822:9:
attempt to subtract with overflow

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (98643) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:822:9:
attempt to subtract with overflow

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (98657) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:822:9:
attempt to subtract with overflow

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::seams_installed

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
