*** crates/backend/utils/mb/mbutils/src/lib.rs:823:13: replace += with *= in pg_encoding_mbstrlen_with_len

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_encoding_mbstrlen_with_len
@@ -815,17 +815,17 @@
             len += run as i32;
             if limit <= 0 || mbstr[pos] == 0 {
                 break;
             }
         }
         let l = pg_encoding_mblen_with_len(encoding, &mbstr[pos..], limit)?;
         limit -= l;
         pos += l as usize;
-        len += 1;
+        len *= /* ~ changed by cargo-mutants ~ */ 1;
     }
     Ok(len)
 }
 
 /// Length of the leading run of bytes in 0x01..=0x7F.
 #[inline]
 fn ascii_run(s: &[u8]) -> usize {
     const LO: u64 = 0x0101_0101_0101_0101;

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (98887) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:129:5:
assertion `left == right` failed
  left: 1
 right: 3

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (98885) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [80]
  left: 0
 right: 1

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (98895) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:459:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::seams_installed

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
