*** crates/backend/utils/mb/mbutils/src/lib.rs:831:5: replace ascii_run -> usize with 1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace ascii_run -> usize with 1
@@ -823,43 +823,17 @@
         len += 1;
     }
     Ok(len)
 }
 
 /// Length of the leading run of bytes in 0x01..=0x7F.
 #[inline]
 fn ascii_run(s: &[u8]) -> usize {
-    const LO: u64 = 0x0101_0101_0101_0101;
-    const HI: u64 = 0x8080_8080_8080_8080;
-    let stop = |w: u64| ((w.wrapping_sub(LO) & !w) | w) & HI;
-    let mut i = 0usize;
-    while i + 16 <= s.len() {
-        let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
-        let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
-        if sa | sb != 0 {
-            return if sa != 0 {
-                i + (sa.trailing_zeros() / 8) as usize
-            } else {
-                i + 8 + (sb.trailing_zeros() / 8) as usize
-            };
-        }
-        i += 16;
-    }
-    while i + 8 <= s.len() {
-        let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
-        if sa != 0 {
-            return i + (sa.trailing_zeros() / 8) as usize;
-        }
-        i += 8;
-    }
-    while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
-        i += 1;
-    }
-    i
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {
     pg_encoding_mbcliplen(database_encoding(), mbstr, len, limit)
 }
 
 /// Byte length of the longest prefix of the first `len` bytes not exceeding
 /// `limit` bytes without splitting a character; string must be valid.

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (99017) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:208:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    tests::ascii_run_boundaries

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
