*** crates/backend/utils/mb/mbutils/src/lib.rs:833:48: delete ! in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in ascii_run
@@ -825,17 +825,17 @@
     Ok(len)
 }
 
 /// Length of the leading run of bytes in 0x01..=0x7F.
 #[inline]
 fn ascii_run(s: &[u8]) -> usize {
     const LO: u64 = 0x0101_0101_0101_0101;
     const HI: u64 = 0x8080_8080_8080_8080;
-    let stop = |w: u64| ((w.wrapping_sub(LO) & !w) | w) & HI;
+    let stop = |w: u64| ((w.wrapping_sub(LO) &  /* ~ changed by cargo-mutants ~ */w) | w) & HI;
     let mut i = 0usize;
     while i + 16 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
         if sa | sb != 0 {
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (99407) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:212:17:
assertion `left == right` failed: n=8 k=0 stopper=0x0
  left: 8
 right: 0

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (99447) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61, 62, 63, 64, 65, 66, 67, 0]
  left: 8
 right: 7

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
