*** crates/backend/utils/mb/mbutils/src/lib.rs:835:18: replace <= with > in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace <= with > in ascii_run
@@ -827,17 +827,17 @@
 
 /// Length of the leading run of bytes in 0x01..=0x7F.
 #[inline]
 fn ascii_run(s: &[u8]) -> usize {
     const LO: u64 = 0x0101_0101_0101_0101;
     const HI: u64 = 0x8080_8080_8080_8080;
     let stop = |w: u64| ((w.wrapping_sub(LO) & !w) | w) & HI;
     let mut i = 0usize;
-    while i + 16 <= s.len() {
+    while i + 16 > /* ~ changed by cargo-mutants ~ */ s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
         if sa | sb != 0 {
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {
                 i + 8 + (sb.trailing_zeros() / 8) as usize
             };

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (99402) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:836:43:
range end index 8 out of range for slice of length 0

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (99470) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:836:43:
range end index 8 out of range for slice of length 6

---- tests::mbstrlen_with_len_errors_on_truncated_trailing_char stdout ----

thread 'tests::mbstrlen_with_len_errors_on_truncated_trailing_char' (99473) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:836:43:
range end index 8 out of range for slice of length 4

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
