*** crates/backend/utils/mb/mbutils/src/lib.rs:838:15: replace | with & in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace | with & in ascii_run
@@ -830,17 +830,17 @@
 fn ascii_run(s: &[u8]) -> usize {
     const LO: u64 = 0x0101_0101_0101_0101;
     const HI: u64 = 0x8080_8080_8080_8080;
     let stop = |w: u64| ((w.wrapping_sub(LO) & !w) | w) & HI;
     let mut i = 0usize;
     while i + 16 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
-        if sa | sb != 0 {
+        if sa & /* ~ changed by cargo-mutants ~ */ sb != 0 {
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {
                 i + 8 + (sb.trailing_zeros() / 8) as usize
             };
         }
         i += 16;
     }

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (100200) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:212:17:
assertion `left == right` failed: n=16 k=0 stopper=0x0
  left: 16
 right: 0

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (100237) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61, 62, 63, 64, 65, 66, 67, 68, 69, 6a, 6b, 6c, 6d, 6e, 6f, 0]
  left: 16
 right: 15

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
