*** crates/backend/utils/mb/mbutils/src/lib.rs:83:5: replace enc_name -> &'static str with "xyzzy"

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace enc_name -> &'static str with "xyzzy"
@@ -75,17 +75,17 @@
     "GBK",
     "UHC",
     "GB18030",
     "JOHAB",
     "SHIFT_JIS_2004",
 ];
 
 fn enc_name(encoding: pg_enc) -> &'static str {
-    PG_ENC2NAME[encoding as usize]
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 // pg_encname_tbl (common/encnames.c), sorted by clean name for binary search.
 static PG_ENCNAME: [(&str, pg_enc); 81] = [
     ("abc", wchar::PG_WIN1258),
     ("alt", wchar::PG_WIN866),
     ("big5", wchar::PG_BIG5),
     ("euccn", wchar::PG_EUC_CN),

---- tests::ascii_server_rejects_highbit_from_client_only_encoding stdout ----

thread 'tests::ascii_server_rejects_highbit_from_client_only_encoding' (80161) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:272:5:
assertion `left == right` failed
  left: "invalid byte value for encoding \"xyzzy\": 0x93"
 right: "invalid byte value for encoding \"SQL_ASCII\": 0x93"

---- tests::check_conversion_args stdout ----

thread 'tests::check_conversion_args' (80164) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:426:5:
assertion `left == right` failed
  left: "expected source encoding \"xyzzy\", but got \"xyzzy\""
 right: "expected source encoding \"LATIN1\", but got \"UTF8\""

---- tests::enc2name_matches_wchar_ids stdout ----

thread 'tests::enc2name_matches_wchar_ids' (80172) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:90:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "LATIN1"

failures:
    tests::ascii_server_rejects_highbit_from_client_only_encoding
    tests::check_conversion_args
    tests::database_encoding_accessors
    tests::enc2name_matches_wchar_ids
    tests::encname_lookup_matches_encnames_c
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::pending_client_encoding_applied_at_startup
    tests::reporters_match_c_shapes
    tests::seams_installed
    tests::unicode_to_server_without_proc_fails
    tests::verify_mbstr_reports_c_message

test result: FAILED. 23 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
