*** crates/backend/utils/mb/mbutils/src/lib.rs:840:19: replace + with - in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with - in ascii_run
@@ -832,17 +832,17 @@
     const HI: u64 = 0x8080_8080_8080_8080;
     let stop = |w: u64| ((w.wrapping_sub(LO) & !w) | w) & HI;
     let mut i = 0usize;
     while i + 16 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
         if sa | sb != 0 {
             return if sa != 0 {
-                i + (sa.trailing_zeros() / 8) as usize
+                i - /* ~ changed by cargo-mutants ~ */ (sa.trailing_zeros() / 8) as usize
             } else {
                 i + 8 + (sb.trailing_zeros() / 8) as usize
             };
         }
         i += 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (100405) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:840:17:
attempt to subtract with overflow

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (100465) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:840:17:
attempt to subtract with overflow

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
