*** crates/backend/utils/mb/mbutils/src/lib.rs:842:23: replace + with - in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with - in ascii_run
@@ -834,17 +834,17 @@
     let mut i = 0usize;
     while i + 16 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
         if sa | sb != 0 {
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {
-                i + 8 + (sb.trailing_zeros() / 8) as usize
+                i + 8 - /* ~ changed by cargo-mutants ~ */ (sb.trailing_zeros() / 8) as usize
             };
         }
         i += 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (100594) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:212:17:
assertion `left == right` failed: n=16 k=9 stopper=0x0
  left: 7
 right: 9

failures:
    tests::ascii_run_boundaries

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
