*** crates/backend/utils/mb/mbutils/src/lib.rs:842:46: replace / with % in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace / with % in ascii_run
@@ -834,17 +834,17 @@
     let mut i = 0usize;
     while i + 16 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
         if sa | sb != 0 {
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {
-                i + 8 + (sb.trailing_zeros() / 8) as usize
+                i + 8 + (sb.trailing_zeros() % /* ~ changed by cargo-mutants ~ */ 8) as usize
             };
         }
         i += 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (100790) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:212:17:
assertion `left == right` failed: n=16 k=8 stopper=0x0
  left: 15
 right: 8

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (100821) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61, 62, 63, 64, 65, 66, 67, 61, 62, 63, 64, 65, 66, 67, c3, a9]
  left: 16
 right: 15

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
