*** crates/backend/utils/mb/mbutils/src/lib.rs:845:11: replace += with *= in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in ascii_run
@@ -837,17 +837,17 @@
         let sb = stop(u64::from_le_bytes(s[i + 8..i + 16].try_into().unwrap()));
         if sa | sb != 0 {
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {
                 i + 8 + (sb.trailing_zeros() / 8) as usize
             };
         }
-        i += 16;
+        i *= /* ~ changed by cargo-mutants ~ */ 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;
         }
         i += 8;
     }

*** result: Timeout
