*** crates/backend/utils/mb/mbutils/src/lib.rs:847:13: replace + with * in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with * in ascii_run
@@ -839,17 +839,17 @@
             return if sa != 0 {
                 i + (sa.trailing_zeros() / 8) as usize
             } else {
                 i + 8 + (sb.trailing_zeros() / 8) as usize
             };
         }
         i += 16;
     }
-    while i + 8 <= s.len() {
+    while i * /* ~ changed by cargo-mutants ~ */ 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;
         }
         i += 8;
     }
     while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
         i += 1;

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (101259) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:848:43:
range end index 8 out of range for slice of length 0

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (101310) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:848:43:
range end index 8 out of range for slice of length 1

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (101313) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:848:43:
range end index 8 out of range for slice of length 6

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
