*** crates/backend/utils/mb/mbutils/src/lib.rs:850:22: replace + with * in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with * in ascii_run
@@ -842,17 +842,17 @@
                 i + 8 + (sb.trailing_zeros() / 8) as usize
             };
         }
         i += 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
-            return i + (sa.trailing_zeros() / 8) as usize;
+            return i * /* ~ changed by cargo-mutants ~ */ (sa.trailing_zeros() / 8) as usize;
         }
         i += 8;
     }
     while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
         i += 1;
     }
     i
 }

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (101652) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:212:17:
assertion `left == right` failed: n=8 k=1 stopper=0x0
  left: 0
 right: 1

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (101693) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61, 62, 63, 64, 65, 66, 67, 61, 62, 63, 64, 65, 66, 67, 68, 69, 6a, 6b, 6c, 6d, 6e, 6f, c3, a9]
  left: 96
 right: 23

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
