*** crates/backend/utils/mb/mbutils/src/lib.rs:852:11: replace += with -= in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in ascii_run
@@ -844,17 +844,17 @@
         }
         i += 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;
         }
-        i += 8;
+        i -= /* ~ changed by cargo-mutants ~ */ 8;
     }
     while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
         i += 1;
     }
     i
 }
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (101856) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:852:9:
attempt to subtract with overflow

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (101923) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:852:9:
attempt to subtract with overflow

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
