*** crates/backend/utils/mb/mbutils/src/lib.rs:852:11: replace += with *= in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in ascii_run
@@ -844,17 +844,17 @@
         }
         i += 16;
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;
         }
-        i += 8;
+        i *= /* ~ changed by cargo-mutants ~ */ 8;
     }
     while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
         i += 1;
     }
     i
 }
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {

*** result: Timeout
