*** crates/backend/utils/mb/mbutils/src/lib.rs:854:47: replace < with > in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with > in ascii_run
@@ -846,17 +846,17 @@
     }
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;
         }
         i += 8;
     }
-    while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
+    while i < s.len() && s[i].wrapping_sub(1) > /* ~ changed by cargo-mutants ~ */ 0x7f {
         i += 1;
     }
     i
 }
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {
     pg_encoding_mbcliplen(database_encoding(), mbstr, len, limit)
 }

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (102280) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:208:9:
assertion `left == right` failed
  left: 0
 right: 1

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (102313) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:195:39:
assertion `left == right` failed: input [61, 62, 63, 64, 65, 66, 67, 68, 0]
  left: 9
 right: 8

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
