*** crates/backend/utils/mb/mbutils/src/lib.rs:855:11: replace += with -= in ascii_run

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in ascii_run
@@ -847,17 +847,17 @@
     while i + 8 <= s.len() {
         let sa = stop(u64::from_le_bytes(s[i..i + 8].try_into().unwrap()));
         if sa != 0 {
             return i + (sa.trailing_zeros() / 8) as usize;
         }
         i += 8;
     }
     while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
-        i += 1;
+        i -= /* ~ changed by cargo-mutants ~ */ 1;
     }
     i
 }
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {
     pg_encoding_mbcliplen(database_encoding(), mbstr, len, limit)
 }

---- tests::ascii_run_boundaries stdout ----

thread 'tests::ascii_run_boundaries' (102409) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:855:9:
attempt to subtract with overflow

---- tests::mbstrlen_ascii_run_differential stdout ----

thread 'tests::mbstrlen_ascii_run_differential' (102439) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:855:9:
attempt to subtract with overflow

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (102441) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:855:9:
attempt to subtract with overflow

failures:
    tests::ascii_run_boundaries
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::seams_installed

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
