*** crates/backend/utils/mb/mbutils/src/lib.rs:861:5: replace pg_mbcliplen -> i32 with -1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_mbcliplen -> i32 with -1
@@ -853,17 +853,17 @@
     }
     while i < s.len() && s[i].wrapping_sub(1) < 0x7f {
         i += 1;
     }
     i
 }
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {
-    pg_encoding_mbcliplen(database_encoding(), mbstr, len, limit)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Byte length of the longest prefix of the first `len` bytes not exceeding
 /// `limit` bytes without splitting a character; string must be valid.
 pub fn pg_encoding_mbcliplen(encoding: pg_enc, mbstr: &[u8], len: i32, limit: i32) -> i32 {
     if pg_encoding_max_length(encoding) == 1 {
         return cliplen(mbstr, len, limit);
     }

---- tests::mbcliplen_single_byte_stops_at_nul stdout ----

thread 'tests::mbcliplen_single_byte_stops_at_nul' (102652) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:111:5:
assertion `left == right` failed
  left: -1
 right: 2

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (102653) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:99:5:
assertion `left == right` failed
  left: -1
 right: 4

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (102663) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:463:5:
assertion `left == right` failed
  left: -1
 right: 1

failures:
    tests::mbcliplen_single_byte_stops_at_nul
    tests::mbcliplen_utf8_boundaries
    tests::seams_installed

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
