*** crates/backend/utils/mb/mbutils/src/lib.rs:867:41: replace == with != in pg_encoding_mbcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_encoding_mbcliplen
@@ -859,17 +859,17 @@
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {
     pg_encoding_mbcliplen(database_encoding(), mbstr, len, limit)
 }
 
 /// Byte length of the longest prefix of the first `len` bytes not exceeding
 /// `limit` bytes without splitting a character; string must be valid.
 pub fn pg_encoding_mbcliplen(encoding: pg_enc, mbstr: &[u8], len: i32, limit: i32) -> i32 {
-    if pg_encoding_max_length(encoding) == 1 {
+    if pg_encoding_max_length(encoding) != /* ~ changed by cargo-mutants ~ */ 1 {
         return cliplen(mbstr, len, limit);
     }
     let mut clen = 0;
     let mut len = len;
     let mut pos = 0usize;
     while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
         let l = pg_encoding_mblen(encoding, &mbstr[pos..]);
         if clen + l > limit {

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (102917) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:101:5:
assertion `left == right` failed
  left: 2
 right: 1

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (102927) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:463:5:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    tests::mbcliplen_utf8_boundaries
    tests::seams_installed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
