*** crates/backend/utils/mb/mbutils/src/lib.rs:867:5: replace pg_encoding_mbcliplen -> i32 with 1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_encoding_mbcliplen -> i32 with 1
@@ -859,35 +859,17 @@
 
 pub fn pg_mbcliplen(mbstr: &[u8], len: i32, limit: i32) -> i32 {
     pg_encoding_mbcliplen(database_encoding(), mbstr, len, limit)
 }
 
 /// Byte length of the longest prefix of the first `len` bytes not exceeding
 /// `limit` bytes without splitting a character; string must be valid.
 pub fn pg_encoding_mbcliplen(encoding: pg_enc, mbstr: &[u8], len: i32, limit: i32) -> i32 {
-    if pg_encoding_max_length(encoding) == 1 {
-        return cliplen(mbstr, len, limit);
-    }
-    let mut clen = 0;
-    let mut len = len;
-    let mut pos = 0usize;
-    while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
-        let l = pg_encoding_mblen(encoding, &mbstr[pos..]);
-        if clen + l > limit {
-            break;
-        }
-        clen += l;
-        if clen == limit {
-            break;
-        }
-        len -= l;
-        pos += l as usize;
-    }
-    clen
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Like [`pg_mbcliplen`] with `limit` counted in characters.
 pub fn pg_mbcharcliplen(mbstr: &[u8], len: i32, limit: i32) -> PgResult<i32> {
     if pg_database_encoding_max_length() == 1 {
         return Ok(cliplen(mbstr, len, limit));
     }
     let mut clen = 0;

---- tests::mbcliplen_single_byte_stops_at_nul stdout ----

thread 'tests::mbcliplen_single_byte_stops_at_nul' (102784) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:111:5:
assertion `left == right` failed
  left: 1
 right: 2

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (102785) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:99:5:
assertion `left == right` failed
  left: 1
 right: 4

failures:
    tests::mbcliplen_single_byte_stops_at_nul
    tests::mbcliplen_utf8_boundaries

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
