*** crates/backend/utils/mb/mbutils/src/lib.rs:875:17: replace + with * in pg_encoding_mbcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace + with * in pg_encoding_mbcliplen
@@ -867,17 +867,17 @@
     if pg_encoding_max_length(encoding) == 1 {
         return cliplen(mbstr, len, limit);
     }
     let mut clen = 0;
     let mut len = len;
     let mut pos = 0usize;
     while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
         let l = pg_encoding_mblen(encoding, &mbstr[pos..]);
-        if clen + l > limit {
+        if clen * /* ~ changed by cargo-mutants ~ */ l > limit {
             break;
         }
         clen += l;
         if clen == limit {
             break;
         }
         len -= l;
         pos += l as usize;

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (103577) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:101:5:
assertion `left == right` failed
  left: 3
 right: 1

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (103587) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:463:5:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    tests::mbcliplen_utf8_boundaries
    tests::seams_installed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
