*** crates/backend/utils/mb/mbutils/src/lib.rs:875:21: replace > with >= in pg_encoding_mbcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace > with >= in pg_encoding_mbcliplen
@@ -867,17 +867,17 @@
     if pg_encoding_max_length(encoding) == 1 {
         return cliplen(mbstr, len, limit);
     }
     let mut clen = 0;
     let mut len = len;
     let mut pos = 0usize;
     while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
         let l = pg_encoding_mblen(encoding, &mbstr[pos..]);
-        if clen + l > limit {
+        if clen + l >= /* ~ changed by cargo-mutants ~ */ limit {
             break;
         }
         clen += l;
         if clen == limit {
             break;
         }
         len -= l;
         pos += l as usize;

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (103445) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:99:5:
assertion `left == right` failed
  left: 3
 right: 4

failures:
    tests::mbcliplen_utf8_boundaries

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
