*** crates/backend/utils/mb/mbutils/src/lib.rs:879:17: replace == with != in pg_encoding_mbcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_encoding_mbcliplen
@@ -871,17 +871,17 @@
     let mut len = len;
     let mut pos = 0usize;
     while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
         let l = pg_encoding_mblen(encoding, &mbstr[pos..]);
         if clen + l > limit {
             break;
         }
         clen += l;
-        if clen == limit {
+        if clen != /* ~ changed by cargo-mutants ~ */ limit {
             break;
         }
         len -= l;
         pos += l as usize;
     }
     clen
 }

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (103775) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:99:5:
assertion `left == right` failed
  left: 1
 right: 4

failures:
    tests::mbcliplen_utf8_boundaries

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
