*** crates/backend/utils/mb/mbutils/src/lib.rs:882:13: replace -= with += in pg_encoding_mbcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace -= with += in pg_encoding_mbcliplen
@@ -874,17 +874,17 @@
         let l = pg_encoding_mblen(encoding, &mbstr[pos..]);
         if clen + l > limit {
             break;
         }
         clen += l;
         if clen == limit {
             break;
         }
-        len -= l;
+        len += /* ~ changed by cargo-mutants ~ */ l;
         pos += l as usize;
     }
     clen
 }
 
 /// Like [`pg_mbcliplen`] with `limit` counted in characters.
 pub fn pg_mbcharcliplen(mbstr: &[u8], len: i32, limit: i32) -> PgResult<i32> {
     if pg_database_encoding_max_length() == 1 {

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (103841) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:105:5:
assertion `left == right` failed
  left: 4
 right: 1

failures:
    tests::mbcliplen_utf8_boundaries

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
