*** crates/backend/utils/mb/mbutils/src/lib.rs:883:13: replace += with *= in pg_encoding_mbcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_encoding_mbcliplen
@@ -875,17 +875,17 @@
         if clen + l > limit {
             break;
         }
         clen += l;
         if clen == limit {
             break;
         }
         len -= l;
-        pos += l as usize;
+        pos *= /* ~ changed by cargo-mutants ~ */ l as usize;
     }
     clen
 }
 
 /// Like [`pg_mbcliplen`] with `limit` counted in characters.
 pub fn pg_mbcharcliplen(mbstr: &[u8], len: i32, limit: i32) -> PgResult<i32> {
     if pg_database_encoding_max_length() == 1 {
         return Ok(cliplen(mbstr, len, limit));

---- tests::mbcliplen_utf8_boundaries stdout ----

thread 'tests::mbcliplen_utf8_boundaries' (104039) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:101:5:
assertion `left == right` failed
  left: 2
 right: 1

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (104049) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:463:5:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    tests::mbcliplen_utf8_boundaries
    tests::seams_installed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
