*** crates/backend/utils/mb/mbutils/src/lib.rs:897:59: replace != with == in pg_mbcharcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace != with == in pg_mbcharcliplen
@@ -889,17 +889,17 @@
 pub fn pg_mbcharcliplen(mbstr: &[u8], len: i32, limit: i32) -> PgResult<i32> {
     if pg_database_encoding_max_length() == 1 {
         return Ok(cliplen(mbstr, len, limit));
     }
     let mut clen = 0;
     let mut nch = 0;
     let mut len = len;
     let mut pos = 0usize;
-    while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
+    while len > 0 && mbstr.get(pos).copied().unwrap_or(0) == /* ~ changed by cargo-mutants ~ */ 0 {
         let l = pg_mblen_with_len(&mbstr[pos..], len)?;
         nch += 1;
         if nch > limit {
             break;
         }
         clen += l;
         len -= l;
         pos += l as usize;

---- tests::mbcharcliplen_counts_characters stdout ----

thread 'tests::mbcharcliplen_counts_characters' (104559) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:120:5:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    tests::mbcharcliplen_counts_characters

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
