*** crates/backend/utils/mb/mbutils/src/lib.rs:904:13: replace -= with /= in pg_mbcharcliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace -= with /= in pg_mbcharcliplen
@@ -896,17 +896,17 @@
     let mut pos = 0usize;
     while len > 0 && mbstr.get(pos).copied().unwrap_or(0) != 0 {
         let l = pg_mblen_with_len(&mbstr[pos..], len)?;
         nch += 1;
         if nch > limit {
             break;
         }
         clen += l;
-        len -= l;
+        len /= /* ~ changed by cargo-mutants ~ */ l;
         pos += l as usize;
     }
     Ok(clen)
 }
 
 fn cliplen(s: &[u8], len: i32, limit: i32) -> i32 {
     let len = len.min(limit);
     let mut l = 0;

---- tests::mbcharcliplen_counts_characters stdout ----

thread 'tests::mbcharcliplen_counts_characters' (105156) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:120:42:

failures:
    tests::mbcharcliplen_counts_characters

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
