*** crates/backend/utils/mb/mbutils/src/lib.rs:914:11: replace += with -= in cliplen

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in cliplen
@@ -906,17 +906,17 @@
     }
     Ok(clen)
 }
 
 fn cliplen(s: &[u8], len: i32, limit: i32) -> i32 {
     let len = len.min(limit);
     let mut l = 0;
     while l < len && s.get(l as usize).copied().unwrap_or(0) != 0 {
-        l += 1;
+        l -= /* ~ changed by cargo-mutants ~ */ 1;
     }
     l
 }
 
 pub fn SetDatabaseEncoding(encoding: pg_enc) -> PgResult<()> {
     if !pg_valid_be_encoding(encoding) {
         return Err(internal_error(&format!(
             "invalid database encoding: {encoding}"

---- tests::mbcliplen_single_byte_stops_at_nul stdout ----

thread 'tests::mbcliplen_single_byte_stops_at_nul' (105886) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:111:5:
assertion `left == right` failed
  left: -1
 right: 2

failures:
    tests::mbcliplen_single_byte_stops_at_nul

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
