*** crates/backend/utils/mb/mbutils/src/lib.rs:920:8: delete ! in SetDatabaseEncoding

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in SetDatabaseEncoding
@@ -912,17 +912,17 @@
     let mut l = 0;
     while l < len && s.get(l as usize).copied().unwrap_or(0) != 0 {
         l += 1;
     }
     l
 }
 
 pub fn SetDatabaseEncoding(encoding: pg_enc) -> PgResult<()> {
-    if !pg_valid_be_encoding(encoding) {
+    if  /* ~ changed by cargo-mutants ~ */pg_valid_be_encoding(encoding) {
         return Err(internal_error(&format!(
             "invalid database encoding: {encoding}"
         )));
     }
     DATABASE_ENCODING.with(|e| e.set(encoding));
     Ok(())
 }

---- tests::any_to_server_validates_even_without_conversion stdout ----

thread 'tests::any_to_server_validates_even_without_conversion' (106053) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:257:34:

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (106056) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:410:34:

---- tests::conversion_needed_truth_table stdout ----

thread 'tests::conversion_needed_truth_table' (106058) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:34:34:

failures:
    tests::any_to_server_validates_even_without_conversion
    tests::charinc_dispatch_and_generic
    tests::conversion_needed_truth_table
    tests::database_encoding_accessors
    tests::mb2wchar_roundtrip_utf8
    tests::mbcharcliplen_counts_characters
    tests::mbcliplen_utf8_boundaries
    tests::mblen_family
    tests::mbstrlen_ascii_run_differential
    tests::mbstrlen_variants
    tests::mbstrlen_with_len_errors_on_truncated_trailing_char
    tests::no_conversion_returns_none_without_allocating

test result: FAILED. 13 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
