*** crates/backend/utils/mb/mbutils/src/lib.rs:930:5: replace SetMessageEncoding with ()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace SetMessageEncoding with ()
@@ -922,18 +922,17 @@
             "invalid database encoding: {encoding}"
         )));
     }
     DATABASE_ENCODING.with(|e| e.set(encoding));
     Ok(())
 }
 
 pub fn SetMessageEncoding(encoding: pg_enc) {
-    debug_assert!(pg_valid_encoding(encoding));
-    MESSAGE_ENCODING.with(|e| e.set(encoding));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn GetDatabaseEncoding() -> pg_enc {
     database_encoding()
 }
 
 pub fn GetDatabaseEncodingName() -> &'static str {
     enc_name(database_encoding())

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (106124) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:84:5:
assertion `left == right` failed
  left: 0
 right: 22

failures:
    tests::database_encoding_accessors

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
