*** crates/backend/utils/mb/mbutils/src/lib.rs:935:5: replace GetDatabaseEncoding -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace GetDatabaseEncoding -> pg_enc with Default::default()
@@ -927,17 +927,17 @@
 }
 
 pub fn SetMessageEncoding(encoding: pg_enc) {
     debug_assert!(pg_valid_encoding(encoding));
     MESSAGE_ENCODING.with(|e| e.set(encoding));
 }
 
 pub fn GetDatabaseEncoding() -> pg_enc {
-    database_encoding()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn GetDatabaseEncodingName() -> &'static str {
     enc_name(database_encoding())
 }
 
 pub fn GetMessageEncoding() -> pg_enc {
     MESSAGE_ENCODING.with(|e| e.get())

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (106191) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:78:5:
assertion `left == right` failed
  left: 0
 right: 6

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (106209) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:454:5:
assertion `left == right` failed
  left: 0
 right: 6

failures:
    tests::database_encoding_accessors
    tests::seams_installed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
