*** crates/backend/utils/mb/mbutils/src/lib.rs:939:5: replace GetDatabaseEncodingName -> &'static str with ""

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace GetDatabaseEncodingName -> &'static str with ""
@@ -931,17 +931,17 @@
     MESSAGE_ENCODING.with(|e| e.set(encoding));
 }
 
 pub fn GetDatabaseEncoding() -> pg_enc {
     database_encoding()
 }
 
 pub fn GetDatabaseEncodingName() -> &'static str {
-    enc_name(database_encoding())
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn GetMessageEncoding() -> pg_enc {
     MESSAGE_ENCODING.with(|e| e.get())
 }
 
 pub fn pg_database_encoding_max_length() -> i32 {
     pg_wchar_table[database_encoding() as usize].maxmblen

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (106286) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:76:5:
assertion `left == right` failed
  left: ""
 right: "SQL_ASCII"

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (106304) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:455:5:
assertion `left == right` failed
  left: ""
 right: "UTF8"

failures:
    tests::database_encoding_accessors
    tests::seams_installed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
