*** crates/backend/utils/mb/mbutils/src/lib.rs:943:5: replace GetMessageEncoding -> pg_enc with Default::default()

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace GetMessageEncoding -> pg_enc with Default::default()
@@ -935,17 +935,17 @@
     database_encoding()
 }
 
 pub fn GetDatabaseEncodingName() -> &'static str {
     enc_name(database_encoding())
 }
 
 pub fn GetMessageEncoding() -> pg_enc {
-    MESSAGE_ENCODING.with(|e| e.get())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_database_encoding_max_length() -> i32 {
     pg_wchar_table[database_encoding() as usize].maxmblen
 }
 
 pub type MbcharacterIncrementer = fn(&mut [u8]) -> bool;

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (106417) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:84:5:
assertion `left == right` failed
  left: 0
 right: 22

failures:
    tests::database_encoding_accessors

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
