*** crates/backend/utils/mb/mbutils/src/lib.rs:947:5: replace pg_database_encoding_max_length -> i32 with 0

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_database_encoding_max_length -> i32 with 0
@@ -939,17 +939,17 @@
     enc_name(database_encoding())
 }
 
 pub fn GetMessageEncoding() -> pg_enc {
     MESSAGE_ENCODING.with(|e| e.get())
 }
 
 pub fn pg_database_encoding_max_length() -> i32 {
-    pg_wchar_table[database_encoding() as usize].maxmblen
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub type MbcharacterIncrementer = fn(&mut [u8]) -> bool;
 
 pub fn pg_database_encoding_character_incrementer() -> MbcharacterIncrementer {
     match database_encoding() {
         PG_UTF8 => pg_utf8_increment,
         PG_EUC_JP => pg_eucjp_increment,

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (106454) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:80:5:
assertion `left == right` failed
  left: 0
 right: 4

---- tests::seams_installed stdout ----

thread 'tests::seams_installed' (106472) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:456:5:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    tests::database_encoding_accessors
    tests::seams_installed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
