*** crates/backend/utils/mb/mbutils/src/lib.rs:947:5: replace pg_database_encoding_max_length -> i32 with 1

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_database_encoding_max_length -> i32 with 1
@@ -939,17 +939,17 @@
     enc_name(database_encoding())
 }
 
 pub fn GetMessageEncoding() -> pg_enc {
     MESSAGE_ENCODING.with(|e| e.get())
 }
 
 pub fn pg_database_encoding_max_length() -> i32 {
-    pg_wchar_table[database_encoding() as usize].maxmblen
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub type MbcharacterIncrementer = fn(&mut [u8]) -> bool;
 
 pub fn pg_database_encoding_character_incrementer() -> MbcharacterIncrementer {
     match database_encoding() {
         PG_UTF8 => pg_utf8_increment,
         PG_EUC_JP => pg_eucjp_increment,

---- tests::database_encoding_accessors stdout ----

thread 'tests::database_encoding_accessors' (106549) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:80:5:
assertion `left == right` failed
  left: 1
 right: 4

---- tests::mbcharcliplen_counts_characters stdout ----

thread 'tests::mbcharcliplen_counts_characters' (106555) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:120:5:
assertion `left == right` failed
  left: 2
 right: 4

---- tests::mbstrlen_variants stdout ----

thread 'tests::mbstrlen_variants' (106560) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:130:5:
assertion `left == right` failed
  left: 6
 right: 3

failures:
    tests::database_encoding_accessors
    tests::mbcharcliplen_counts_characters
    tests::mbstrlen_variants
    tests::seams_installed

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
