*** crates/backend/utils/mb/mbutils/src/lib.rs:954:9: delete match arm PG_UTF8 in pg_database_encoding_character_incrementer

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete match arm PG_UTF8 in pg_database_encoding_character_incrementer
@@ -946,17 +946,17 @@
 pub fn pg_database_encoding_max_length() -> i32 {
     pg_wchar_table[database_encoding() as usize].maxmblen
 }
 
 pub type MbcharacterIncrementer = fn(&mut [u8]) -> bool;
 
 pub fn pg_database_encoding_character_incrementer() -> MbcharacterIncrementer {
     match database_encoding() {
-        PG_UTF8 => pg_utf8_increment,
+         /* ~ changed by cargo-mutants ~ */
         PG_EUC_JP => pg_eucjp_increment,
         _ => pg_generic_charinc,
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (106689) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:411:5:
assertion `left == right` failed
  left: 187650733053140
 right: 187650733050248

failures:
    tests::charinc_dispatch_and_generic

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
