*** crates/backend/utils/mb/mbutils/src/lib.rs:955:9: delete match arm PG_EUC_JP in pg_database_encoding_character_incrementer

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete match arm PG_EUC_JP in pg_database_encoding_character_incrementer
@@ -947,17 +947,17 @@
     pg_wchar_table[database_encoding() as usize].maxmblen
 }
 
 pub type MbcharacterIncrementer = fn(&mut [u8]) -> bool;
 
 pub fn pg_database_encoding_character_incrementer() -> MbcharacterIncrementer {
     match database_encoding() {
         PG_UTF8 => pg_utf8_increment,
-        PG_EUC_JP => pg_eucjp_increment,
+         /* ~ changed by cargo-mutants ~ */
         _ => pg_generic_charinc,
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;
     let last = charptr.len() - 1;

*** result: Success
