*** crates/backend/utils/mb/mbutils/src/lib.rs:961:5: replace pg_generic_charinc -> bool with false

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_generic_charinc -> bool with false
@@ -953,26 +953,17 @@
     match database_encoding() {
         PG_UTF8 => pg_utf8_increment,
         PG_EUC_JP => pg_eucjp_increment,
         _ => pg_generic_charinc,
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
-    let encoding = database_encoding();
-    let len = charptr.len() as i32;
-    let last = charptr.len() - 1;
-    while charptr[last] < 255 {
-        charptr[last] += 1;
-        if pg_encoding_verifymbchar(encoding, charptr) == len {
-            return true;
-        }
-    }
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// C's `switch (length)` cases 4..1 fall through; each successful increment
 /// exits with success, and lengths outside 1..=4 are rejected.
 pub fn pg_utf8_increment(charptr: &mut [u8]) -> bool {
     let length = charptr.len();
     if !(1..=4).contains(&length) {
         return false;

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (106892) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:416:5:
assertion failed: pg_generic_charinc(&mut c)

failures:
    tests::charinc_dispatch_and_generic

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
