*** crates/backend/utils/mb/mbutils/src/lib.rs:963:30: replace - with + in pg_generic_charinc

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace - with + in pg_generic_charinc
@@ -955,17 +955,17 @@
         PG_EUC_JP => pg_eucjp_increment,
         _ => pg_generic_charinc,
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;
-    let last = charptr.len() - 1;
+    let last = charptr.len() + /* ~ changed by cargo-mutants ~ */ 1;
     while charptr[last] < 255 {
         charptr[last] += 1;
         if pg_encoding_verifymbchar(encoding, charptr) == len {
             return true;
         }
     }
     false
 }

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (106934) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:964:11:
index out of bounds: the len is 1 but the index is 2

failures:
    tests::charinc_dispatch_and_generic

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
