*** crates/backend/utils/mb/mbutils/src/lib.rs:964:25: replace < with == in pg_generic_charinc

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in pg_generic_charinc
@@ -956,17 +956,17 @@
         _ => pg_generic_charinc,
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;
     let last = charptr.len() - 1;
-    while charptr[last] < 255 {
+    while charptr[last] == /* ~ changed by cargo-mutants ~ */ 255 {
         charptr[last] += 1;
         if pg_encoding_verifymbchar(encoding, charptr) == len {
             return true;
         }
     }
     false
 }

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (107090) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:416:5:
assertion failed: pg_generic_charinc(&mut c)

failures:
    tests::charinc_dispatch_and_generic

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
