*** crates/backend/utils/mb/mbutils/src/lib.rs:964:25: replace < with <= in pg_generic_charinc

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_generic_charinc
@@ -956,17 +956,17 @@
         _ => pg_generic_charinc,
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;
     let last = charptr.len() - 1;
-    while charptr[last] < 255 {
+    while charptr[last] <= /* ~ changed by cargo-mutants ~ */ 255 {
         charptr[last] += 1;
         if pg_encoding_verifymbchar(encoding, charptr) == len {
             return true;
         }
     }
     false
 }

*** result: Success
