*** crates/backend/utils/mb/mbutils/src/lib.rs:965:23: replace += with -= in pg_generic_charinc

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_generic_charinc
@@ -957,17 +957,17 @@
     }
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;
     let last = charptr.len() - 1;
     while charptr[last] < 255 {
-        charptr[last] += 1;
+        charptr[last] -= /* ~ changed by cargo-mutants ~ */ 1;
         if pg_encoding_verifymbchar(encoding, charptr) == len {
             return true;
         }
     }
     false
 }
 
 /// C's `switch (length)` cases 4..1 fall through; each successful increment

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (107291) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:417:5:
assertion `left == right` failed
  left: [96]
 right: [98]

failures:
    tests::charinc_dispatch_and_generic

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
