*** crates/backend/utils/mb/mbutils/src/lib.rs:966:56: replace == with != in pg_generic_charinc

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace == with != in pg_generic_charinc
@@ -958,17 +958,17 @@
 }
 
 pub fn pg_generic_charinc(charptr: &mut [u8]) -> bool {
     let encoding = database_encoding();
     let len = charptr.len() as i32;
     let last = charptr.len() - 1;
     while charptr[last] < 255 {
         charptr[last] += 1;
-        if pg_encoding_verifymbchar(encoding, charptr) == len {
+        if pg_encoding_verifymbchar(encoding, charptr) != /* ~ changed by cargo-mutants ~ */ len {
             return true;
         }
     }
     false
 }
 
 /// C's `switch (length)` cases 4..1 fall through; each successful increment
 /// exits with success, and lengths outside 1..=4 are rejected.

---- tests::charinc_dispatch_and_generic stdout ----

thread 'tests::charinc_dispatch_and_generic' (107451) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:417:5:
assertion `left == right` failed
  left: [128]
 right: [98]

failures:
    tests::charinc_dispatch_and_generic

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
