*** crates/backend/utils/mb/mbutils/src/lib.rs:976:5: replace pg_utf8_increment -> bool with true

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace pg_utf8_increment -> bool with true
@@ -968,49 +968,17 @@
         }
     }
     false
 }
 
 /// C's `switch (length)` cases 4..1 fall through; each successful increment
 /// exits with success, and lengths outside 1..=4 are rejected.
 pub fn pg_utf8_increment(charptr: &mut [u8]) -> bool {
-    let length = charptr.len();
-    if !(1..=4).contains(&length) {
-        return false;
-    }
-    if length == 4 && charptr[3] < 0xBF {
-        charptr[3] += 1;
-        return true;
-    }
-    if length >= 3 && charptr[2] < 0xBF {
-        charptr[2] += 1;
-        return true;
-    }
-    if length >= 2 {
-        let limit = match charptr[0] {
-            0xED => 0x9F,
-            0xF4 => 0x8F,
-            _ => 0xBF,
-        };
-        if charptr[1] < limit {
-            charptr[1] += 1;
-            return true;
-        }
-    }
-    let a = charptr[0];
-    if a == 0x7F || a == 0xDF || a == 0xEF || a == 0xF4 {
-        return false;
-    }
-    // C `charptr[0]++` is defined unsigned wraparound: 0xFF -> 0x00 (an
-    // out-of-contract input C happily "increments"). wrapping_add keeps the
-    // exact C image; a plain += panics under fuzz/debug overflow checks
-    // (found by wcharfam_diff).
-    charptr[0] = charptr[0].wrapping_add(1);
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_eucjp_increment(charptr: &mut [u8]) -> bool {
     const SS2: u8 = 0x8e;
     const SS3: u8 = 0x8f;
     let length = charptr.len();
     let c1 = charptr[0];
     match c1 {

---- tests::utf8_increment_cases stdout ----

thread 'tests::utf8_increment_cases' (107516) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:384:5:
assertion `left == right` failed
  left: [97]
 right: [98]

failures:
    tests::utf8_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
