*** crates/backend/utils/mb/mbutils/src/lib.rs:977:8: delete ! in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete ! in pg_utf8_increment
@@ -969,17 +969,17 @@
     }
     false
 }
 
 /// C's `switch (length)` cases 4..1 fall through; each successful increment
 /// exits with success, and lengths outside 1..=4 are rejected.
 pub fn pg_utf8_increment(charptr: &mut [u8]) -> bool {
     let length = charptr.len();
-    if !(1..=4).contains(&length) {
+    if  /* ~ changed by cargo-mutants ~ */(1..=4).contains(&length) {
         return false;
     }
     if length == 4 && charptr[3] < 0xBF {
         charptr[3] += 1;
         return true;
     }
     if length >= 3 && charptr[2] < 0xBF {
         charptr[2] += 1;

---- tests::utf8_increment_cases stdout ----

thread 'tests::utf8_increment_cases' (107676) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:383:5:
assertion failed: pg_utf8_increment(&mut c)

failures:
    tests::utf8_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
