*** crates/backend/utils/mb/mbutils/src/lib.rs:981:20: replace += with *= in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with *= in pg_utf8_increment
@@ -973,17 +973,17 @@
 /// C's `switch (length)` cases 4..1 fall through; each successful increment
 /// exits with success, and lengths outside 1..=4 are rejected.
 pub fn pg_utf8_increment(charptr: &mut [u8]) -> bool {
     let length = charptr.len();
     if !(1..=4).contains(&length) {
         return false;
     }
     if length == 4 && charptr[3] < 0xBF {
-        charptr[3] += 1;
+        charptr[3] *= /* ~ changed by cargo-mutants ~ */ 1;
         return true;
     }
     if length >= 3 && charptr[2] < 0xBF {
         charptr[2] += 1;
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {

*** result: Success
