*** crates/backend/utils/mb/mbutils/src/lib.rs:984:34: replace < with == in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with == in pg_utf8_increment
@@ -976,17 +976,17 @@
     let length = charptr.len();
     if !(1..=4).contains(&length) {
         return false;
     }
     if length == 4 && charptr[3] < 0xBF {
         charptr[3] += 1;
         return true;
     }
-    if length >= 3 && charptr[2] < 0xBF {
+    if length >= 3 && charptr[2] == /* ~ changed by cargo-mutants ~ */ 0xBF {
         charptr[2] += 1;
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
             0xF4 => 0x8F,
             _ => 0xBF,

---- tests::utf8_increment_cases stdout ----

thread 'tests::utf8_increment_cases' (108322) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:392:5:
assertion `left == right` failed
  left: [237, 159, 192]
 right: [238, 159, 191]

failures:
    tests::utf8_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
