*** crates/backend/utils/mb/mbutils/src/lib.rs:985:20: replace += with -= in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_utf8_increment
@@ -977,17 +977,17 @@
     if !(1..=4).contains(&length) {
         return false;
     }
     if length == 4 && charptr[3] < 0xBF {
         charptr[3] += 1;
         return true;
     }
     if length >= 3 && charptr[2] < 0xBF {
-        charptr[2] += 1;
+        charptr[2] -= /* ~ changed by cargo-mutants ~ */ 1;
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
             0xF4 => 0x8F,
             _ => 0xBF,
         };

*** result: Success
