*** crates/backend/utils/mb/mbutils/src/lib.rs:988:15: replace >= with < in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace >= with < in pg_utf8_increment
@@ -980,17 +980,17 @@
     if length == 4 && charptr[3] < 0xBF {
         charptr[3] += 1;
         return true;
     }
     if length >= 3 && charptr[2] < 0xBF {
         charptr[2] += 1;
         return true;
     }
-    if length >= 2 {
+    if length < /* ~ changed by cargo-mutants ~ */ 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
             0xF4 => 0x8F,
             _ => 0xBF,
         };
         if charptr[1] < limit {
             charptr[1] += 1;
             return true;

---- tests::utf8_increment_cases stdout ----

thread 'tests::utf8_increment_cases' (108721) panicked at crates/backend/utils/mb/mbutils/src/lib.rs:994:12:
index out of bounds: the len is 1 but the index is 1

failures:
    tests::utf8_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
