*** crates/backend/utils/mb/mbutils/src/lib.rs:990:13: delete match arm 0xED in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete match arm 0xED in pg_utf8_increment
@@ -982,17 +982,17 @@
         return true;
     }
     if length >= 3 && charptr[2] < 0xBF {
         charptr[2] += 1;
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {
-            0xED => 0x9F,
+             /* ~ changed by cargo-mutants ~ */
             0xF4 => 0x8F,
             _ => 0xBF,
         };
         if charptr[1] < limit {
             charptr[1] += 1;
             return true;
         }
     }

---- tests::utf8_increment_cases stdout ----

thread 'tests::utf8_increment_cases' (108725) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:392:5:
assertion `left == right` failed
  left: [237, 160, 191]
 right: [238, 159, 191]

failures:
    tests::utf8_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
