*** crates/backend/utils/mb/mbutils/src/lib.rs:991:13: delete match arm 0xF4 in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ delete match arm 0xF4 in pg_utf8_increment
@@ -983,17 +983,17 @@
     }
     if length >= 3 && charptr[2] < 0xBF {
         charptr[2] += 1;
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
-            0xF4 => 0x8F,
+             /* ~ changed by cargo-mutants ~ */
             _ => 0xBF,
         };
         if charptr[1] < limit {
             charptr[1] += 1;
             return true;
         }
     }
     let a = charptr[0];

*** result: Success
