*** crates/backend/utils/mb/mbutils/src/lib.rs:994:23: replace < with > in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with > in pg_utf8_increment
@@ -986,17 +986,17 @@
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
             0xF4 => 0x8F,
             _ => 0xBF,
         };
-        if charptr[1] < limit {
+        if charptr[1] > /* ~ changed by cargo-mutants ~ */ limit {
             charptr[1] += 1;
             return true;
         }
     }
     let a = charptr[0];
     if a == 0x7F || a == 0xDF || a == 0xEF || a == 0xF4 {
         return false;
     }

*** result: Success
