*** crates/backend/utils/mb/mbutils/src/lib.rs:994:23: replace < with <= in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace < with <= in pg_utf8_increment
@@ -986,17 +986,17 @@
         return true;
     }
     if length >= 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
             0xF4 => 0x8F,
             _ => 0xBF,
         };
-        if charptr[1] < limit {
+        if charptr[1] <= /* ~ changed by cargo-mutants ~ */ limit {
             charptr[1] += 1;
             return true;
         }
     }
     let a = charptr[0];
     if a == 0x7F || a == 0xDF || a == 0xEF || a == 0xF4 {
         return false;
     }

---- tests::utf8_increment_cases stdout ----

thread 'tests::utf8_increment_cases' (108969) panicked at crates/backend/utils/mb/mbutils/src/tests.rs:389:5:
assertion `left == right` failed
  left: [195, 192]
 right: [196, 191]

failures:
    tests::utf8_increment_cases

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
