*** crates/backend/utils/mb/mbutils/src/lib.rs:995:24: replace += with -= in pg_utf8_increment

*** mutation diff:
--- crates/backend/utils/mb/mbutils/src/lib.rs
+++ replace += with -= in pg_utf8_increment
@@ -987,17 +987,17 @@
     }
     if length >= 2 {
         let limit = match charptr[0] {
             0xED => 0x9F,
             0xF4 => 0x8F,
             _ => 0xBF,
         };
         if charptr[1] < limit {
-            charptr[1] += 1;
+            charptr[1] -= /* ~ changed by cargo-mutants ~ */ 1;
             return true;
         }
     }
     let a = charptr[0];
     if a == 0x7F || a == 0xDF || a == 0xEF || a == 0xF4 {
         return false;
     }
     // C `charptr[0]++` is defined unsigned wraparound: 0xFF -> 0x00 (an

*** result: Success
