*** crates/common/wchar/src/lib.rs:1003:43: replace == with != in nonutf8_invalid_pair

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in nonutf8_invalid_pair
@@ -995,17 +995,17 @@
     mbl
 }
 
 fn pg_sjis_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_sjis_verifychar)
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
-    s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1
+    s[0] == NONUTF8_INVALID_BYTE0 && s[1] != /* ~ changed by cargo-mutants ~ */ NONUTF8_INVALID_BYTE1
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_big5_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42415) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 26 enc 36
  left: 198
 right: 257

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42414) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 36
  left: 17268923330386638317
 right: 11752728308893793987

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (42413) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 36
  left: 5327961720370168788
 right: 9694155467978593383

failures:
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.86s

*** result: Failure(101)
