*** crates/common/wchar/src/lib.rs:1003:5: replace nonutf8_invalid_pair -> bool with true

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace nonutf8_invalid_pair -> bool with true
@@ -995,17 +995,17 @@
     mbl
 }
 
 fn pg_sjis_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_sjis_verifychar)
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
-    s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_big5_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42219) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 36
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42218) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 36
  left: 1208198982629466917
 right: 11752728308893793987

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (42216) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 36
  left: 13398812283729224485
 right: 10606389344243671845

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.39s

*** result: Failure(101)
