*** crates/common/wchar/src/lib.rs:1007:5: replace pg_big5_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_big5_verifychar -> i32 with 0
@@ -999,29 +999,17 @@
     verify_str(s, pg_sjis_verifychar)
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
     s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_big5_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if mbl == 2 && nonutf8_invalid_pair(s) {
-        return -1;
-    }
-    for i in 1..mbl as usize {
-        if s[i] == 0 {
-            return -1;
-        }
-    }
-    mbl
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_big5_verifychar)
 }
 
 fn pg_gbk_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_gbk_mblen(s);

*** result: Timeout
