*** crates/common/wchar/src/lib.rs:1007:5: replace pg_big5_verifychar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_big5_verifychar -> i32 with 1
@@ -999,29 +999,17 @@
     verify_str(s, pg_sjis_verifychar)
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
     s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_big5_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if mbl == 2 && nonutf8_invalid_pair(s) {
-        return -1;
-    }
-    for i in 1..mbl as usize {
-        if s[i] == 0 {
-            return -1;
-        }
-    }
-    mbl
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_big5_verifychar)
 }
 
 fn pg_gbk_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_gbk_mblen(s);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42513) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 51 enc 36
  left: 3
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42512) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 36
  left: 1677996718092854053
 right: 11752728308893793987

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (42510) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 36
  left: 13540835691694531365
 right: 10606389344243671845

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.42s

*** result: Failure(101)
