*** crates/common/wchar/src/lib.rs:1008:25: replace < with <= in pg_big5_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_big5_verifychar
@@ -1000,17 +1000,17 @@
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
     s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_big5_mblen(s);
-    if (s.len() as i32) < mbl {
+    if (s.len() as i32) <= /* ~ changed by cargo-mutants ~ */ mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {
         return -1;
     }
     for i in 1..mbl as usize {
         if s[i] == 0 {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42709) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 36
  left: 14
 right: 16

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42708) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 36
  left: 10230127906827019045
 right: 11752728308893793987

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (42706) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 36
  left: 2058754923069301541
 right: 10606389344243671845

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.48s

*** result: Failure(101)
