*** crates/common/wchar/src/lib.rs:1012:16: delete - in pg_big5_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_big5_verifychar
@@ -1004,17 +1004,17 @@
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_big5_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     for i in 1..mbl as usize {
         if s[i] == 0 {
             return -1;
         }
     }
     mbl
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42905) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 276 enc 36
  left: 2
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42904) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 36
  left: 9402974499842348838
 right: 11752728308893793987

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (42903) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 36
  left: 12721086591255382580
 right: 9694155467978593383

failures:
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.88s

*** result: Failure(101)
