*** crates/common/wchar/src/lib.rs:1015:17: replace == with != in pg_big5_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_big5_verifychar
@@ -1007,17 +1007,17 @@
     let mbl = pg_big5_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {
         return -1;
     }
     for i in 1..mbl as usize {
-        if s[i] == 0 {
+        if s[i] != /* ~ changed by cargo-mutants ~ */ 0 {
             return -1;
         }
     }
     mbl
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_big5_verifychar)

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42954) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 36
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42953) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 36
  left: 17769118623955858725
 right: 11752728308893793987

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (42951) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 36
  left: 17441148855610663717
 right: 10606389344243671845

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.44s

*** result: Failure(101)
