*** crates/common/wchar/src/lib.rs:1023:5: replace pg_big5_verifystr -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_big5_verifystr -> i32 with 1
@@ -1015,17 +1015,17 @@
         if s[i] == 0 {
             return -1;
         }
     }
     mbl
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_big5_verifychar)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gbk_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_gbk_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (43102) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 1 enc 36
  left: 1
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (43099) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 36
  left: 14335493726906110757
 right: 10606389344243671845

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (43100) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 36
  left: 3271687377348903653
 right: 9694155467978593383

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.38s

*** result: Failure(101)
