*** crates/common/wchar/src/lib.rs:1027:5: replace pg_gbk_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gbk_verifychar -> i32 with 0
@@ -1019,29 +1019,17 @@
     mbl
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_big5_verifychar)
 }
 
 fn pg_gbk_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_gbk_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if mbl == 2 && nonutf8_invalid_pair(s) {
-        return -1;
-    }
-    for i in 1..mbl as usize {
-        if s[i] == 0 {
-            return -1;
-        }
-    }
-    mbl
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gbk_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gbk_verifychar)
 }
 
 fn pg_uhc_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_uhc_mblen(s);

*** result: Timeout
