*** crates/common/wchar/src/lib.rs:1027:5: replace pg_gbk_verifychar -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gbk_verifychar -> i32 with -1
@@ -1019,29 +1019,17 @@
     mbl
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_big5_verifychar)
 }
 
 fn pg_gbk_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_gbk_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if mbl == 2 && nonutf8_invalid_pair(s) {
-        return -1;
-    }
-    for i in 1..mbl as usize {
-        if s[i] == 0 {
-            return -1;
-        }
-    }
-    mbl
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gbk_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gbk_verifychar)
 }
 
 fn pg_uhc_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_uhc_mblen(s);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (43297) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 37
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (43296) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 37
  left: 7420765353468896037
 right: 11752728308893793987

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (43294) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 37
  left: 13398812283729224485
 right: 10606389344243671845

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.56s

*** result: Failure(101)
