*** crates/common/wchar/src/lib.rs:1028:25: replace < with > in pg_gbk_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_gbk_verifychar
@@ -1020,17 +1020,17 @@
 }
 
 fn pg_big5_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_big5_verifychar)
 }
 
 fn pg_gbk_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_gbk_mblen(s);
-    if (s.len() as i32) < mbl {
+    if (s.len() as i32) > /* ~ changed by cargo-mutants ~ */ mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {
         return -1;
     }
     for i in 1..mbl as usize {
         if s[i] == 0 {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (43395) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 37
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (43394) panicked at crates/common/wchar/src/lib.rs:1035:12:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (43392) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 37
  left: 13398812283729224485
 right: 10606389344243671845

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.46s

*** result: Failure(101)
