*** crates/common/wchar/src/lib.rs:1036:20: delete - in pg_gbk_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_gbk_verifychar
@@ -1028,17 +1028,17 @@
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 2 && nonutf8_invalid_pair(s) {
         return -1;
     }
     for i in 1..mbl as usize {
         if s[i] == 0 {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
     }
     mbl
 }
 
 fn pg_gbk_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gbk_verifychar)
 }

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (43737) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 37
  left: 8040724001024229571
 right: 11752728308893793987

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (43735) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 37
  left: 15285736685097329445
 right: 10606389344243671845

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (43736) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 37
  left: 2960761818752234599
 right: 9694155467978593383

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.65s

*** result: Failure(101)
