*** crates/common/wchar/src/lib.rs:1047:5: replace pg_uhc_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_uhc_verifychar -> i32 with 0
@@ -1039,29 +1039,17 @@
     mbl
 }
 
 fn pg_gbk_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gbk_verifychar)
 }
 
 fn pg_uhc_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_uhc_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if mbl == 2 && nonutf8_invalid_pair(s) {
-        return -1;
-    }
-    for i in 1..mbl as usize {
-        if s[i] == 0 {
-            return -1;
-        }
-    }
-    mbl
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_uhc_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_uhc_verifychar)
 }
 
 fn pg_gb18030_verifychar(s: &[u8]) -> i32 {
     let len = s.len();

*** result: Timeout
