*** crates/common/wchar/src/lib.rs:1051:12: replace == with != in pg_uhc_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_uhc_verifychar
@@ -1043,17 +1043,17 @@
     verify_str(s, pg_gbk_verifychar)
 }
 
 fn pg_uhc_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_uhc_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
-    if mbl == 2 && nonutf8_invalid_pair(s) {
+    if mbl != /* ~ changed by cargo-mutants ~ */ 2 && nonutf8_invalid_pair(s) {
         return -1;
     }
     for i in 1..mbl as usize {
         if s[i] == 0 {
             return -1;
         }
     }
     mbl

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (44326) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 276 enc 38
  left: 2
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (44325) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 38
  left: 955112617987510565
 right: 11752728308893793987

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (44324) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 38
  left: 6810214990070697364
 right: 9694155467978593383

failures:
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.86s

*** result: Failure(101)
