*** crates/common/wchar/src/lib.rs:1063:5: replace pg_uhc_verifystr -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_uhc_verifystr -> i32 with 1
@@ -1055,17 +1055,17 @@
         if s[i] == 0 {
             return -1;
         }
     }
     mbl
 }
 
 fn pg_uhc_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_uhc_verifychar)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gb18030_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     if !is_highbit_set(s[0]) {
         1
     } else if len >= 4 && (0x30..=0x39).contains(&s[1]) {
         if (0x81..=0xfe).contains(&s[0])

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (44571) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 1 enc 38
  left: 1
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (44568) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 38
  left: 14335493726906110757
 right: 10606389344243671845

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (44569) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 38
  left: 3271687377348903653
 right: 9694155467978593383

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.72s

*** result: Failure(101)
