*** crates/common/wchar/src/lib.rs:1067:5: replace pg_gb18030_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gb18030_verifychar -> i32 with 0
@@ -1059,37 +1059,17 @@
     mbl
 }
 
 fn pg_uhc_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_uhc_verifychar)
 }
 
 fn pg_gb18030_verifychar(s: &[u8]) -> i32 {
-    let len = s.len();
-    if !is_highbit_set(s[0]) {
-        1
-    } else if len >= 4 && (0x30..=0x39).contains(&s[1]) {
-        if (0x81..=0xfe).contains(&s[0])
-            && (0x81..=0xfe).contains(&s[2])
-            && (0x30..=0x39).contains(&s[3])
-        {
-            4
-        } else {
-            -1
-        }
-    } else if len >= 2 && (0x81..=0xfe).contains(&s[0]) {
-        if (0x40..=0x7e).contains(&s[1]) || (0x80..=0xfe).contains(&s[1]) {
-            2
-        } else {
-            -1
-        }
-    } else {
-        -1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gb18030_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gb18030_verifychar)
 }
 
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
     let b = s[0];

*** result: Timeout
