*** crates/common/wchar/src/lib.rs:1067:5: replace pg_gb18030_verifychar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gb18030_verifychar -> i32 with 1
@@ -1059,37 +1059,17 @@
     mbl
 }
 
 fn pg_uhc_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_uhc_verifychar)
 }
 
 fn pg_gb18030_verifychar(s: &[u8]) -> i32 {
-    let len = s.len();
-    if !is_highbit_set(s[0]) {
-        1
-    } else if len >= 4 && (0x30..=0x39).contains(&s[1]) {
-        if (0x81..=0xfe).contains(&s[0])
-            && (0x81..=0xfe).contains(&s[2])
-            && (0x30..=0x39).contains(&s[3])
-        {
-            4
-        } else {
-            -1
-        }
-    } else if len >= 2 && (0x81..=0xfe).contains(&s[0]) {
-        if (0x40..=0x7e).contains(&s[1]) || (0x80..=0xfe).contains(&s[1]) {
-            2
-        } else {
-            -1
-        }
-    } else {
-        -1
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gb18030_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gb18030_verifychar)
 }
 
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
     let b = s[0];

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (44718) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 39
  left: 16
 right: 14

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (44717) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 39
  left: 1677996718092854053
 right: 14799626338796391093

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (44715) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 39
  left: 13540835691694531365
 right: 9462874670269030725

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.87s

*** result: Failure(101)
