*** crates/common/wchar/src/lib.rs:1070:19: replace >= with < in pg_gb18030_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace >= with < in pg_gb18030_verifychar
@@ -1062,17 +1062,17 @@
 fn pg_uhc_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_uhc_verifychar)
 }
 
 fn pg_gb18030_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     if !is_highbit_set(s[0]) {
         1
-    } else if len >= 4 && (0x30..=0x39).contains(&s[1]) {
+    } else if len < /* ~ changed by cargo-mutants ~ */ 4 && (0x30..=0x39).contains(&s[1]) {
         if (0x81..=0xfe).contains(&s[0])
             && (0x81..=0xfe).contains(&s[2])
             && (0x30..=0x39).contains(&s[3])
         {
             4
         } else {
             -1
         }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (44914) panicked at crates/common/wchar/src/lib.rs:1070:85:
index out of bounds: the len is 1 but the index is 1

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (44913) panicked at crates/common/wchar/src/lib.rs:1070:85:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (44911) panicked at crates/common/wchar/src/lib.rs:1070:85:
index out of bounds: the len is 1 but the index is 1

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.81s

*** result: Failure(101)
