*** crates/common/wchar/src/lib.rs:1073:13: replace && with || in pg_gb18030_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace && with || in pg_gb18030_verifychar
@@ -1065,17 +1065,17 @@
 
 fn pg_gb18030_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     if !is_highbit_set(s[0]) {
         1
     } else if len >= 4 && (0x30..=0x39).contains(&s[1]) {
         if (0x81..=0xfe).contains(&s[0])
             && (0x81..=0xfe).contains(&s[2])
-            && (0x30..=0x39).contains(&s[3])
+            || /* ~ changed by cargo-mutants ~ */ (0x30..=0x39).contains(&s[3])
         {
             4
         } else {
             -1
         }
     } else if len >= 2 && (0x81..=0xfe).contains(&s[0]) {
         if (0x40..=0x7e).contains(&s[1]) || (0x80..=0xfe).contains(&s[1]) {
             2

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (44963) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 298 enc 39
  left: 29
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (44960) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 39
  left: 10828625764936371461
 right: 9462874670269030725

failures:
    verify_quads_match_c
    verifystr_corpora_match_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
