*** crates/common/wchar/src/lib.rs:1079:19: replace >= with < in pg_gb18030_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace >= with < in pg_gb18030_verifychar
@@ -1071,17 +1071,17 @@
         if (0x81..=0xfe).contains(&s[0])
             && (0x81..=0xfe).contains(&s[2])
             && (0x30..=0x39).contains(&s[3])
         {
             4
         } else {
             -1
         }
-    } else if len >= 2 && (0x81..=0xfe).contains(&s[0]) {
+    } else if len < /* ~ changed by cargo-mutants ~ */ 2 && (0x81..=0xfe).contains(&s[0]) {
         if (0x40..=0x7e).contains(&s[1]) || (0x80..=0xfe).contains(&s[1]) {
             2
         } else {
             -1
         }
     } else {
         -1
     }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (45159) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 39
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (45158) panicked at crates/common/wchar/src/lib.rs:1080:36:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (45156) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 39
  left: 3046635770403034437
 right: 9462874670269030725

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.80s

*** result: Failure(101)
