*** crates/common/wchar/src/lib.rs:1079:24: replace && with || in pg_gb18030_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace && with || in pg_gb18030_verifychar
@@ -1071,17 +1071,17 @@
         if (0x81..=0xfe).contains(&s[0])
             && (0x81..=0xfe).contains(&s[2])
             && (0x30..=0x39).contains(&s[3])
         {
             4
         } else {
             -1
         }
-    } else if len >= 2 && (0x81..=0xfe).contains(&s[0]) {
+    } else if len >= 2 || /* ~ changed by cargo-mutants ~ */ (0x81..=0xfe).contains(&s[0]) {
         if (0x40..=0x7e).contains(&s[1]) || (0x80..=0xfe).contains(&s[1]) {
             2
         } else {
             -1
         }
     } else {
         -1
     }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (45110) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 39
  left: 16
 right: 14

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (45109) panicked at crates/common/wchar/src/lib.rs:1080:36:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (45107) panicked at crates/common/wchar/src/lib.rs:1080:36:
index out of bounds: the len is 1 but the index is 1

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.81s

*** result: Failure(101)
