*** crates/common/wchar/src/lib.rs:1091:5: replace pg_gb18030_verifystr -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gb18030_verifystr -> i32 with -1
@@ -1083,17 +1083,17 @@
             -1
         }
     } else {
         -1
     }
 }
 
 fn pg_gb18030_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_gb18030_verifychar)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
     let b = s[0];
     let l;
     if b & 0x80 == 0 {
         if b == 0 {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (45453) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 39
  left: -1
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (45450) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 39
  left: 77679849365288997
 right: 9462874670269030725

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (45451) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 39
  left: 265504813666612261
 right: 16951333527785124116

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.88s

*** result: Failure(101)
