*** crates/common/wchar/src/lib.rs:1095:5: replace pg_utf8_verifychar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf8_verifychar -> i32 with 1
@@ -1087,39 +1087,17 @@
     }
 }
 
 fn pg_gb18030_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gb18030_verifychar)
 }
 
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
-    let b = s[0];
-    let l;
-    if b & 0x80 == 0 {
-        if b == 0 {
-            return -1;
-        }
-        return 1;
-    } else if b & 0xe0 == 0xc0 {
-        l = 2;
-    } else if b & 0xf0 == 0xe0 {
-        l = 3;
-    } else if b & 0xf8 == 0xf0 {
-        l = 4;
-    } else {
-        l = 1;
-    }
-    if l as usize > s.len() {
-        return -1;
-    }
-    if !pg_utf8_islegal(s, l) {
-        return -1;
-    }
-    l
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Shared body of every non-UTF8 `*_verifystr` in wchar.c, monomorphized per
 /// character verifier.
 #[inline]
 fn verify_str(s: &[u8], verifychar: impl Fn(&[u8]) -> i32) -> i32 {
     let mut rest = s;
     while let Some((&b, tail)) = rest.split_first() {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (45551) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 100 enc 6
  left: 2
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (45550) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 1677996718092854053
 right: 8361214505092495653

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (45548) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 13540835691694531365
 right: 15767326444561765157

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.31s

*** result: Failure(101)
