*** crates/common/wchar/src/lib.rs:1097:10: replace & with | in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with | in pg_utf8_verifychar
@@ -1089,17 +1089,17 @@
 
 fn pg_gb18030_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gb18030_verifychar)
 }
 
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
     let b = s[0];
     let l;
-    if b & 0x80 == 0 {
+    if b | /* ~ changed by cargo-mutants ~ */ 0x80 == 0 {
         if b == 0 {
             return -1;
         }
         return 1;
     } else if b & 0xe0 == 0xc0 {
         l = 2;
     } else if b & 0xf0 == 0xe0 {
         l = 3;

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (45697) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 8693251013226193189
 right: 8361214505092495653

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (45696) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 6
  left: 18219576832502368532
 right: 14634591377994729748

---- utf8_verify_3byte_exhaustive_matches_c stdout ----

thread 'utf8_verify_3byte_exhaustive_matches_c' (45694) panicked at crates/common/wchar/tests/c_parity.rs:140:5:
assertion `left == right` failed
  left: 461999339456944020
 right: 8649043623152703380

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.87s

*** result: Failure(101)
