*** crates/common/wchar/src/lib.rs:1097:10: replace & with ^ in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in pg_utf8_verifychar
@@ -1089,17 +1089,17 @@
 
 fn pg_gb18030_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_gb18030_verifychar)
 }
 
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
     let b = s[0];
     let l;
-    if b & 0x80 == 0 {
+    if b ^ /* ~ changed by cargo-mutants ~ */ 0x80 == 0 {
         if b == 0 {
             return -1;
         }
         return 1;
     } else if b & 0xe0 == 0xc0 {
         l = 2;
     } else if b & 0xf0 == 0xe0 {
         l = 3;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (45747) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 212 enc 6
  left: 1
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (45746) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 7169418604283955493
 right: 8361214505092495653

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (45745) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 6
  left: 6720978988021944613
 right: 14634591377994729748

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.85s

*** result: Failure(101)
