*** crates/common/wchar/src/lib.rs:1102:17: replace & with | in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with | in pg_utf8_verifychar
@@ -1094,17 +1094,17 @@
 fn pg_utf8_verifychar(s: &[u8]) -> i32 {
     let b = s[0];
     let l;
     if b & 0x80 == 0 {
         if b == 0 {
             return -1;
         }
         return 1;
-    } else if b & 0xe0 == 0xc0 {
+    } else if b | /* ~ changed by cargo-mutants ~ */ 0xe0 == 0xc0 {
         l = 2;
     } else if b & 0xf0 == 0xe0 {
         l = 3;
     } else if b & 0xf8 == 0xf0 {
         l = 4;
     } else {
         l = 1;
     }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (45943) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 37 enc 6
  left: 1
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (45942) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 6658786847897135909
 right: 8361214505092495653

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (45940) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 3944648741637198629
 right: 15767326444561765157

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.65s

*** result: Failure(101)
