*** crates/common/wchar/src/lib.rs:1106:17: replace & with ^ in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in pg_utf8_verifychar
@@ -1098,17 +1098,17 @@
         if b == 0 {
             return -1;
         }
         return 1;
     } else if b & 0xe0 == 0xc0 {
         l = 2;
     } else if b & 0xf0 == 0xe0 {
         l = 3;
-    } else if b & 0xf8 == 0xf0 {
+    } else if b ^ /* ~ changed by cargo-mutants ~ */ 0xf8 == 0xf0 {
         l = 4;
     } else {
         l = 1;
     }
     if l as usize > s.len() {
         return -1;
     }
     if !pg_utf8_islegal(s, l) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46287) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 6
  left: 1
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (46286) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 2058412589389152549
 right: 8361214505092495653

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46284) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 18012048686410073381
 right: 15767326444561765157

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** result: Failure(101)
