*** crates/common/wchar/src/lib.rs:1111:19: replace > with == in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with == in pg_utf8_verifychar
@@ -1103,17 +1103,17 @@
         l = 2;
     } else if b & 0xf0 == 0xe0 {
         l = 3;
     } else if b & 0xf8 == 0xf0 {
         l = 4;
     } else {
         l = 1;
     }
-    if l as usize > s.len() {
+    if l as usize == /* ~ changed by cargo-mutants ~ */ s.len() {
         return -1;
     }
     if !pg_utf8_islegal(s, l) {
         return -1;
     }
     l
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46335) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 6
  left: 12
 right: 16

---- utf8_verify_3byte_exhaustive_matches_c stdout ----

thread 'utf8_verify_3byte_exhaustive_matches_c' (46331) panicked at crates/common/wchar/src/lib.rs:1299:51:
index out of bounds: the len is 1 but the index is 1

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (46334) panicked at crates/common/wchar/src/lib.rs:1299:51:
index out of bounds: the len is 1 but the index is 1

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
