*** crates/common/wchar/src/lib.rs:1112:16: delete - in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_utf8_verifychar
@@ -1104,17 +1104,17 @@
     } else if b & 0xf0 == 0xe0 {
         l = 3;
     } else if b & 0xf8 == 0xf0 {
         l = 4;
     } else {
         l = 1;
     }
     if l as usize > s.len() {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     if !pg_utf8_islegal(s, l) {
         return -1;
     }
     l
 }
 
 /// Shared body of every non-UTF8 `*_verifystr` in wchar.c, monomorphized per

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46445) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 228 enc 6
  left: 1
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (46444) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 16097237844753833253
 right: 8361214505092495653

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46442) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 6178073647220708133
 right: 15767326444561765157

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.63s

*** result: Failure(101)
