*** crates/common/wchar/src/lib.rs:1114:8: delete ! in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_utf8_verifychar
@@ -1106,17 +1106,17 @@
     } else if b & 0xf8 == 0xf0 {
         l = 4;
     } else {
         l = 1;
     }
     if l as usize > s.len() {
         return -1;
     }
-    if !pg_utf8_islegal(s, l) {
+    if  /* ~ changed by cargo-mutants ~ */pg_utf8_islegal(s, l) {
         return -1;
     }
     l
 }
 
 /// Shared body of every non-UTF8 `*_verifystr` in wchar.c, monomorphized per
 /// character verifier.
 #[inline]

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46527) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 6
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (46526) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 18146553969099144485
 right: 8361214505092495653

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46524) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 16320298579210438181
 right: 15767326444561765157

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.93s

*** result: Failure(101)
