*** crates/common/wchar/src/lib.rs:1115:16: delete - in pg_utf8_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_utf8_verifychar
@@ -1107,17 +1107,17 @@
         l = 4;
     } else {
         l = 1;
     }
     if l as usize > s.len() {
         return -1;
     }
     if !pg_utf8_islegal(s, l) {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     l
 }
 
 /// Shared body of every non-UTF8 `*_verifystr` in wchar.c, monomorphized per
 /// character verifier.
 #[inline]
 fn verify_str(s: &[u8], verifychar: impl Fn(&[u8]) -> i32) -> i32 {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46543) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 100 enc 6
  left: 2
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (46542) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 10476168001890847525
 right: 8361214505092495653

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46540) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 1968480274660861989
 right: 15767326444561765157

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.01s

*** result: Failure(101)
