*** crates/common/wchar/src/lib.rs:1124:5: replace verify_str -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace verify_str -> i32 with 0
@@ -1116,32 +1116,17 @@
     }
     l
 }
 
 /// Shared body of every non-UTF8 `*_verifystr` in wchar.c, monomorphized per
 /// character verifier.
 #[inline]
 fn verify_str(s: &[u8], verifychar: impl Fn(&[u8]) -> i32) -> i32 {
-    let mut rest = s;
-    while let Some((&b, tail)) = rest.split_first() {
-        if !is_highbit_set(b) {
-            if b == 0 {
-                break;
-            }
-            rest = tail;
-            continue;
-        }
-        let l = verifychar(rest);
-        if l == -1 {
-            break;
-        }
-        rest = &rest[l as usize..];
-    }
-    (s.len() - rest.len()) as i32
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 const STRIDE_LENGTH: usize = 32;
 
 #[cfg(target_arch = "aarch64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
     use core::arch::aarch64::*;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46624) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 1
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46621) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 235135007728539941
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (46622) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 483940769762467909
 right: 2498594579922710343

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
