*** crates/common/wchar/src/lib.rs:1127:18: replace == with != in verify_str

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in verify_str
@@ -1119,17 +1119,17 @@
 
 /// Shared body of every non-UTF8 `*_verifystr` in wchar.c, monomorphized per
 /// character verifier.
 #[inline]
 fn verify_str(s: &[u8], verifychar: impl Fn(&[u8]) -> i32) -> i32 {
     let mut rest = s;
     while let Some((&b, tail)) = rest.split_first() {
         if !is_highbit_set(b) {
-            if b == 0 {
+            if b != /* ~ changed by cargo-mutants ~ */ 0 {
                 break;
             }
             rest = tail;
             continue;
         }
         let l = verifychar(rest);
         if l == -1 {
             break;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46821) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 1
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46818) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 8275786059643254546
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (46819) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 3473394531270487495
 right: 2498594579922710343

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
