*** crates/common/wchar/src/lib.rs:1134:14: replace == with != in verify_str

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in verify_str
@@ -1126,17 +1126,17 @@
         if !is_highbit_set(b) {
             if b == 0 {
                 break;
             }
             rest = tail;
             continue;
         }
         let l = verifychar(rest);
-        if l == -1 {
+        if l != /* ~ changed by cargo-mutants ~ */ -1 {
             break;
         }
         rest = &rest[l as usize..];
     }
     (s.len() - rest.len()) as i32
 }
 
 const STRIDE_LENGTH: usize = 32;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46837) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 1
  left: 0
 right: 5

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46834) panicked at crates/common/wchar/src/lib.rs:1137:21:
range start index 18446744073709551615 out of range for slice of length 4

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (46835) panicked at crates/common/wchar/src/lib.rs:1137:21:
range start index 18446744073709551615 out of range for slice of length 1

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
