*** crates/common/wchar/src/lib.rs:1139:14: replace - with + in verify_str

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace - with + in verify_str
@@ -1131,17 +1131,17 @@
             continue;
         }
         let l = verifychar(rest);
         if l == -1 {
             break;
         }
         rest = &rest[l as usize..];
     }
-    (s.len() - rest.len()) as i32
+    (s.len() + /* ~ changed by cargo-mutants ~ */ rest.len()) as i32
 }
 
 const STRIDE_LENGTH: usize = 32;
 
 #[cfg(target_arch = "aarch64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
     use core::arch::aarch64::*;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (46935) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 16 enc 1
  left: 80
 right: 0

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (46932) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 17416951182336194868
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (46933) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 17892194939784933731
 right: 2498594579922710343

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
