*** crates/common/wchar/src/lib.rs:1139:14: replace - with / in verify_str

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace - with / in verify_str
@@ -1131,17 +1131,17 @@
             continue;
         }
         let l = verifychar(rest);
         if l == -1 {
             break;
         }
         rest = &rest[l as usize..];
     }
-    (s.len() - rest.len()) as i32
+    (s.len() / /* ~ changed by cargo-mutants ~ */ rest.len()) as i32
 }
 
 const STRIDE_LENGTH: usize = 32;
 
 #[cfg(target_arch = "aarch64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
     use core::arch::aarch64::*;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (47016) panicked at crates/common/wchar/src/lib.rs:1139:5:
attempt to divide by zero

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (47013) panicked at crates/common/wchar/src/lib.rs:1139:5:
attempt to divide by zero

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (47014) panicked at crates/common/wchar/src/lib.rs:1139:5:
attempt to divide by zero

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.56s

*** result: Failure(101)
