*** crates/common/wchar/src/lib.rs:1147:5: replace is_valid_ascii -> bool with true

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_valid_ascii -> bool with true
@@ -1139,26 +1139,17 @@
     (s.len() - rest.len()) as i32
 }
 
 const STRIDE_LENGTH: usize = 32;
 
 #[cfg(target_arch = "aarch64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
-    use core::arch::aarch64::*;
-    // SAFETY: NEON is baseline on aarch64; both 16-byte loads are within `chunk`.
-    unsafe {
-        let zero = vdupq_n_u8(0);
-        let v0 = vld1q_u8(chunk.as_ptr());
-        let v1 = vld1q_u8(chunk.as_ptr().add(16));
-        let mut cum = vorrq_u8(v0, vceqq_u8(v0, zero));
-        cum = vorrq_u8(cum, vorrq_u8(v1, vceqq_u8(v1, zero)));
-        vmaxvq_u8(cum) <= 0x7f
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_arch = "x86_64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
     use core::arch::x86_64::*;
     // SAFETY: SSE2 is baseline on x86_64; both 16-byte loads are within `chunk`.
     unsafe {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (47033) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 16 enc 6
  left: 40
 right: 0

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
