*** crates/common/wchar/src/lib.rs:1147:5: replace is_valid_ascii -> bool with false

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_valid_ascii -> bool with false
@@ -1139,26 +1139,17 @@
     (s.len() - rest.len()) as i32
 }
 
 const STRIDE_LENGTH: usize = 32;
 
 #[cfg(target_arch = "aarch64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
-    use core::arch::aarch64::*;
-    // SAFETY: NEON is baseline on aarch64; both 16-byte loads are within `chunk`.
-    unsafe {
-        let zero = vdupq_n_u8(0);
-        let v0 = vld1q_u8(chunk.as_ptr());
-        let v1 = vld1q_u8(chunk.as_ptr().add(16));
-        let mut cum = vorrq_u8(v0, vceqq_u8(v0, zero));
-        cum = vorrq_u8(cum, vorrq_u8(v1, vceqq_u8(v1, zero)));
-        vmaxvq_u8(cum) <= 0x7f
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_arch = "x86_64")]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
     use core::arch::x86_64::*;
     // SAFETY: SSE2 is baseline on x86_64; both 16-byte loads are within `chunk`.
     unsafe {

*** result: Success
