*** crates/common/wchar/src/lib.rs:1182:13: replace < with <= in is_valid_ascii

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in is_valid_ascii
@@ -1174,17 +1174,17 @@
 #[cfg(not(any(target_arch = "aarch64", target_arch = "x86_64")))]
 #[inline(always)]
 fn is_valid_ascii(chunk: &[u8; STRIDE_LENGTH]) -> bool {
     // The 0x7f add flags zero bytes without carry only when no high bit is
     // set; high-bit inputs are caught by highbit_cum (C's USE_NO_SIMD path).
     let mut highbit_cum: u64 = 0;
     let mut zero_cum: u64 = 0x8080_8080_8080_8080;
     let mut i = 0;
-    while i < STRIDE_LENGTH {
+    while i <= /* ~ changed by cargo-mutants ~ */ STRIDE_LENGTH {
         let w = u64::from_ne_bytes(chunk[i..i + 8].try_into().unwrap());
         zero_cum &= w.wrapping_add(0x7f7f_7f7f_7f7f_7f7f);
         highbit_cum |= w;
         i += 8;
     }
     highbit_cum & 0x8080_8080_8080_8080 == 0 && zero_cum == 0x8080_8080_8080_8080
 }

*** result: Success
