*** crates/common/wchar/src/lib.rs:118:5: replace pg_ascii2wchar_with_len -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_ascii2wchar_with_len -> i32 with -1
@@ -110,27 +110,17 @@
     pub mblen: MblenConverter,
     pub dsplen: DsplenConverter,
     pub mbverifychar: MbCharVerifier,
     pub mbverifystr: MbStrVerifier,
     pub maxmblen: i32,
 }
 
 fn pg_ascii2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        to[ti] = from[fi] as pg_wchar;
-        fi += 1;
-        ti += 1;
-        len -= 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_ascii_mblen(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_ascii_dsplen(s: &[u8]) -> i32 {
     let c = s[0];

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (2048) panicked at crates/common/wchar/tests/c_parity.rs:181:25:
index out of bounds: the len is 4097 but the index is 4097

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.28s

*** result: Failure(101)
