*** crates/common/wchar/src/lib.rs:1205:22: replace << with >>

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace << with >>
@@ -1197,17 +1197,17 @@
 const P3B: u32 = 20;
 const P4A: u32 = 25;
 const P4B: u32 = 30;
 const END: u32 = BGN;
 const ASC: u32 = END << BGN;
 const L2A: u32 = CS1 << BGN;
 const L3A: u32 = P3A << BGN;
 const L3B: u32 = CS2 << BGN;
-const L3C: u32 = P3B << BGN;
+const L3C: u32 = P3B >> /* ~ changed by cargo-mutants ~ */ BGN;
 const L4A: u32 = P4A << BGN;
 const L4B: u32 = CS3 << BGN;
 const L4C: u32 = P4B << BGN;
 const CR1: u32 = (END << CS1) | (CS1 << CS2) | (CS2 << CS3) | (CS1 << P3B) | (CS2 << P4B);
 const CR2: u32 = (END << CS1) | (CS1 << CS2) | (CS2 << CS3) | (CS1 << P3B) | (CS2 << P4A);
 const CR3: u32 = (END << CS1) | (CS1 << CS2) | (CS2 << CS3) | (CS1 << P3A) | (CS2 << P4A);
 const ILL: u32 = ERR;

*** result: Success
