*** crates/common/wchar/src/lib.rs:1210:38: replace << with >>

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace << with >>
@@ -1202,17 +1202,17 @@
 const L2A: u32 = CS1 << BGN;
 const L3A: u32 = P3A << BGN;
 const L3B: u32 = CS2 << BGN;
 const L3C: u32 = P3B << BGN;
 const L4A: u32 = P4A << BGN;
 const L4B: u32 = CS3 << BGN;
 const L4C: u32 = P4B << BGN;
 const CR1: u32 = (END << CS1) | (CS1 << CS2) | (CS2 << CS3) | (CS1 << P3B) | (CS2 << P4B);
-const CR2: u32 = (END << CS1) | (CS1 << CS2) | (CS2 << CS3) | (CS1 << P3B) | (CS2 << P4A);
+const CR2: u32 = (END << CS1) | (CS1 >> /* ~ changed by cargo-mutants ~ */ CS2) | (CS2 << CS3) | (CS1 << P3B) | (CS2 << P4A);
 const CR3: u32 = (END << CS1) | (CS1 << CS2) | (CS2 << CS3) | (CS1 << P3A) | (CS2 << P4A);
 const ILL: u32 = ERR;
 
 // Extracting bytes from u64 words keeps the byte feed scalar; a plain byte
 // loop is auto-vectorized into ld1 + per-byte umov, which stalls the state
 // chain (dense-multibyte ns 1.04x C, see docs/optimizations/wchar-parity.md).
 #[inline]
 fn utf8_advance(chunk: &[u8; STRIDE_LENGTH], state: &mut u32) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (49722) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 297 enc 6
  left: 27
 right: 2

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
