*** crates/common/wchar/src/lib.rs:1221:13: replace < with > in utf8_advance

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in utf8_advance
@@ -1213,17 +1213,17 @@
 
 // Extracting bytes from u64 words keeps the byte feed scalar; a plain byte
 // loop is auto-vectorized into ld1 + per-byte umov, which stalls the state
 // chain (dense-multibyte ns 1.04x C, see docs/optimizations/wchar-parity.md).
 #[inline]
 fn utf8_advance(chunk: &[u8; STRIDE_LENGTH], state: &mut u32) {
     let mut st = *state;
     let mut i = 0;
-    while i < STRIDE_LENGTH {
+    while i > /* ~ changed by cargo-mutants ~ */ STRIDE_LENGTH {
         let w = u64::from_le_bytes(chunk[i..i + 8].try_into().unwrap());
         let mut k = 0;
         while k < 64 {
             st = UTF8_TRANSITION[((w >> k) & 0xff) as usize] >> (st & 31);
             k += 8;
         }
         i += 8;
     }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (50701) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 16 enc 6
  left: 40
 right: 0

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
