*** crates/common/wchar/src/lib.rs:1230:17: replace & with ^ in utf8_advance

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in utf8_advance
@@ -1222,17 +1222,17 @@
         let w = u64::from_le_bytes(chunk[i..i + 8].try_into().unwrap());
         let mut k = 0;
         while k < 64 {
             st = UTF8_TRANSITION[((w >> k) & 0xff) as usize] >> (st & 31);
             k += 8;
         }
         i += 8;
     }
-    *state = st & 31;
+    *state = st ^ /* ~ changed by cargo-mutants ~ */ 31;
 }
 
 fn pg_utf8_verifystr(s: &[u8]) -> i32 {
     let len = s.len();
     let mut state: u32 = BGN;
     let mut pos = 0usize;
     if len >= STRIDE_LENGTH {
         let (chunks, _) = s.as_chunks::<STRIDE_LENGTH>();

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (51595) panicked at crates/common/wchar/src/lib.rs:1252:17:
attempt to subtract with overflow

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
