*** crates/common/wchar/src/lib.rs:1234:5: replace pg_utf8_verifystr -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf8_verifystr -> i32 with 1
@@ -1226,57 +1226,17 @@
             k += 8;
         }
         i += 8;
     }
     *state = st & 31;
 }
 
 fn pg_utf8_verifystr(s: &[u8]) -> i32 {
-    let len = s.len();
-    let mut state: u32 = BGN;
-    let mut pos = 0usize;
-    if len >= STRIDE_LENGTH {
-        let (chunks, _) = s.as_chunks::<STRIDE_LENGTH>();
-        for chunk in chunks {
-            if state != END || !is_valid_ascii(chunk) {
-                utf8_advance(chunk, &mut state);
-            }
-        }
-        pos = chunks.len() * STRIDE_LENGTH;
-        // The error state persists, so it only needs one check, here.
-        if state == ERR {
-            // Restart from the beginning so the slow path counts valid bytes.
-            pos = 0;
-        } else if state != END {
-            // Fast path ended mid-sequence: back up to its lead byte.
-            loop {
-                pos -= 1;
-                if pg_utf_mblen_byte(s[pos]) > 1 {
-                    break;
-                }
-            }
-        }
-    }
-    let mut rest = &s[pos..];
-    while let Some((&b, tail)) = rest.split_first() {
-        if !is_highbit_set(b) {
-            if b == 0 {
-                break;
-            }
-            rest = tail;
-            continue;
-        }
-        let l = pg_utf8_verifychar(rest);
-        if l == -1 {
-            break;
-        }
-        rest = &rest[l as usize..];
-    }
-    (len - rest.len()) as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_utf8_islegal(source: &[u8], length: i32) -> bool {
     match length {
         4 => {
             if !(0x80..=0xbf).contains(&source[3]) {
                 return false;
             }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (51699) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 1 enc 6
  left: 1
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (51696) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 11924688599753626405
 right: 15767326444561765157

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (51697) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 6
  left: 630851670792169765
 right: 14634591377994729748

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.52s

*** result: Failure(101)
