*** crates/common/wchar/src/lib.rs:1240:32: delete ! in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_utf8_verifystr
@@ -1232,17 +1232,17 @@
 
 fn pg_utf8_verifystr(s: &[u8]) -> i32 {
     let len = s.len();
     let mut state: u32 = BGN;
     let mut pos = 0usize;
     if len >= STRIDE_LENGTH {
         let (chunks, _) = s.as_chunks::<STRIDE_LENGTH>();
         for chunk in chunks {
-            if state != END || !is_valid_ascii(chunk) {
+            if state != END ||  /* ~ changed by cargo-mutants ~ */is_valid_ascii(chunk) {
                 utf8_advance(chunk, &mut state);
             }
         }
         pos = chunks.len() * STRIDE_LENGTH;
         // The error state persists, so it only needs one check, here.
         if state == ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (51941) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 16 enc 6
  left: 40
 right: 0

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
