*** crates/common/wchar/src/lib.rs:1244:28: replace * with / in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace * with / in pg_utf8_verifystr
@@ -1236,17 +1236,17 @@
     let mut pos = 0usize;
     if len >= STRIDE_LENGTH {
         let (chunks, _) = s.as_chunks::<STRIDE_LENGTH>();
         for chunk in chunks {
             if state != END || !is_valid_ascii(chunk) {
                 utf8_advance(chunk, &mut state);
             }
         }
-        pos = chunks.len() * STRIDE_LENGTH;
+        pos = chunks.len() / /* ~ changed by cargo-mutants ~ */ STRIDE_LENGTH;
         // The error state persists, so it only needs one check, here.
         if state == ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;
         } else if state != END {
             // Fast path ended mid-sequence: back up to its lead byte.
             loop {
                 pos -= 1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52042) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 27 enc 6
  left: 1
 right: 1024

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
