*** crates/common/wchar/src/lib.rs:1246:18: replace == with != in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_utf8_verifystr
@@ -1238,17 +1238,17 @@
         let (chunks, _) = s.as_chunks::<STRIDE_LENGTH>();
         for chunk in chunks {
             if state != END || !is_valid_ascii(chunk) {
                 utf8_advance(chunk, &mut state);
             }
         }
         pos = chunks.len() * STRIDE_LENGTH;
         // The error state persists, so it only needs one check, here.
-        if state == ERR {
+        if state != /* ~ changed by cargo-mutants ~ */ ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;
         } else if state != END {
             // Fast path ended mid-sequence: back up to its lead byte.
             loop {
                 pos -= 1;
                 if pg_utf_mblen_byte(s[pos]) > 1 {
                     break;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52117) panicked at crates/common/wchar/src/lib.rs:1252:17:
attempt to subtract with overflow

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
