*** crates/common/wchar/src/lib.rs:1249:25: replace != with == in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace != with == in pg_utf8_verifystr
@@ -1241,17 +1241,17 @@
                 utf8_advance(chunk, &mut state);
             }
         }
         pos = chunks.len() * STRIDE_LENGTH;
         // The error state persists, so it only needs one check, here.
         if state == ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;
-        } else if state != END {
+        } else if state == /* ~ changed by cargo-mutants ~ */ END {
             // Fast path ended mid-sequence: back up to its lead byte.
             loop {
                 pos -= 1;
                 if pg_utf_mblen_byte(s[pos]) > 1 {
                     break;
                 }
             }
         }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52140) panicked at crates/common/wchar/src/lib.rs:1252:17:
attempt to subtract with overflow

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
