*** crates/common/wchar/src/lib.rs:1252:21: replace -= with += in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with += in pg_utf8_verifystr
@@ -1244,17 +1244,17 @@
         pos = chunks.len() * STRIDE_LENGTH;
         // The error state persists, so it only needs one check, here.
         if state == ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;
         } else if state != END {
             // Fast path ended mid-sequence: back up to its lead byte.
             loop {
-                pos -= 1;
+                pos += /* ~ changed by cargo-mutants ~ */ 1;
                 if pg_utf_mblen_byte(s[pos]) > 1 {
                     break;
                 }
             }
         }
     }
     let mut rest = &s[pos..];
     while let Some((&b, tail)) = rest.split_first() {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52215) panicked at crates/common/wchar/src/lib.rs:1253:38:
index out of bounds: the len is 41 but the index is 41

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
