*** crates/common/wchar/src/lib.rs:1252:21: replace -= with /= in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with /= in pg_utf8_verifystr
@@ -1244,17 +1244,17 @@
         pos = chunks.len() * STRIDE_LENGTH;
         // The error state persists, so it only needs one check, here.
         if state == ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;
         } else if state != END {
             // Fast path ended mid-sequence: back up to its lead byte.
             loop {
-                pos -= 1;
+                pos /= /* ~ changed by cargo-mutants ~ */ 1;
                 if pg_utf_mblen_byte(s[pos]) > 1 {
                     break;
                 }
             }
         }
     }
     let mut rest = &s[pos..];
     while let Some((&b, tail)) = rest.split_first() {

*** result: Timeout
