*** crates/common/wchar/src/lib.rs:1253:46: replace > with == in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with == in pg_utf8_verifystr
@@ -1245,17 +1245,17 @@
         // The error state persists, so it only needs one check, here.
         if state == ERR {
             // Restart from the beginning so the slow path counts valid bytes.
             pos = 0;
         } else if state != END {
             // Fast path ended mid-sequence: back up to its lead byte.
             loop {
                 pos -= 1;
-                if pg_utf_mblen_byte(s[pos]) > 1 {
+                if pg_utf_mblen_byte(s[pos]) == /* ~ changed by cargo-mutants ~ */ 1 {
                     break;
                 }
             }
         }
     }
     let mut rest = &s[pos..];
     while let Some((&b, tail)) = rest.split_first() {
         if !is_highbit_set(b) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52287) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 53 enc 6
  left: 31
 right: 41

failures:
    verifystr_corpora_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
