*** crates/common/wchar/src/lib.rs:125:13: replace -= with /= in pg_ascii2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with /= in pg_ascii2wchar_with_len
@@ -117,17 +117,17 @@
 fn pg_ascii2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         to[ti] = from[fi] as pg_wchar;
         fi += 1;
         ti += 1;
-        len -= 1;
+        len /= /* ~ changed by cargo-mutants ~ */ 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_ascii_mblen(_s: &[u8]) -> i32 {
     1
 }

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (2551) panicked at crates/common/wchar/src/lib.rs:121:22:
index out of bounds: the len is 1 but the index is 1

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
