*** crates/common/wchar/src/lib.rs:1261:12: delete ! in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_utf8_verifystr
@@ -1253,17 +1253,17 @@
                 if pg_utf_mblen_byte(s[pos]) > 1 {
                     break;
                 }
             }
         }
     }
     let mut rest = &s[pos..];
     while let Some((&b, tail)) = rest.split_first() {
-        if !is_highbit_set(b) {
+        if  /* ~ changed by cargo-mutants ~ */is_highbit_set(b) {
             if b == 0 {
                 break;
             }
             rest = tail;
             continue;
         }
         let l = pg_utf8_verifychar(rest);
         if l == -1 {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52434) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 100 enc 6
  left: 2
 right: 0

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (52431) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 14411886002124716837
 right: 15767326444561765157

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (52432) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 6
  left: 11729534119165781396
 right: 14634591377994729748

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.76s

*** result: Failure(101)
