*** crates/common/wchar/src/lib.rs:1269:14: replace == with != in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_utf8_verifystr
@@ -1261,17 +1261,17 @@
         if !is_highbit_set(b) {
             if b == 0 {
                 break;
             }
             rest = tail;
             continue;
         }
         let l = pg_utf8_verifychar(rest);
-        if l == -1 {
+        if l != /* ~ changed by cargo-mutants ~ */ -1 {
             break;
         }
         rest = &rest[l as usize..];
     }
     (len - rest.len()) as i32
 }
 
 pub fn pg_utf8_islegal(source: &[u8], length: i32) -> bool {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52532) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 6
  left: 0
 right: 5

---- utf8_verify_3byte_exhaustive_matches_c stdout ----

thread 'utf8_verify_3byte_exhaustive_matches_c' (52528) panicked at crates/common/wchar/src/lib.rs:1272:21:
range start index 18446744073709551615 out of range for slice of length 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (52529) panicked at crates/common/wchar/src/lib.rs:1272:21:
range start index 18446744073709551615 out of range for slice of length 4

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
