*** crates/common/wchar/src/lib.rs:1274:10: replace - with / in pg_utf8_verifystr

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace - with / in pg_utf8_verifystr
@@ -1266,17 +1266,17 @@
             continue;
         }
         let l = pg_utf8_verifychar(rest);
         if l == -1 {
             break;
         }
         rest = &rest[l as usize..];
     }
-    (len - rest.len()) as i32
+    (len / /* ~ changed by cargo-mutants ~ */ rest.len()) as i32
 }
 
 pub fn pg_utf8_islegal(source: &[u8], length: i32) -> bool {
     match length {
         4 => {
             if !(0x80..=0xbf).contains(&source[3]) {
                 return false;
             }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52679) panicked at crates/common/wchar/src/lib.rs:1274:5:
attempt to divide by zero

---- utf8_verify_3byte_exhaustive_matches_c stdout ----

thread 'utf8_verify_3byte_exhaustive_matches_c' (52675) panicked at crates/common/wchar/src/lib.rs:1274:5:
attempt to divide by zero

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (52676) panicked at crates/common/wchar/src/lib.rs:1274:5:
attempt to divide by zero

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.82s

*** result: Failure(101)
