*** crates/common/wchar/src/lib.rs:1278:5: replace pg_utf8_islegal -> bool with false

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf8_islegal -> bool with false
@@ -1270,55 +1270,17 @@
             break;
         }
         rest = &rest[l as usize..];
     }
     (len - rest.len()) as i32
 }
 
 pub fn pg_utf8_islegal(source: &[u8], length: i32) -> bool {
-    match length {
-        4 => {
-            if !(0x80..=0xbf).contains(&source[3]) {
-                return false;
-            }
-            if !(0x80..=0xbf).contains(&source[2]) {
-                return false;
-            }
-            if !utf8_second_byte_legal(source[0], source[1]) {
-                return false;
-            }
-        }
-        3 => {
-            if !(0x80..=0xbf).contains(&source[2]) {
-                return false;
-            }
-            if !utf8_second_byte_legal(source[0], source[1]) {
-                return false;
-            }
-        }
-        2 => {
-            if !utf8_second_byte_legal(source[0], source[1]) {
-                return false;
-            }
-        }
-        1 => {}
-        // C (wchar.c pg_utf8_islegal) switch default: lengths outside 1..=4
-        // are illegal. Divergence found+fixed via proofs/utf8 out-of-contract
-        // harness (Rust used to fall through to the first-byte checks).
-        _ => return false,
-    }
-    let a = source[0];
-    if (0x80..0xc2).contains(&a) {
-        return false;
-    }
-    if a > 0xf4 {
-        return false;
-    }
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
     match b0 {
         0xe0 => (0xa0..=0xbf).contains(&a),
         0xed => (0x80..=0x9f).contains(&a),
         0xf0 => (0x90..=0xbf).contains(&a),

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (52777) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 6
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (52776) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 876162474495769381
 right: 8361214505092495653

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (52772) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 16862545358541249813
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.27s

*** result: Failure(101)
