*** crates/common/wchar/src/lib.rs:1283:16: delete ! in pg_utf8_islegal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_utf8_islegal
@@ -1275,17 +1275,17 @@
 }
 
 pub fn pg_utf8_islegal(source: &[u8], length: i32) -> bool {
     match length {
         4 => {
             if !(0x80..=0xbf).contains(&source[3]) {
                 return false;
             }
-            if !(0x80..=0xbf).contains(&source[2]) {
+            if  /* ~ changed by cargo-mutants ~ */(0x80..=0xbf).contains(&source[2]) {
                 return false;
             }
             if !utf8_second_byte_legal(source[0], source[1]) {
                 return false;
             }
         }
         3 => {
             if !(0x80..=0xbf).contains(&source[2]) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53071) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 6
  left: 0
 right: 5

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (53066) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 7861807754697838228
 right: 3252569362715540940

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (53068) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 12707921047141741349
 right: 15767326444561765157

failures:
    utf8_codepoint_walk_matches_c
    verify_quads_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
