*** crates/common/wchar/src/lib.rs:1291:16: delete ! in pg_utf8_islegal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_utf8_islegal
@@ -1283,17 +1283,17 @@
             if !(0x80..=0xbf).contains(&source[2]) {
                 return false;
             }
             if !utf8_second_byte_legal(source[0], source[1]) {
                 return false;
             }
         }
         3 => {
-            if !(0x80..=0xbf).contains(&source[2]) {
+            if  /* ~ changed by cargo-mutants ~ */(0x80..=0xbf).contains(&source[2]) {
                 return false;
             }
             if !utf8_second_byte_legal(source[0], source[1]) {
                 return false;
             }
         }
         2 => {
             if !utf8_second_byte_legal(source[0], source[1]) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53169) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 51 enc 6
  left: 0
 right: 3

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (53164) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 14016059272611423076
 right: 3252569362715540940

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (53166) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 4752693790156182309
 right: 15767326444561765157

failures:
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
