*** crates/common/wchar/src/lib.rs:1299:16: delete ! in pg_utf8_islegal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_utf8_islegal
@@ -1291,17 +1291,17 @@
             if !(0x80..=0xbf).contains(&source[2]) {
                 return false;
             }
             if !utf8_second_byte_legal(source[0], source[1]) {
                 return false;
             }
         }
         2 => {
-            if !utf8_second_byte_legal(source[0], source[1]) {
+            if  /* ~ changed by cargo-mutants ~ */utf8_second_byte_legal(source[0], source[1]) {
                 return false;
             }
         }
         1 => {}
         // C (wchar.c pg_utf8_islegal) switch default: lengths outside 1..=4
         // are illegal. Divergence found+fixed via proofs/utf8 out-of-contract
         // harness (Rust used to fall through to the first-byte checks).
         _ => return false,

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53267) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 37 enc 6
  left: 0
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (53266) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 15679801499944432933
 right: 8361214505092495653

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (53262) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 2954391198460107124
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.86s

*** result: Failure(101)
