*** crates/common/wchar/src/lib.rs:1303:9: delete match arm 1 in pg_utf8_islegal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete match arm 1 in pg_utf8_islegal
@@ -1295,17 +1295,17 @@
                 return false;
             }
         }
         2 => {
             if !utf8_second_byte_legal(source[0], source[1]) {
                 return false;
             }
         }
-        1 => {}
+         /* ~ changed by cargo-mutants ~ */
         // C (wchar.c pg_utf8_islegal) switch default: lengths outside 1..=4
         // are illegal. Divergence found+fixed via proofs/utf8 out-of-contract
         // harness (Rust used to fall through to the first-byte checks).
         _ => return false,
     }
     let a = source[0];
     if (0x80..0xc2).contains(&a) {
         return false;

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (52968) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 7614013994945829485
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
