*** crates/common/wchar/src/lib.rs:1313:10: replace > with == in pg_utf8_islegal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with == in pg_utf8_islegal
@@ -1305,17 +1305,17 @@
         // are illegal. Divergence found+fixed via proofs/utf8 out-of-contract
         // harness (Rust used to fall through to the first-byte checks).
         _ => return false,
     }
     let a = source[0];
     if (0x80..0xc2).contains(&a) {
         return false;
     }
-    if a > 0xf4 {
+    if a == /* ~ changed by cargo-mutants ~ */ 0xf4 {
         return false;
     }
     true
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
     match b0 {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53316) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 6
  left: 12
 right: 16

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (53315) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 2023724983104764197
 right: 8361214505092495653

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (53311) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 14167223830972114380
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.61s

*** result: Failure(101)
