*** crates/common/wchar/src/lib.rs:1321:5: replace utf8_second_byte_legal -> bool with true

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace utf8_second_byte_legal -> bool with true
@@ -1313,23 +1313,17 @@
     if a > 0xf4 {
         return false;
     }
     true
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
-    match b0 {
-        0xe0 => (0xa0..=0xbf).contains(&a),
-        0xed => (0x80..=0x9f).contains(&a),
-        0xf0 => (0x90..=0xbf).contains(&a),
-        0xf4 => (0x80..=0x8f).contains(&a),
-        _ => (0x80..=0xbf).contains(&a),
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes
 /// and `encoding` must be multibyte (C asserts).
 pub fn pg_encoding_set_invalid(encoding: i32, dst: &mut [u8]) {
     debug_assert!(pg_encoding_max_length(encoding) > 1);
     dst[0] = if encoding == PG_UTF8 {
         0xc0

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53463) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 116 enc 6
  left: 3
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (53462) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 6
  left: 4718109456831607589
 right: 8361214505092495653

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (53458) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 18197288524106082764
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
