*** crates/common/wchar/src/lib.rs:1322:9: delete match arm 0xe0 in utf8_second_byte_legal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete match arm 0xe0 in utf8_second_byte_legal
@@ -1314,17 +1314,17 @@
         return false;
     }
     true
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
     match b0 {
-        0xe0 => (0xa0..=0xbf).contains(&a),
+         /* ~ changed by cargo-mutants ~ */
         0xed => (0x80..=0x9f).contains(&a),
         0xf0 => (0x90..=0xbf).contains(&a),
         0xf4 => (0x80..=0x8f).contains(&a),
         _ => (0x80..=0xbf).contains(&a),
     }
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53561) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 116 enc 6
  left: 3
 right: 0

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (53558) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 3240280495405638437
 right: 15767326444561765157

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (53559) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 6
  left: 15178823591738136596
 right: 14634591377994729748

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
