*** crates/common/wchar/src/lib.rs:1323:9: delete match arm 0xed in utf8_second_byte_legal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete match arm 0xed in utf8_second_byte_legal
@@ -1315,17 +1315,17 @@
     }
     true
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
     match b0 {
         0xe0 => (0xa0..=0xbf).contains(&a),
-        0xed => (0x80..=0x9f).contains(&a),
+         /* ~ changed by cargo-mutants ~ */
         0xf0 => (0x90..=0xbf).contains(&a),
         0xf4 => (0x80..=0x8f).contains(&a),
         _ => (0x80..=0xbf).contains(&a),
     }
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes
 /// and `encoding` must be multibyte (C asserts).

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53610) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 148 enc 6
  left: 3
 right: 0

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (53605) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 18197288524106082764
 right: 3252569362715540940

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (53607) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 2049442365600932645
 right: 15767326444561765157

failures:
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
