*** crates/common/wchar/src/lib.rs:1324:9: delete match arm 0xf0 in utf8_second_byte_legal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete match arm 0xf0 in utf8_second_byte_legal
@@ -1316,17 +1316,17 @@
     true
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
     match b0 {
         0xe0 => (0xa0..=0xbf).contains(&a),
         0xed => (0x80..=0x9f).contains(&a),
-        0xf0 => (0x90..=0xbf).contains(&a),
+         /* ~ changed by cargo-mutants ~ */
         0xf4 => (0x80..=0x8f).contains(&a),
         _ => (0x80..=0xbf).contains(&a),
     }
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes
 /// and `encoding` must be multibyte (C asserts).
 pub fn pg_encoding_set_invalid(encoding: i32, dst: &mut [u8]) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53659) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 132 enc 6
  left: 4
 right: 0

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (53656) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 11702536853521673509
 right: 15767326444561765157

failures:
    verify_quads_match_c
    verifystr_corpora_match_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
