*** crates/common/wchar/src/lib.rs:1325:9: delete match arm 0xf4 in utf8_second_byte_legal

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete match arm 0xf4 in utf8_second_byte_legal
@@ -1317,17 +1317,17 @@
 }
 
 #[inline(always)]
 fn utf8_second_byte_legal(b0: u8, a: u8) -> bool {
     match b0 {
         0xe0 => (0xa0..=0xbf).contains(&a),
         0xed => (0x80..=0x9f).contains(&a),
         0xf0 => (0x90..=0xbf).contains(&a),
-        0xf4 => (0x80..=0x8f).contains(&a),
+         /* ~ changed by cargo-mutants ~ */
         _ => (0x80..=0xbf).contains(&a),
     }
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes
 /// and `encoding` must be multibyte (C asserts).
 pub fn pg_encoding_set_invalid(encoding: i32, dst: &mut [u8]) {
     debug_assert!(pg_encoding_max_length(encoding) > 1);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (53708) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 180 enc 6
  left: 4
 right: 0

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (53705) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 6
  left: 1405122386541863205
 right: 15767326444561765157

failures:
    verify_quads_match_c
    verifystr_corpora_match_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
