*** crates/common/wchar/src/lib.rs:132:5: replace pg_ascii_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_ascii_mblen -> i32 with 0
@@ -124,17 +124,17 @@
         ti += 1;
         len -= 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_ascii_mblen(_s: &[u8]) -> i32 {
-    1
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_ascii_dsplen(s: &[u8]) -> i32 {
     let c = s[0];
     if c == 0 {
         0
     } else if c < 0x20 || c == 0x7f {
         -1

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (2641) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 0 b 0
  left: 0
 right: 1

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
