*** crates/common/wchar/src/lib.rs:1333:5: replace pg_encoding_set_invalid with ()

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_set_invalid with ()
@@ -1325,23 +1325,17 @@
         0xf4 => (0x80..=0x8f).contains(&a),
         _ => (0x80..=0xbf).contains(&a),
     }
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes
 /// and `encoding` must be multibyte (C asserts).
 pub fn pg_encoding_set_invalid(encoding: i32, dst: &mut [u8]) {
-    debug_assert!(pg_encoding_max_length(encoding) > 1);
-    dst[0] = if encoding == PG_UTF8 {
-        0xc0
-    } else {
-        NONUTF8_INVALID_BYTE0
-    };
-    dst[1] = NONUTF8_INVALID_BYTE1;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn table_index(encoding: i32) -> usize {
     if pg_valid_encoding(encoding) {
         encoding as usize
     } else {
         PG_SQL_ASCII as usize

---- set_invalid_matches_c stdout ----

thread 'set_invalid_matches_c' (53751) panicked at crates/common/wchar/tests/c_parity.rs:231:5:
assertion `left == right` failed
  left: [0, 0]
 right: [192, 32]

failures:
    set_invalid_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.28s

*** result: Failure(101)
