*** crates/common/wchar/src/lib.rs:1334:26: replace == with != in pg_encoding_set_invalid

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_encoding_set_invalid
@@ -1326,17 +1326,17 @@
         _ => (0x80..=0xbf).contains(&a),
     }
 }
 
 /// Writes the two-byte "invalid character" marker; `dst` must hold two bytes
 /// and `encoding` must be multibyte (C asserts).
 pub fn pg_encoding_set_invalid(encoding: i32, dst: &mut [u8]) {
     debug_assert!(pg_encoding_max_length(encoding) > 1);
-    dst[0] = if encoding == PG_UTF8 {
+    dst[0] = if encoding != /* ~ changed by cargo-mutants ~ */ PG_UTF8 {
         0xc0
     } else {
         NONUTF8_INVALID_BYTE0
     };
     dst[1] = NONUTF8_INVALID_BYTE1;
 }
 
 #[inline(always)]

---- set_invalid_matches_c stdout ----

thread 'set_invalid_matches_c' (53800) panicked at crates/common/wchar/tests/c_parity.rs:231:5:
assertion `left == right` failed
  left: [141, 32]
 right: [192, 32]

failures:
    set_invalid_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
