*** crates/common/wchar/src/lib.rs:1344:5: replace table_index -> usize with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace table_index -> usize with 0
@@ -1336,21 +1336,17 @@
     } else {
         NONUTF8_INVALID_BYTE0
     };
     dst[1] = NONUTF8_INVALID_BYTE1;
 }
 
 #[inline(always)]
 fn table_index(encoding: i32) -> usize {
-    if pg_valid_encoding(encoding) {
-        encoding as usize
-    } else {
-        PG_SQL_ASCII as usize
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_mblen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mblen)(mbstr)
 }
 
 pub fn pg_encoding_mblen_or_incomplete(encoding: i32, mbstr: &[u8]) -> i32 {
     if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() < 2)

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (53844) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 1 b 128
  left: 1
 right: 2

---- max_length_matches_c stdout ----

thread 'max_length_matches_c' (53845) panicked at crates/common/wchar/tests/c_parity.rs:25:9:
assertion `left == right` failed: enc 1
  left: 1
 right: 3

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (53847) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 1 b 128
  left: 1
 right: 2

failures:
    dsplen_tables_match_c
    max_length_matches_c
    mblen_tables_match_c
    or_incomplete_edge_cases
    set_invalid_matches_c
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 2 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.58s

*** result: Failure(101)
