*** crates/common/wchar/src/lib.rs:1352:5: replace pg_encoding_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_mblen -> i32 with 0
@@ -1344,17 +1344,17 @@
     if pg_valid_encoding(encoding) {
         encoding as usize
     } else {
         PG_SQL_ASCII as usize
     }
 }
 
 pub fn pg_encoding_mblen(encoding: i32, mbstr: &[u8]) -> i32 {
-    (pg_wchar_table[table_index(encoding)].mblen)(mbstr)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_mblen_or_incomplete(encoding: i32, mbstr: &[u8]) -> i32 {
     if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() < 2)
     {
         return i32::MAX;
     }
     pg_encoding_mblen(encoding, mbstr)

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (53945) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 0 b 0
  left: 0
 right: 1

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (53946) panicked at crates/common/wchar/tests/c_parity.rs:240:5:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    mblen_tables_match_c
    or_incomplete_edge_cases

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
