*** crates/common/wchar/src/lib.rs:1356:5: replace pg_encoding_mblen_or_incomplete -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_mblen_or_incomplete -> i32 with 1
@@ -1348,21 +1348,17 @@
     }
 }
 
 pub fn pg_encoding_mblen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mblen)(mbstr)
 }
 
 pub fn pg_encoding_mblen_or_incomplete(encoding: i32, mbstr: &[u8]) -> i32 {
-    if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() < 2)
-    {
-        return i32::MAX;
-    }
-    pg_encoding_mblen(encoding, mbstr)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_mblen_bounded(encoding: i32, mbstr: &[u8]) -> i32 {
     let mblen = pg_encoding_mblen(encoding, mbstr) as usize;
     match mbstr[..mblen.min(mbstr.len())].iter().position(|&b| b == 0) {
         Some(p) => p as i32,
         None => mblen as i32,
     }

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (54142) panicked at crates/common/wchar/tests/c_parity.rs:238:5:
assertion `left == right` failed
  left: 1
 right: 2147483647

failures:
    or_incomplete_edge_cases

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
