*** crates/common/wchar/src/lib.rs:1356:80: replace && with || in pg_encoding_mblen_or_incomplete

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace && with || in pg_encoding_mblen_or_incomplete
@@ -1348,17 +1348,17 @@
     }
 }
 
 pub fn pg_encoding_mblen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mblen)(mbstr)
 }
 
 pub fn pg_encoding_mblen_or_incomplete(encoding: i32, mbstr: &[u8]) -> i32 {
-    if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() < 2)
+    if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) || /* ~ changed by cargo-mutants ~ */ mbstr.len() < 2)
     {
         return i32::MAX;
     }
     pg_encoding_mblen(encoding, mbstr)
 }
 
 pub fn pg_encoding_mblen_bounded(encoding: i32, mbstr: &[u8]) -> i32 {
     let mblen = pg_encoding_mblen(encoding, mbstr) as usize;

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (54289) panicked at crates/common/wchar/tests/c_parity.rs:240:5:
assertion `left == right` failed
  left: 2147483647
 right: 4

failures:
    or_incomplete_edge_cases

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
