*** crates/common/wchar/src/lib.rs:1356:95: replace < with > in pg_encoding_mblen_or_incomplete

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_encoding_mblen_or_incomplete
@@ -1348,17 +1348,17 @@
     }
 }
 
 pub fn pg_encoding_mblen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mblen)(mbstr)
 }
 
 pub fn pg_encoding_mblen_or_incomplete(encoding: i32, mbstr: &[u8]) -> i32 {
-    if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() < 2)
+    if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() > /* ~ changed by cargo-mutants ~ */ 2)
     {
         return i32::MAX;
     }
     pg_encoding_mblen(encoding, mbstr)
 }
 
 pub fn pg_encoding_mblen_bounded(encoding: i32, mbstr: &[u8]) -> i32 {
     let mblen = pg_encoding_mblen(encoding, mbstr) as usize;

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (54485) panicked at crates/common/wchar/src/lib.rs:817:39:
index out of bounds: the len is 1 but the index is 1

failures:
    or_incomplete_edge_cases

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
