*** crates/common/wchar/src/lib.rs:1364:5: replace pg_encoding_mblen_bounded -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_mblen_bounded -> i32 with 1
@@ -1356,21 +1356,17 @@
     if mbstr.is_empty() || (encoding == PG_GB18030 && is_highbit_set(mbstr[0]) && mbstr.len() < 2)
     {
         return i32::MAX;
     }
     pg_encoding_mblen(encoding, mbstr)
 }
 
 pub fn pg_encoding_mblen_bounded(encoding: i32, mbstr: &[u8]) -> i32 {
-    let mblen = pg_encoding_mblen(encoding, mbstr) as usize;
-    match mbstr[..mblen.min(mbstr.len())].iter().position(|&b| b == 0) {
-        Some(p) => p as i32,
-        None => mblen as i32,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_dsplen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].dsplen)(mbstr)
 }
 
 pub fn pg_encoding_verifymbchar(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifychar)(mbstr)

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (54631) panicked at crates/common/wchar/tests/c_parity.rs:46:13:
assertion `left == right` failed: enc 0 b 0
  left: 1
 right: 0

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
