*** crates/common/wchar/src/lib.rs:1365:66: replace == with != in pg_encoding_mblen_bounded

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_encoding_mblen_bounded
@@ -1357,17 +1357,17 @@
     {
         return i32::MAX;
     }
     pg_encoding_mblen(encoding, mbstr)
 }
 
 pub fn pg_encoding_mblen_bounded(encoding: i32, mbstr: &[u8]) -> i32 {
     let mblen = pg_encoding_mblen(encoding, mbstr) as usize;
-    match mbstr[..mblen.min(mbstr.len())].iter().position(|&b| b == 0) {
+    match mbstr[..mblen.min(mbstr.len())].iter().position(|&b| b != /* ~ changed by cargo-mutants ~ */ 0) {
         Some(p) => p as i32,
         None => mblen as i32,
     }
 }
 
 pub fn pg_encoding_dsplen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].dsplen)(mbstr)
 }

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (54729) panicked at crates/common/wchar/tests/c_parity.rs:46:13:
assertion `left == right` failed: enc 0 b 0
  left: 1
 right: 0

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
