*** crates/common/wchar/src/lib.rs:136:5: replace pg_ascii_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_ascii_dsplen -> i32 with 1
@@ -128,24 +128,17 @@
     ti as i32
 }
 
 fn pg_ascii_mblen(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_ascii_dsplen(s: &[u8]) -> i32 {
-    let c = s[0];
-    if c == 0 {
-        0
-    } else if c < 0x20 || c == 0x7f {
-        -1
-    } else {
-        1
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euc2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (2745) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 0 b 0
  left: 1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
