*** crates/common/wchar/src/lib.rs:1372:5: replace pg_encoding_dsplen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_dsplen -> i32 with -1
@@ -1364,17 +1364,17 @@
     let mblen = pg_encoding_mblen(encoding, mbstr) as usize;
     match mbstr[..mblen.min(mbstr.len())].iter().position(|&b| b == 0) {
         Some(p) => p as i32,
         None => mblen as i32,
     }
 }
 
 pub fn pg_encoding_dsplen(encoding: i32, mbstr: &[u8]) -> i32 {
-    (pg_wchar_table[table_index(encoding)].dsplen)(mbstr)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_verifymbchar(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifychar)(mbstr)
 }
 
 pub fn pg_encoding_verifymbstr(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifystr)(mbstr)

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (54873) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 0 b 0
  left: -1
 right: 0

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (54879) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 16226540275744505561
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
