*** crates/common/wchar/src/lib.rs:1376:5: replace pg_encoding_verifymbchar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_verifymbchar -> i32 with 0
@@ -1368,17 +1368,17 @@
     }
 }
 
 pub fn pg_encoding_dsplen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].dsplen)(mbstr)
 }
 
 pub fn pg_encoding_verifymbchar(encoding: i32, mbstr: &[u8]) -> i32 {
-    (pg_wchar_table[table_index(encoding)].mbverifychar)(mbstr)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_verifymbstr(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifystr)(mbstr)
 }
 
 pub fn pg_encoding_max_length(encoding: i32) -> i32 {
     debug_assert!(pg_valid_encoding(encoding));

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (54932) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 0
  left: 18172517032833196837
 right: 1677996718092854053

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (54930) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 0
  left: 717662651402036005
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (54931) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 0
  left: 15813227603212837044
 right: 11667988157482215828

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.15s

*** result: Failure(101)
