*** crates/common/wchar/src/lib.rs:1376:5: replace pg_encoding_verifymbchar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_verifymbchar -> i32 with 1
@@ -1368,17 +1368,17 @@
     }
 }
 
 pub fn pg_encoding_dsplen(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].dsplen)(mbstr)
 }
 
 pub fn pg_encoding_verifymbchar(encoding: i32, mbstr: &[u8]) -> i32 {
-    (pg_wchar_table[table_index(encoding)].mbverifychar)(mbstr)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_verifymbstr(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifystr)(mbstr)
 }
 
 pub fn pg_encoding_max_length(encoding: i32) -> i32 {
     debug_assert!(pg_valid_encoding(encoding));

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (55046) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 1677996718092854053
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (55044) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 4945540859879366066
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (55045) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 16695286687103155911
 right: 2498594579922710343

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.15s

*** result: Failure(101)
