*** crates/common/wchar/src/lib.rs:137:10: replace == with != in pg_ascii_dsplen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_ascii_dsplen
@@ -129,17 +129,17 @@
 }
 
 fn pg_ascii_mblen(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_ascii_dsplen(s: &[u8]) -> i32 {
     let c = s[0];
-    if c == 0 {
+    if c != /* ~ changed by cargo-mutants ~ */ 0 {
         0
     } else if c < 0x20 || c == 0x7f {
         -1
     } else {
         1
     }
 }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (2832) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 0 b 0
  left: -1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
