*** crates/common/wchar/src/lib.rs:1380:5: replace pg_encoding_verifymbstr -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_verifymbstr -> i32 with 0
@@ -1372,17 +1372,17 @@
     (pg_wchar_table[table_index(encoding)].dsplen)(mbstr)
 }
 
 pub fn pg_encoding_verifymbchar(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifychar)(mbstr)
 }
 
 pub fn pg_encoding_verifymbstr(encoding: i32, mbstr: &[u8]) -> i32 {
-    (pg_wchar_table[table_index(encoding)].mbverifystr)(mbstr)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_encoding_max_length(encoding: i32) -> i32 {
     debug_assert!(pg_valid_encoding(encoding));
     pg_wchar_table[table_index(encoding)].maxmblen
 }
 
 pub const fn is_valid_unicode_codepoint(c: pg_wchar) -> bool {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (55080) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 0
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (55077) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 0
  left: 5794005156280541989
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (55078) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 0
  left: 4196782767312347941
 right: 11667988157482215828

failures:
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.46s

*** result: Failure(101)
