*** crates/common/wchar/src/lib.rs:1384:5: replace pg_encoding_max_length -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_encoding_max_length -> i32 with -1
@@ -1376,18 +1376,17 @@
     (pg_wchar_table[table_index(encoding)].mbverifychar)(mbstr)
 }
 
 pub fn pg_encoding_verifymbstr(encoding: i32, mbstr: &[u8]) -> i32 {
     (pg_wchar_table[table_index(encoding)].mbverifystr)(mbstr)
 }
 
 pub fn pg_encoding_max_length(encoding: i32) -> i32 {
-    debug_assert!(pg_valid_encoding(encoding));
-    pg_wchar_table[table_index(encoding)].maxmblen
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub const fn is_valid_unicode_codepoint(c: pg_wchar) -> bool {
     c > 0 && c <= 0x10ffff
 }
 
 pub const fn is_utf16_surrogate_first(c: pg_wchar) -> bool {
     c >= 0xd800 && c <= 0xdbff

---- max_length_matches_c stdout ----

thread 'max_length_matches_c' (55302) panicked at crates/common/wchar/tests/c_parity.rs:25:9:
assertion `left == right` failed: enc 0
  left: -1
 right: 1

---- set_invalid_matches_c stdout ----

thread 'set_invalid_matches_c' (55306) panicked at crates/common/wchar/src/lib.rs:1333:5:
assertion failed: pg_encoding_max_length(encoding) > 1

failures:
    max_length_matches_c
    set_invalid_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
