*** crates/common/wchar/src/lib.rs:1389:5: replace is_valid_unicode_codepoint -> bool with false

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_valid_unicode_codepoint -> bool with false
@@ -1381,17 +1381,17 @@
 }
 
 pub fn pg_encoding_max_length(encoding: i32) -> i32 {
     debug_assert!(pg_valid_encoding(encoding));
     pg_wchar_table[table_index(encoding)].maxmblen
 }
 
 pub const fn is_valid_unicode_codepoint(c: pg_wchar) -> bool {
-    c > 0 && c <= 0x10ffff
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 pub const fn is_utf16_surrogate_first(c: pg_wchar) -> bool {
     c >= 0xd800 && c <= 0xdbff
 }
 
 pub const fn is_utf16_surrogate_second(c: pg_wchar) -> bool {
     c >= 0xdc00 && c <= 0xdfff

*** result: Success
