*** crates/common/wchar/src/lib.rs:139:17: replace < with <= in pg_ascii_dsplen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_ascii_dsplen
@@ -131,17 +131,17 @@
 fn pg_ascii_mblen(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_ascii_dsplen(s: &[u8]) -> i32 {
     let c = s[0];
     if c == 0 {
         0
-    } else if c < 0x20 || c == 0x7f {
+    } else if c <= /* ~ changed by cargo-mutants ~ */ 0x20 || c == 0x7f {
         -1
     } else {
         1
     }
 }
 
 fn pg_euc2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (3027) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 0 b 32
  left: -1
 right: 1

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
