*** crates/common/wchar/src/lib.rs:1401:29: replace + with * in surrogate_pair_to_codepoint

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace + with * in surrogate_pair_to_codepoint
@@ -1393,17 +1393,17 @@
     c >= 0xd800 && c <= 0xdbff
 }
 
 pub const fn is_utf16_surrogate_second(c: pg_wchar) -> bool {
     c >= 0xdc00 && c <= 0xdfff
 }
 
 pub const fn surrogate_pair_to_codepoint(first: pg_wchar, second: pg_wchar) -> pg_wchar {
-    ((first & 0x3ff) << 10) + 0x10000 + (second & 0x3ff)
+    ((first & 0x3ff) << 10) * /* ~ changed by cargo-mutants ~ */ 0x10000 + (second & 0x3ff)
 }
 
 /// `c` must hold a complete sequence (C reads the trailing bytes unchecked).
 #[inline]
 pub fn utf8_to_unicode(c: &[u8]) -> pg_wchar {
     let b0 = c[0];
     if b0 & 0x80 == 0 {
         b0 as pg_wchar

*** result: Success
