*** crates/common/wchar/src/lib.rs:1407:5: replace utf8_to_unicode -> pg_wchar with Default::default()

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace utf8_to_unicode -> pg_wchar with Default::default()
@@ -1399,31 +1399,17 @@
 
 pub const fn surrogate_pair_to_codepoint(first: pg_wchar, second: pg_wchar) -> pg_wchar {
     ((first & 0x3ff) << 10) + 0x10000 + (second & 0x3ff)
 }
 
 /// `c` must hold a complete sequence (C reads the trailing bytes unchecked).
 #[inline]
 pub fn utf8_to_unicode(c: &[u8]) -> pg_wchar {
-    let b0 = c[0];
-    if b0 & 0x80 == 0 {
-        b0 as pg_wchar
-    } else if b0 & 0xe0 == 0xc0 {
-        (((b0 & 0x1f) as u32) << 6) | (c[1] & 0x3f) as u32
-    } else if b0 & 0xf0 == 0xe0 {
-        (((b0 & 0x0f) as u32) << 12) | (((c[1] & 0x3f) as u32) << 6) | (c[2] & 0x3f) as u32
-    } else if b0 & 0xf8 == 0xf0 {
-        (((b0 & 0x07) as u32) << 18)
-            | (((c[1] & 0x3f) as u32) << 12)
-            | (((c[2] & 0x3f) as u32) << 6)
-            | (c[3] & 0x3f) as u32
-    } else {
-        0xffffffff
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// `utf8string` must hold `unicode_utf8len(c)` bytes.
 #[inline]
 pub fn unicode_to_utf8(c: pg_wchar, utf8string: &mut [u8]) {
     if c <= 0x7f {
         utf8string[0] = c as u8;
     } else if c <= 0x7ff {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (56750) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 1
  left: 0
 right: -1

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (56756) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 15595079407063335797
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.21s

*** result: Failure(101)
