*** crates/common/wchar/src/lib.rs:140:9: delete - in pg_ascii_dsplen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_ascii_dsplen
@@ -132,17 +132,17 @@
     1
 }
 
 fn pg_ascii_dsplen(s: &[u8]) -> i32 {
     let c = s[0];
     if c == 0 {
         0
     } else if c < 0x20 || c == 0x7f {
-        -1
+         /* ~ changed by cargo-mutants ~ */1
     } else {
         1
     }
 }
 
 fn pg_euc2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (3135) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 0 b 1
  left: 1
 right: -1

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
