*** crates/common/wchar/src/lib.rs:1414:25: replace == with != in utf8_to_unicode

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in utf8_to_unicode
@@ -1406,17 +1406,17 @@
 pub fn utf8_to_unicode(c: &[u8]) -> pg_wchar {
     let b0 = c[0];
     if b0 & 0x80 == 0 {
         b0 as pg_wchar
     } else if b0 & 0xe0 == 0xc0 {
         (((b0 & 0x1f) as u32) << 6) | (c[1] & 0x3f) as u32
     } else if b0 & 0xf0 == 0xe0 {
         (((b0 & 0x0f) as u32) << 12) | (((c[1] & 0x3f) as u32) << 6) | (c[2] & 0x3f) as u32
-    } else if b0 & 0xf8 == 0xf0 {
+    } else if b0 & 0xf8 != /* ~ changed by cargo-mutants ~ */ 0xf0 {
         (((b0 & 0x07) as u32) << 18)
             | (((c[1] & 0x3f) as u32) << 12)
             | (((c[2] & 0x3f) as u32) << 6)
             | (c[3] & 0x3f) as u32
     } else {
         0xffffffff
     }
 }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (58190) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 128
  left: 2
 right: -1

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (58196) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 6386491590019535496
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
