*** crates/common/wchar/src/lib.rs:1416:13: replace | with & in utf8_to_unicode

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with & in utf8_to_unicode
@@ -1408,17 +1408,17 @@
     if b0 & 0x80 == 0 {
         b0 as pg_wchar
     } else if b0 & 0xe0 == 0xc0 {
         (((b0 & 0x1f) as u32) << 6) | (c[1] & 0x3f) as u32
     } else if b0 & 0xf0 == 0xe0 {
         (((b0 & 0x0f) as u32) << 12) | (((c[1] & 0x3f) as u32) << 6) | (c[2] & 0x3f) as u32
     } else if b0 & 0xf8 == 0xf0 {
         (((b0 & 0x07) as u32) << 18)
-            | (((c[1] & 0x3f) as u32) << 12)
+            & /* ~ changed by cargo-mutants ~ */ (((c[1] & 0x3f) as u32) << 12)
             | (((c[2] & 0x3f) as u32) << 6)
             | (c[3] & 0x3f) as u32
     } else {
         0xffffffff
     }
 }
 
 /// `utf8string` must hold `unicode_utf8len(c)` bytes.

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (58530) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 240
  left: 0
 right: 2

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (58536) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 2725858881264671368
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
