*** crates/common/wchar/src/lib.rs:1417:23: replace & with ^ in utf8_to_unicode

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in utf8_to_unicode
@@ -1409,17 +1409,17 @@
         b0 as pg_wchar
     } else if b0 & 0xe0 == 0xc0 {
         (((b0 & 0x1f) as u32) << 6) | (c[1] & 0x3f) as u32
     } else if b0 & 0xf0 == 0xe0 {
         (((b0 & 0x0f) as u32) << 12) | (((c[1] & 0x3f) as u32) << 6) | (c[2] & 0x3f) as u32
     } else if b0 & 0xf8 == 0xf0 {
         (((b0 & 0x07) as u32) << 18)
             | (((c[1] & 0x3f) as u32) << 12)
-            | (((c[2] & 0x3f) as u32) << 6)
+            | (((c[2] ^ /* ~ changed by cargo-mutants ~ */ 0x3f) as u32) << 6)
             | (c[3] & 0x3f) as u32
     } else {
         0xffffffff
     }
 }
 
 /// `utf8string` must hold `unicode_utf8len(c)` bytes.
 #[inline]

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (59005) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 595784826007201040
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
