*** crates/common/wchar/src/lib.rs:1418:13: replace | with ^ in utf8_to_unicode

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with ^ in utf8_to_unicode
@@ -1410,17 +1410,17 @@
     } else if b0 & 0xe0 == 0xc0 {
         (((b0 & 0x1f) as u32) << 6) | (c[1] & 0x3f) as u32
     } else if b0 & 0xf0 == 0xe0 {
         (((b0 & 0x0f) as u32) << 12) | (((c[1] & 0x3f) as u32) << 6) | (c[2] & 0x3f) as u32
     } else if b0 & 0xf8 == 0xf0 {
         (((b0 & 0x07) as u32) << 18)
             | (((c[1] & 0x3f) as u32) << 12)
             | (((c[2] & 0x3f) as u32) << 6)
-            | (c[3] & 0x3f) as u32
+            ^ /* ~ changed by cargo-mutants ~ */ (c[3] & 0x3f) as u32
     } else {
         0xffffffff
     }
 }
 
 /// `utf8string` must hold `unicode_utf8len(c)` bytes.
 #[inline]
 pub fn unicode_to_utf8(c: pg_wchar, utf8string: &mut [u8]) {

*** result: Success
