*** crates/common/wchar/src/lib.rs:1427:10: replace <= with > in unicode_to_utf8

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace <= with > in unicode_to_utf8
@@ -1419,17 +1419,17 @@
     } else {
         0xffffffff
     }
 }
 
 /// `utf8string` must hold `unicode_utf8len(c)` bytes.
 #[inline]
 pub fn unicode_to_utf8(c: pg_wchar, utf8string: &mut [u8]) {
-    if c <= 0x7f {
+    if c > /* ~ changed by cargo-mutants ~ */ 0x7f {
         utf8string[0] = c as u8;
     } else if c <= 0x7ff {
         utf8string[0] = 0xc0 | ((c >> 6) & 0x1f) as u8;
         utf8string[1] = 0x80 | (c & 0x3f) as u8;
     } else if c <= 0xffff {
         utf8string[0] = 0xe0 | ((c >> 12) & 0x0f) as u8;
         utf8string[1] = 0x80 | ((c >> 6) & 0x3f) as u8;
         utf8string[2] = 0x80 | (c & 0x3f) as u8;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (59207) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 8780904538561602585
 right: 1083083656248983483

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (59201) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 7893976665373763015
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c
    wchar2mb_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
