*** crates/common/wchar/src/lib.rs:1438:30: replace | with ^ in unicode_to_utf8

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with ^ in unicode_to_utf8
@@ -1430,17 +1430,17 @@
         utf8string[0] = 0xc0 | ((c >> 6) & 0x1f) as u8;
         utf8string[1] = 0x80 | (c & 0x3f) as u8;
     } else if c <= 0xffff {
         utf8string[0] = 0xe0 | ((c >> 12) & 0x0f) as u8;
         utf8string[1] = 0x80 | ((c >> 6) & 0x3f) as u8;
         utf8string[2] = 0x80 | (c & 0x3f) as u8;
     } else {
         utf8string[0] = 0xf0 | ((c >> 18) & 0x07) as u8;
-        utf8string[1] = 0x80 | ((c >> 12) & 0x3f) as u8;
+        utf8string[1] = 0x80 ^ /* ~ changed by cargo-mutants ~ */ ((c >> 12) & 0x3f) as u8;
         utf8string[2] = 0x80 | ((c >> 6) & 0x3f) as u8;
         utf8string[3] = 0x80 | (c & 0x3f) as u8;
     }
 }
 
 pub const fn unicode_utf8len(c: pg_wchar) -> i32 {
     if c <= 0x7f {
         1

*** result: Success
