*** crates/common/wchar/src/lib.rs:1440:35: replace & with | in unicode_to_utf8

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with | in unicode_to_utf8
@@ -1432,17 +1432,17 @@
     } else if c <= 0xffff {
         utf8string[0] = 0xe0 | ((c >> 12) & 0x0f) as u8;
         utf8string[1] = 0x80 | ((c >> 6) & 0x3f) as u8;
         utf8string[2] = 0x80 | (c & 0x3f) as u8;
     } else {
         utf8string[0] = 0xf0 | ((c >> 18) & 0x07) as u8;
         utf8string[1] = 0x80 | ((c >> 12) & 0x3f) as u8;
         utf8string[2] = 0x80 | ((c >> 6) & 0x3f) as u8;
-        utf8string[3] = 0x80 | (c & 0x3f) as u8;
+        utf8string[3] = 0x80 | (c | /* ~ changed by cargo-mutants ~ */ 0x3f) as u8;
     }
 }
 
 pub const fn unicode_utf8len(c: pg_wchar) -> i32 {
     if c <= 0x7f {
         1
     } else if c <= 0x7ff {
         2

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (61370) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 9112872395784686083
 right: 1083083656248983483

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (61364) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 13077258462158758792
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c
    wchar2mb_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
