*** crates/common/wchar/src/lib.rs:1445:10: replace <= with > in unicode_utf8len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace <= with > in unicode_utf8len
@@ -1437,17 +1437,17 @@
         utf8string[0] = 0xf0 | ((c >> 18) & 0x07) as u8;
         utf8string[1] = 0x80 | ((c >> 12) & 0x3f) as u8;
         utf8string[2] = 0x80 | ((c >> 6) & 0x3f) as u8;
         utf8string[3] = 0x80 | (c & 0x3f) as u8;
     }
 }
 
 pub const fn unicode_utf8len(c: pg_wchar) -> i32 {
-    if c <= 0x7f {
+    if c > /* ~ changed by cargo-mutants ~ */ 0x7f {
         1
     } else if c <= 0x7ff {
         2
     } else if c <= 0xffff {
         3
     } else {
         4
     }

*** result: Success
