*** crates/common/wchar/src/lib.rs:1445:5: replace unicode_utf8len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace unicode_utf8len -> i32 with 1
@@ -1437,25 +1437,17 @@
         utf8string[0] = 0xf0 | ((c >> 18) & 0x07) as u8;
         utf8string[1] = 0x80 | ((c >> 12) & 0x3f) as u8;
         utf8string[2] = 0x80 | ((c >> 6) & 0x3f) as u8;
         utf8string[3] = 0x80 | (c & 0x3f) as u8;
     }
 }
 
 pub const fn unicode_utf8len(c: pg_wchar) -> i32 {
-    if c <= 0x7f {
-        1
-    } else if c <= 0x7ff {
-        2
-    } else if c <= 0xffff {
-        3
-    } else {
-        4
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 const SINGLE_BYTE_TBL: pg_wchar_tbl = pg_wchar_tbl {
     mb2wchar_with_len: Some(pg_latin12wchar_with_len),
     wchar2mb_with_len: Some(pg_wchar2single_with_len),
     mblen: pg_latin1_mblen,
     dsplen: pg_latin1_dsplen,
     mbverifychar: pg_latin1_verifychar,

*** result: Success
