*** crates/common/wchar/src/lib.rs:147:5: replace pg_euc2wchar_with_len -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euc2wchar_with_len -> i32 with 0
@@ -139,56 +139,17 @@
     } else if c < 0x20 || c == 0x7f {
         -1
     } else {
         1
     }
 }
 
 fn pg_euc2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        if from[fi] == SS2 {
-            if len < 2 {
-                break;
-            }
-            fi += 1;
-            to[ti] = ((SS2 as u32) << 8) | from[fi] as u32;
-            fi += 1;
-            len -= 2;
-        } else if from[fi] == SS3 {
-            if len < 3 {
-                break;
-            }
-            fi += 1;
-            to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 3;
-        } else if is_highbit_set(from[fi]) {
-            if len < 2 {
-                break;
-            }
-            to[ti] = (from[fi] as u32) << 8;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 2;
-        } else {
-            to[ti] = from[fi] as pg_wchar;
-            fi += 1;
-            len -= 1;
-        }
-        ti += 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline]
 fn pg_euc_mblen(s: &[u8]) -> i32 {
     if s[0] == SS2 {
         2
     } else if s[0] == SS3 {
         3

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (3224) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 1
  left: 11150691528994988709
 right: 8301471130329289311

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
