*** crates/common/wchar/src/lib.rs:150:15: replace > with >= in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with >= in pg_euc2wchar_with_len
@@ -142,17 +142,17 @@
         1
     }
 }
 
 fn pg_euc2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
+    while len >= /* ~ changed by cargo-mutants ~ */ 0 && from[fi] != 0 {
         if from[fi] == SS2 {
             if len < 2 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS2 as u32) << 8) | from[fi] as u32;
             fi += 1;
             len -= 2;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (3512) panicked at crates/common/wchar/src/lib.rs:150:58:
index out of bounds: the len is 1 but the index is 1

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
