*** crates/common/wchar/src/lib.rs:152:20: replace < with <= in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_euc2wchar_with_len
@@ -144,17 +144,17 @@
 }
 
 fn pg_euc2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 {
-            if len < 2 {
+            if len <= /* ~ changed by cargo-mutants ~ */ 2 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS2 as u32) << 8) | from[fi] as u32;
             fi += 1;
             len -= 2;
         } else if from[fi] == SS3 {
             if len < 3 {

*** result: Success
