*** crates/common/wchar/src/lib.rs:156:42: replace | with & in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with & in pg_euc2wchar_with_len
@@ -148,17 +148,17 @@
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 {
             if len < 2 {
                 break;
             }
             fi += 1;
-            to[ti] = ((SS2 as u32) << 8) | from[fi] as u32;
+            to[ti] = ((SS2 as u32) << 8) & /* ~ changed by cargo-mutants ~ */ from[fi] as u32;
             fi += 1;
             len -= 2;
         } else if from[fi] == SS3 {
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (3901) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 1
  left: 9120445425225600287
 right: 8301471130329289311

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
