*** crates/common/wchar/src/lib.rs:156:42: replace | with ^ in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with ^ in pg_euc2wchar_with_len
@@ -148,17 +148,17 @@
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 {
             if len < 2 {
                 break;
             }
             fi += 1;
-            to[ti] = ((SS2 as u32) << 8) | from[fi] as u32;
+            to[ti] = ((SS2 as u32) << 8) ^ /* ~ changed by cargo-mutants ~ */ from[fi] as u32;
             fi += 1;
             len -= 2;
         } else if from[fi] == SS3 {
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);

*** result: Success
