*** crates/common/wchar/src/lib.rs:165:16: replace += with -= in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_euc2wchar_with_len
@@ -157,17 +157,17 @@
             fi += 1;
             len -= 2;
         } else if from[fi] == SS3 {
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);
-            fi += 1;
+            fi -= /* ~ changed by cargo-mutants ~ */ 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (4714) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 1
  left: 10642526140034414039
 right: 8301471130329289311

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
