*** crates/common/wchar/src/lib.rs:170:20: replace < with == in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with == in pg_euc2wchar_with_len
@@ -162,17 +162,17 @@
             }
             fi += 1;
             to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
-            if len < 2 {
+            if len == /* ~ changed by cargo-mutants ~ */ 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (5086) panicked at crates/common/wchar/src/lib.rs:175:23:
index out of bounds: the len is 384 but the index is 384

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
