*** crates/common/wchar/src/lib.rs:176:16: replace += with -= in pg_euc2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_euc2wchar_with_len
@@ -168,17 +168,17 @@
             len -= 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
-            fi += 1;
+            fi -= /* ~ changed by cargo-mutants ~ */ 1;
             len -= 2;
         } else {
             to[ti] = from[fi] as pg_wchar;
             fi += 1;
             len -= 1;
         }
         ti += 1;
     }

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (5401) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 1
  left: 11937378589018567025
 right: 8301471130329289311

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
