*** crates/common/wchar/src/lib.rs:191:13: replace == with != in pg_euc_mblen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_euc_mblen
@@ -183,17 +183,17 @@
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 #[inline]
 fn pg_euc_mblen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
+    if s[0] != /* ~ changed by cargo-mutants ~ */ SS2 {
         2
     } else if s[0] == SS3 {
         3
     } else if is_highbit_set(s[0]) {
         2
     } else {
         1
     }

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (6041) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 1 b 0
  left: 2
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (6049) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 331 enc 40
  left: 2
 right: 4

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (6048) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 7493963773394886437
 right: 10372200427643310893

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.14s

*** result: Failure(101)
