*** crates/common/wchar/src/lib.rs:191:5: replace pg_euc_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euc_mblen -> i32 with 0
@@ -183,25 +183,17 @@
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 #[inline]
 fn pg_euc_mblen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
-        2
-    } else if s[0] == SS3 {
-        3
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline]
 fn pg_euc_dsplen(s: &[u8]) -> i32 {
     if s[0] == SS2 || s[0] == SS3 || is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)

*** result: Timeout
