*** crates/common/wchar/src/lib.rs:191:5: replace pg_euc_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euc_mblen -> i32 with -1
@@ -183,25 +183,17 @@
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 #[inline]
 fn pg_euc_mblen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
-        2
-    } else if s[0] == SS3 {
-        3
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline]
 fn pg_euc_dsplen(s: &[u8]) -> i32 {
     if s[0] == SS2 || s[0] == SS3 || is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (5993) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 1 b 0
  left: -1
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (6009) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 40
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (6008) panicked at crates/common/wchar/src/lib.rs:936:32:
index out of bounds: the len is 1 but the index is 1

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.97s

*** result: Failure(101)
