*** crates/common/wchar/src/lib.rs:204:20: replace || with && in pg_euc_dsplen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace || with && in pg_euc_dsplen
@@ -196,17 +196,17 @@
         2
     } else {
         1
     }
 }
 
 #[inline]
 fn pg_euc_dsplen(s: &[u8]) -> i32 {
-    if s[0] == SS2 || s[0] == SS3 || is_highbit_set(s[0]) {
+    if s[0] == SS2 && /* ~ changed by cargo-mutants ~ */ s[0] == SS3 || is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_eucjp2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     pg_euc2wchar_with_len(from, to)

*** result: Success
