*** crates/common/wchar/src/lib.rs:204:35: replace || with && in pg_euc_dsplen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace || with && in pg_euc_dsplen
@@ -196,17 +196,17 @@
         2
     } else {
         1
     }
 }
 
 #[inline]
 fn pg_euc_dsplen(s: &[u8]) -> i32 {
-    if s[0] == SS2 || s[0] == SS3 || is_highbit_set(s[0]) {
+    if s[0] == SS2 || s[0] == SS3 && /* ~ changed by cargo-mutants ~ */ is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_eucjp2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     pg_euc2wchar_with_len(from, to)

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (6289) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 3 b 128
  left: 1
 right: 2

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
