*** crates/common/wchar/src/lib.rs:212:5: replace pg_eucjp2wchar_with_len -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_eucjp2wchar_with_len -> i32 with 0
@@ -204,17 +204,17 @@
     if s[0] == SS2 || s[0] == SS3 || is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_eucjp2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    pg_euc2wchar_with_len(from, to)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_eucjp_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }
 
 fn pg_eucjp_dsplen(s: &[u8]) -> i32 {
     if s[0] == SS2 {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (6484) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 1
  left: 11150691528994988709
 right: 8301471130329289311

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
