*** crates/common/wchar/src/lib.rs:216:5: replace pg_eucjp_mblen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_eucjp_mblen -> i32 with 1
@@ -208,17 +208,17 @@
     }
 }
 
 fn pg_eucjp2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     pg_euc2wchar_with_len(from, to)
 }
 
 fn pg_eucjp_mblen(s: &[u8]) -> i32 {
-    pg_euc_mblen(s)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_eucjp_dsplen(s: &[u8]) -> i32 {
     if s[0] == SS2 {
         1
     } else if s[0] == SS3 {
         2
     } else if is_highbit_set(s[0]) {

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (6715) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 1 b 128
  left: 1
 right: 2

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
