*** crates/common/wchar/src/lib.rs:220:5: replace pg_eucjp_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_eucjp_dsplen -> i32 with 1
@@ -212,25 +212,17 @@
     pg_euc2wchar_with_len(from, to)
 }
 
 fn pg_eucjp_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }
 
 fn pg_eucjp_dsplen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
-        1
-    } else if s[0] == SS3 {
-        2
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        pg_ascii_dsplen(s)
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euckr2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     pg_euc2wchar_with_len(from, to)
 }
 
 fn pg_euckr_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (6859) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 1 b 0
  left: 1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.28s

*** result: Failure(101)
