*** crates/common/wchar/src/lib.rs:232:5: replace pg_euckr2wchar_with_len -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euckr2wchar_with_len -> i32 with -1
@@ -224,17 +224,17 @@
     } else if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_euckr2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    pg_euc2wchar_with_len(from, to)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euckr_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }
 
 fn pg_euckr_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (7153) panicked at crates/common/wchar/tests/c_parity.rs:181:25:
index out of bounds: the len is 4097 but the index is 4097

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
