*** crates/common/wchar/src/lib.rs:236:5: replace pg_euckr_mblen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euckr_mblen -> i32 with 1
@@ -228,17 +228,17 @@
     }
 }
 
 fn pg_euckr2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     pg_euc2wchar_with_len(from, to)
 }
 
 fn pg_euckr_mblen(s: &[u8]) -> i32 {
-    pg_euc_mblen(s)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euckr_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)
 }
 
 fn pg_euccn2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (7220) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 3 b 128
  left: 1
 right: 2

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
