*** crates/common/wchar/src/lib.rs:240:5: replace pg_euckr_dsplen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euckr_dsplen -> i32 with 0
@@ -232,17 +232,17 @@
     pg_euc2wchar_with_len(from, to)
 }
 
 fn pg_euckr_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }
 
 fn pg_euckr_dsplen(s: &[u8]) -> i32 {
-    pg_euc_dsplen(s)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euccn2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 || from[fi] == SS3 {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (7321) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 3 b 1
  left: 0
 right: -1

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
