*** crates/common/wchar/src/lib.rs:244:5: replace pg_euccn2wchar_with_len -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euccn2wchar_with_len -> i32 with -1
@@ -236,49 +236,17 @@
     pg_euc_mblen(s)
 }
 
 fn pg_euckr_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)
 }
 
 fn pg_euccn2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        if from[fi] == SS2 || from[fi] == SS3 {
-            let lead = from[fi] as u32;
-            if len < 3 {
-                break;
-            }
-            fi += 1;
-            to[ti] = (lead << 16) | ((from[fi] as u32) << 8);
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 3;
-        } else if is_highbit_set(from[fi]) {
-            if len < 2 {
-                break;
-            }
-            to[ti] = (from[fi] as u32) << 8;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 2;
-        } else {
-            to[ti] = from[fi] as pg_wchar;
-            fi += 1;
-            len -= 1;
-        }
-        ti += 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euccn_mblen(s: &[u8]) -> i32 {
     if s[0] == SS2 || s[0] == SS3 {
         3
     } else if is_highbit_set(s[0]) {
         2
     } else {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (7588) panicked at crates/common/wchar/tests/c_parity.rs:181:25:
index out of bounds: the len is 4097 but the index is 4097

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
