*** crates/common/wchar/src/lib.rs:248:21: replace == with != in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_euccn2wchar_with_len
@@ -240,17 +240,17 @@
     pg_euc_dsplen(s)
 }
 
 fn pg_euccn2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
-        if from[fi] == SS2 || from[fi] == SS3 {
+        if from[fi] != /* ~ changed by cargo-mutants ~ */ SS2 || from[fi] == SS3 {
             let lead = from[fi] as u32;
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = (lead << 16) | ((from[fi] as u32) << 8);
             fi += 1;
             to[ti] |= from[fi] as u32;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (7917) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 2
  left: 15968781089316644642
 right: 15549220157437427017

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
