*** crates/common/wchar/src/lib.rs:254:35: replace | with ^ in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with ^ in pg_euccn2wchar_with_len
@@ -246,17 +246,17 @@
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 || from[fi] == SS3 {
             let lead = from[fi] as u32;
             if len < 3 {
                 break;
             }
             fi += 1;
-            to[ti] = (lead << 16) | ((from[fi] as u32) << 8);
+            to[ti] = (lead << 16) ^ /* ~ changed by cargo-mutants ~ */ ((from[fi] as u32) << 8);
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }

*** result: Success
