*** crates/common/wchar/src/lib.rs:256:20: replace |= with &= in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace |= with &= in pg_euccn2wchar_with_len
@@ -248,17 +248,17 @@
         if from[fi] == SS2 || from[fi] == SS3 {
             let lead = from[fi] as u32;
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = (lead << 16) | ((from[fi] as u32) << 8);
             fi += 1;
-            to[ti] |= from[fi] as u32;
+            to[ti] &= /* ~ changed by cargo-mutants ~ */ from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
             fi += 1;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (8548) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 2
  left: 9619620595527753592
 right: 15549220157437427017

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
