*** crates/common/wchar/src/lib.rs:258:17: replace -= with += in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with += in pg_euccn2wchar_with_len
@@ -250,17 +250,17 @@
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = (lead << 16) | ((from[fi] as u32) << 8);
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
-            len -= 3;
+            len += /* ~ changed by cargo-mutants ~ */ 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (8695) panicked at crates/common/wchar/src/lib.rs:247:22:
index out of bounds: the len is 64 but the index is 64

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
