*** crates/common/wchar/src/lib.rs:263:40: replace << with >> in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace << with >> in pg_euccn2wchar_with_len
@@ -255,17 +255,17 @@
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
-            to[ti] = (from[fi] as u32) << 8;
+            to[ti] = (from[fi] as u32) >> /* ~ changed by cargo-mutants ~ */ 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else {
             to[ti] = from[fi] as pg_wchar;
             fi += 1;
             len -= 1;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (8947) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 2
  left: 14495495129964142861
 right: 15549220157437427017

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
