*** crates/common/wchar/src/lib.rs:264:16: replace += with *= in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_euccn2wchar_with_len
@@ -256,17 +256,17 @@
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
-            fi += 1;
+            fi *= /* ~ changed by cargo-mutants ~ */ 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else {
             to[ti] = from[fi] as pg_wchar;
             fi += 1;
             len -= 1;
         }

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (9039) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 2
  left: 5526774589835495128
 right: 15549220157437427017

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.30s

*** result: Failure(101)
