*** crates/common/wchar/src/lib.rs:267:17: replace -= with += in pg_euccn2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with += in pg_euccn2wchar_with_len
@@ -259,17 +259,17 @@
         } else if is_highbit_set(from[fi]) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
-            len -= 2;
+            len += /* ~ changed by cargo-mutants ~ */ 2;
         } else {
             to[ti] = from[fi] as pg_wchar;
             fi += 1;
             len -= 1;
         }
         ti += 1;
     }
     to[ti] = 0;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (9240) panicked at crates/common/wchar/src/lib.rs:247:22:
index out of bounds: the len is 5 but the index is 5

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
