*** crates/common/wchar/src/lib.rs:280:5: replace pg_euccn_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euccn_mblen -> i32 with -1
@@ -272,23 +272,17 @@
         }
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_euccn_mblen(s: &[u8]) -> i32 {
-    if s[0] == SS2 || s[0] == SS3 {
-        3
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euccn_dsplen(s: &[u8]) -> i32 {
     if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (9725) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 2 b 0
  left: -1
 right: 1

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
