*** crates/common/wchar/src/lib.rs:290:5: replace pg_euccn_dsplen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euccn_dsplen -> i32 with 0
@@ -282,21 +282,17 @@
     } else if is_highbit_set(s[0]) {
         2
     } else {
         1
     }
 }
 
 fn pg_euccn_dsplen(s: &[u8]) -> i32 {
-    if is_highbit_set(s[0]) {
-        2
-    } else {
-        pg_ascii_dsplen(s)
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euctw2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (9924) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 2 b 1
  left: 0
 right: -1

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
