*** crates/common/wchar/src/lib.rs:298:5: replace pg_euctw2wchar_with_len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euctw2wchar_with_len -> i32 with 1
@@ -290,60 +290,17 @@
     if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_euctw2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        if from[fi] == SS2 {
-            if len < 4 {
-                break;
-            }
-            fi += 1;
-            to[ti] = ((SS2 as u32) << 24) | ((from[fi] as u32) << 16);
-            fi += 1;
-            to[ti] |= (from[fi] as u32) << 8;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 4;
-        } else if from[fi] == SS3 {
-            if len < 3 {
-                break;
-            }
-            fi += 1;
-            to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 3;
-        } else if is_highbit_set(from[fi]) {
-            if len < 2 {
-                break;
-            }
-            to[ti] = (from[fi] as u32) << 8;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 2;
-        } else {
-            to[ti] = from[fi] as pg_wchar;
-            fi += 1;
-            len -= 1;
-        }
-        ti += 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euctw_mblen(s: &[u8]) -> i32 {
     if s[0] == SS2 {
         4
     } else if s[0] == SS3 {
         3
     } else if is_highbit_set(s[0]) {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (10148) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 4
  left: 16247039651405997125
 right: 17772067560020999107

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.27s

*** result: Failure(101)
