*** crates/common/wchar/src/lib.rs:306:16: replace += with -= in pg_euctw2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_euctw2wchar_with_len
@@ -298,17 +298,17 @@
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         if from[fi] == SS2 {
             if len < 4 {
                 break;
             }
-            fi += 1;
+            fi -= /* ~ changed by cargo-mutants ~ */ 1;
             to[ti] = ((SS2 as u32) << 24) | ((from[fi] as u32) << 16);
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 4;
         } else if from[fi] == SS3 {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (10665) panicked at crates/common/wchar/src/lib.rs:306:13:
attempt to subtract with overflow

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
