*** crates/common/wchar/src/lib.rs:310:16: replace += with -= in pg_euctw2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_euctw2wchar_with_len
@@ -302,17 +302,17 @@
         if from[fi] == SS2 {
             if len < 4 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS2 as u32) << 24) | ((from[fi] as u32) << 16);
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
-            fi += 1;
+            fi -= /* ~ changed by cargo-mutants ~ */ 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 4;
         } else if from[fi] == SS3 {
             if len < 3 {
                 break;
             }
             fi += 1;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (11184) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 4
  left: 11520985193228810621
 right: 17772067560020999107

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
