*** crates/common/wchar/src/lib.rs:315:20: replace < with > in pg_euctw2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_euctw2wchar_with_len
@@ -307,17 +307,17 @@
             to[ti] = ((SS2 as u32) << 24) | ((from[fi] as u32) << 16);
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 4;
         } else if from[fi] == SS3 {
-            if len < 3 {
+            if len > /* ~ changed by cargo-mutants ~ */ 3 {
                 break;
             }
             fi += 1;
             to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (11632) panicked at crates/common/wchar/src/lib.rs:321:23:
index out of bounds: the len is 64 but the index is 64

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
