*** crates/common/wchar/src/lib.rs:325:20: replace < with > in pg_euctw2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_euctw2wchar_with_len
@@ -317,17 +317,17 @@
             }
             fi += 1;
             to[ti] = ((SS3 as u32) << 16) | ((from[fi] as u32) << 8);
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_highbit_set(from[fi]) {
-            if len < 2 {
+            if len > /* ~ changed by cargo-mutants ~ */ 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (12356) panicked at crates/common/wchar/src/lib.rs:330:23:
index out of bounds: the len is 1 but the index is 1

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.44s

*** result: Failure(101)
