*** crates/common/wchar/src/lib.rs:345:13: replace == with != in pg_euctw_mblen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_euctw_mblen
@@ -337,17 +337,17 @@
         }
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_euctw_mblen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
+    if s[0] != /* ~ changed by cargo-mutants ~ */ SS2 {
         4
     } else if s[0] == SS3 {
         3
     } else if is_highbit_set(s[0]) {
         2
     } else {
         1
     }

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (13352) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 4 b 0
  left: 4
 right: 1

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
