*** crates/common/wchar/src/lib.rs:345:5: replace pg_euctw_mblen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euctw_mblen -> i32 with 1
@@ -337,25 +337,17 @@
         }
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_euctw_mblen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
-        4
-    } else if s[0] == SS3 {
-        3
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euctw_dsplen(s: &[u8]) -> i32 {
     if s[0] == SS2 {
         2
     } else if s[0] == SS3 {
         2
     } else if is_highbit_set(s[0]) {

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (13216) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 4 b 128
  left: 1
 right: 2

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
