*** crates/common/wchar/src/lib.rs:357:13: replace == with != in pg_euctw_dsplen

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_euctw_dsplen
@@ -349,17 +349,17 @@
     } else if is_highbit_set(s[0]) {
         2
     } else {
         1
     }
 }
 
 fn pg_euctw_dsplen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
+    if s[0] != /* ~ changed by cargo-mutants ~ */ SS2 {
         2
     } else if s[0] == SS3 {
         2
     } else if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (13543) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 4 b 0
  left: 2
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
