*** crates/common/wchar/src/lib.rs:357:5: replace pg_euctw_dsplen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euctw_dsplen -> i32 with -1
@@ -349,25 +349,17 @@
     } else if is_highbit_set(s[0]) {
         2
     } else {
         1
     }
 }
 
 fn pg_euctw_dsplen(s: &[u8]) -> i32 {
-    if s[0] == SS2 {
-        2
-    } else if s[0] == SS3 {
-        2
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        pg_ascii_dsplen(s)
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_wchar2euc_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (13533) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 4 b 0
  left: -1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.27s

*** result: Failure(101)
