*** crates/common/wchar/src/lib.rs:369:5: replace pg_wchar2euc_with_len -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_wchar2euc_with_len -> i32 with 0
@@ -361,50 +361,17 @@
     } else if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_wchar2euc_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    let mut cnt = 0i32;
-    while len > 0 && from[fi] != 0 {
-        let w = from[fi];
-        if (w >> 24) as u8 != 0 {
-            to[ti] = (w >> 24) as u8;
-            to[ti + 1] = (w >> 16) as u8;
-            to[ti + 2] = (w >> 8) as u8;
-            to[ti + 3] = w as u8;
-            ti += 4;
-            cnt += 4;
-        } else if (w >> 16) as u8 != 0 {
-            to[ti] = (w >> 16) as u8;
-            to[ti + 1] = (w >> 8) as u8;
-            to[ti + 2] = w as u8;
-            ti += 3;
-            cnt += 3;
-        } else if (w >> 8) as u8 != 0 {
-            to[ti] = (w >> 8) as u8;
-            to[ti + 1] = w as u8;
-            ti += 2;
-            cnt += 2;
-        } else {
-            to[ti] = w as u8;
-            ti += 1;
-            cnt += 1;
-        }
-        fi += 1;
-        len -= 1;
-    }
-    to[ti] = 0;
-    cnt
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_johab_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }
 
 fn pg_johab_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (13764) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 1
  left: 9052592289448545061
 right: 17190858677059609683

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
