*** crates/common/wchar/src/lib.rs:381:17: replace += with *= in pg_wchar2euc_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2euc_with_len
@@ -373,17 +373,17 @@
     while len > 0 && from[fi] != 0 {
         let w = from[fi];
         if (w >> 24) as u8 != 0 {
             to[ti] = (w >> 24) as u8;
             to[ti + 1] = (w >> 16) as u8;
             to[ti + 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
             ti += 4;
-            cnt += 4;
+            cnt *= /* ~ changed by cargo-mutants ~ */ 4;
         } else if (w >> 16) as u8 != 0 {
             to[ti] = (w >> 16) as u8;
             to[ti + 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (w >> 8) as u8 != 0 {
             to[ti] = (w >> 8) as u8;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (14753) panicked at crates/common/wchar/src/lib.rs:381:13:
attempt to multiply with overflow

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
