*** crates/common/wchar/src/lib.rs:382:35: replace != with == in pg_wchar2euc_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace != with == in pg_wchar2euc_with_len
@@ -374,17 +374,17 @@
         let w = from[fi];
         if (w >> 24) as u8 != 0 {
             to[ti] = (w >> 24) as u8;
             to[ti + 1] = (w >> 16) as u8;
             to[ti + 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
             ti += 4;
             cnt += 4;
-        } else if (w >> 16) as u8 != 0 {
+        } else if (w >> 16) as u8 == /* ~ changed by cargo-mutants ~ */ 0 {
             to[ti] = (w >> 16) as u8;
             to[ti + 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (w >> 8) as u8 != 0 {
             to[ti] = (w >> 8) as u8;
             to[ti + 1] = w as u8;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (14793) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 1
  left: 16630955473444756234
 right: 17190858677059609683

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
