*** crates/common/wchar/src/lib.rs:389:25: replace >> with << in pg_wchar2euc_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace >> with << in pg_wchar2euc_with_len
@@ -381,17 +381,17 @@
             cnt += 4;
         } else if (w >> 16) as u8 != 0 {
             to[ti] = (w >> 16) as u8;
             to[ti + 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (w >> 8) as u8 != 0 {
-            to[ti] = (w >> 8) as u8;
+            to[ti] = (w << /* ~ changed by cargo-mutants ~ */ 8) as u8;
             to[ti + 1] = w as u8;
             ti += 2;
             cnt += 2;
         } else {
             to[ti] = w as u8;
             ti += 1;
             cnt += 1;
         }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (15551) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 1
  left: 10157047686798956486
 right: 17190858677059609683

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
