*** crates/common/wchar/src/lib.rs:392:17: replace += with *= in pg_wchar2euc_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2euc_with_len
@@ -384,17 +384,17 @@
             to[ti + 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (w >> 8) as u8 != 0 {
             to[ti] = (w >> 8) as u8;
             to[ti + 1] = w as u8;
             ti += 2;
-            cnt += 2;
+            cnt *= /* ~ changed by cargo-mutants ~ */ 2;
         } else {
             to[ti] = w as u8;
             ti += 1;
             cnt += 1;
         }
         fi += 1;
         len -= 1;
     }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (15773) panicked at crates/common/wchar/src/lib.rs:392:13:
attempt to multiply with overflow

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.57s

*** result: Failure(101)
