*** crates/common/wchar/src/lib.rs:396:17: replace += with -= in pg_wchar2euc_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_wchar2euc_with_len
@@ -388,17 +388,17 @@
         } else if (w >> 8) as u8 != 0 {
             to[ti] = (w >> 8) as u8;
             to[ti + 1] = w as u8;
             ti += 2;
             cnt += 2;
         } else {
             to[ti] = w as u8;
             ti += 1;
-            cnt += 1;
+            cnt -= /* ~ changed by cargo-mutants ~ */ 1;
         }
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (15969) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 1
  left: 4833912542672544212
 right: 17190858677059609683

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.37s

*** result: Failure(101)
