*** crates/common/wchar/src/lib.rs:399:13: replace -= with += in pg_wchar2euc_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with += in pg_wchar2euc_with_len
@@ -391,17 +391,17 @@
             ti += 2;
             cnt += 2;
         } else {
             to[ti] = w as u8;
             ti += 1;
             cnt += 1;
         }
         fi += 1;
-        len -= 1;
+        len += /* ~ changed by cargo-mutants ~ */ 1;
     }
     to[ti] = 0;
     cnt
 }
 
 fn pg_johab_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (16165) panicked at crates/common/wchar/src/lib.rs:373:22:
index out of bounds: the len is 128 but the index is 128

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
