*** crates/common/wchar/src/lib.rs:406:5: replace pg_johab_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_johab_mblen -> i32 with 0
@@ -398,17 +398,17 @@
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 fn pg_johab_mblen(s: &[u8]) -> i32 {
-    pg_euc_mblen(s)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_johab_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();

*** result: Timeout
