*** crates/common/wchar/src/lib.rs:406:5: replace pg_johab_mblen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_johab_mblen -> i32 with 1
@@ -398,17 +398,17 @@
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 fn pg_johab_mblen(s: &[u8]) -> i32 {
-    pg_euc_mblen(s)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_johab_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (16307) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 40 b 128
  left: 1
 right: 2

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (16323) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 40
  left: 16
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (16319) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 1677996718092854053
 right: 10372200427643310893

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.13s

*** result: Failure(101)
