*** crates/common/wchar/src/lib.rs:406:5: replace pg_johab_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_johab_mblen -> i32 with -1
@@ -398,17 +398,17 @@
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 fn pg_johab_mblen(s: &[u8]) -> i32 {
-    pg_euc_mblen(s)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_johab_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (16341) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 40 b 0
  left: -1
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (16352) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 40
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (16351) panicked at crates/common/wchar/src/lib.rs:944:32:
index out of bounds: the len is 1 but the index is 1

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.99s

*** result: Failure(101)
