*** crates/common/wchar/src/lib.rs:410:5: replace pg_johab_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_johab_dsplen -> i32 with 1
@@ -402,17 +402,17 @@
     cnt
 }
 
 fn pg_johab_mblen(s: &[u8]) -> i32 {
     pg_euc_mblen(s)
 }
 
 fn pg_johab_dsplen(s: &[u8]) -> i32 {
-    pg_euc_dsplen(s)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (16464) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 40 b 0
  left: 1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
