*** crates/common/wchar/src/lib.rs:414:5: replace pg_utf2wchar_with_len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf2wchar_with_len -> i32 with 1
@@ -406,64 +406,17 @@
     pg_euc_mblen(s)
 }
 
 fn pg_johab_dsplen(s: &[u8]) -> i32 {
     pg_euc_dsplen(s)
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        let b = from[fi];
-        if b & 0x80 == 0 {
-            to[ti] = b as pg_wchar;
-            fi += 1;
-            len -= 1;
-        } else if b & 0xe0 == 0xc0 {
-            if len < 2 {
-                break;
-            }
-            let c1 = (from[fi] & 0x1f) as u32;
-            let c2 = (from[fi + 1] & 0x3f) as u32;
-            to[ti] = (c1 << 6) | c2;
-            fi += 2;
-            len -= 2;
-        } else if b & 0xf0 == 0xe0 {
-            if len < 3 {
-                break;
-            }
-            let c1 = (from[fi] & 0x0f) as u32;
-            let c2 = (from[fi + 1] & 0x3f) as u32;
-            let c3 = (from[fi + 2] & 0x3f) as u32;
-            to[ti] = (c1 << 12) | (c2 << 6) | c3;
-            fi += 3;
-            len -= 3;
-        } else if b & 0xf8 == 0xf0 {
-            if len < 4 {
-                break;
-            }
-            let c1 = (from[fi] & 0x07) as u32;
-            let c2 = (from[fi + 1] & 0x3f) as u32;
-            let c3 = (from[fi + 2] & 0x3f) as u32;
-            let c4 = (from[fi + 3] & 0x3f) as u32;
-            to[ti] = (c1 << 18) | (c2 << 12) | (c3 << 6) | c4;
-            fi += 4;
-            len -= 4;
-        } else {
-            to[ti] = b as pg_wchar;
-            fi += 1;
-            len -= 1;
-        }
-        ti += 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_wchar2utf_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (16613) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 6
  left: 16247039651405997125
 right: 6417843642683947385

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.23s

*** result: Failure(101)
