*** crates/common/wchar/src/lib.rs:419:14: replace & with ^ in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in pg_utf2wchar_with_len
@@ -411,17 +411,17 @@
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];
-        if b & 0x80 == 0 {
+        if b ^ /* ~ changed by cargo-mutants ~ */ 0x80 == 0 {
             to[ti] = b as pg_wchar;
             fi += 1;
             len -= 1;
         } else if b & 0xe0 == 0xc0 {
             if len < 2 {
                 break;
             }
             let c1 = (from[fi] & 0x1f) as u32;

*** result: Success
