*** crates/common/wchar/src/lib.rs:419:21: replace == with != in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_utf2wchar_with_len
@@ -411,17 +411,17 @@
 }
 
 fn pg_utf2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];
-        if b & 0x80 == 0 {
+        if b & 0x80 != /* ~ changed by cargo-mutants ~ */ 0 {
             to[ti] = b as pg_wchar;
             fi += 1;
             len -= 1;
         } else if b & 0xe0 == 0xc0 {
             if len < 2 {
                 break;
             }
             let c1 = (from[fi] & 0x1f) as u32;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (16923) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 6
  left: 2878253948976624651
 right: 6417843642683947385

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
