*** crates/common/wchar/src/lib.rs:423:28: replace == with != in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_utf2wchar_with_len
@@ -415,17 +415,17 @@
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];
         if b & 0x80 == 0 {
             to[ti] = b as pg_wchar;
             fi += 1;
             len -= 1;
-        } else if b & 0xe0 == 0xc0 {
+        } else if b & 0xe0 != /* ~ changed by cargo-mutants ~ */ 0xc0 {
             if len < 2 {
                 break;
             }
             let c1 = (from[fi] & 0x1f) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;
             to[ti] = (c1 << 6) | c2;
             fi += 2;
             len -= 2;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (17239) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 6
  left: 6481630585109558325
 right: 6417843642683947385

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
