*** crates/common/wchar/src/lib.rs:429:32: replace | with ^ in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace | with ^ in pg_utf2wchar_with_len
@@ -421,17 +421,17 @@
             fi += 1;
             len -= 1;
         } else if b & 0xe0 == 0xc0 {
             if len < 2 {
                 break;
             }
             let c1 = (from[fi] & 0x1f) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;
-            to[ti] = (c1 << 6) | c2;
+            to[ti] = (c1 << 6) ^ /* ~ changed by cargo-mutants ~ */ c2;
             fi += 2;
             len -= 2;
         } else if b & 0xf0 == 0xe0 {
             if len < 3 {
                 break;
             }
             let c1 = (from[fi] & 0x0f) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;

*** result: Success
