*** crates/common/wchar/src/lib.rs:440:16: replace += with *= in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_utf2wchar_with_len
@@ -432,17 +432,17 @@
         } else if b & 0xf0 == 0xe0 {
             if len < 3 {
                 break;
             }
             let c1 = (from[fi] & 0x0f) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;
             let c3 = (from[fi + 2] & 0x3f) as u32;
             to[ti] = (c1 << 12) | (c2 << 6) | c3;
-            fi += 3;
+            fi *= /* ~ changed by cargo-mutants ~ */ 3;
             len -= 3;
         } else if b & 0xf8 == 0xf0 {
             if len < 4 {
                 break;
             }
             let c1 = (from[fi] & 0x07) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;
             let c3 = (from[fi + 2] & 0x3f) as u32;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (19280) panicked at crates/common/wchar/src/lib.rs:417:22:
index out of bounds: the len is 64 but the index is 120

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
