*** crates/common/wchar/src/lib.rs:447:36: replace & with ^ in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in pg_utf2wchar_with_len
@@ -439,17 +439,17 @@
             to[ti] = (c1 << 12) | (c2 << 6) | c3;
             fi += 3;
             len -= 3;
         } else if b & 0xf8 == 0xf0 {
             if len < 4 {
                 break;
             }
             let c1 = (from[fi] & 0x07) as u32;
-            let c2 = (from[fi + 1] & 0x3f) as u32;
+            let c2 = (from[fi + 1] ^ /* ~ changed by cargo-mutants ~ */ 0x3f) as u32;
             let c3 = (from[fi + 2] & 0x3f) as u32;
             let c4 = (from[fi + 3] & 0x3f) as u32;
             to[ti] = (c1 << 18) | (c2 << 12) | (c3 << 6) | c4;
             fi += 4;
             len -= 4;
         } else {
             to[ti] = b as pg_wchar;
             fi += 1;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (19870) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 6
  left: 878682790362081770
 right: 6417843642683947385

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.50s

*** result: Failure(101)
