*** crates/common/wchar/src/lib.rs:451:16: replace += with *= in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_utf2wchar_with_len
@@ -443,17 +443,17 @@
             if len < 4 {
                 break;
             }
             let c1 = (from[fi] & 0x07) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;
             let c3 = (from[fi + 2] & 0x3f) as u32;
             let c4 = (from[fi + 3] & 0x3f) as u32;
             to[ti] = (c1 << 18) | (c2 << 12) | (c3 << 6) | c4;
-            fi += 4;
+            fi *= /* ~ changed by cargo-mutants ~ */ 4;
             len -= 4;
         } else {
             to[ti] = b as pg_wchar;
             fi += 1;
             len -= 1;
         }
         ti += 1;
     }

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (20919) panicked at crates/common/wchar/src/lib.rs:417:22:
index out of bounds: the len is 41 but the index is 116

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
