*** crates/common/wchar/src/lib.rs:452:17: replace -= with += in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with += in pg_utf2wchar_with_len
@@ -444,17 +444,17 @@
                 break;
             }
             let c1 = (from[fi] & 0x07) as u32;
             let c2 = (from[fi + 1] & 0x3f) as u32;
             let c3 = (from[fi + 2] & 0x3f) as u32;
             let c4 = (from[fi + 3] & 0x3f) as u32;
             to[ti] = (c1 << 18) | (c2 << 12) | (c3 << 6) | c4;
             fi += 4;
-            len -= 4;
+            len += /* ~ changed by cargo-mutants ~ */ 4;
         } else {
             to[ti] = b as pg_wchar;
             fi += 1;
             len -= 1;
         }
         ti += 1;
     }
     to[ti] = 0;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (21062) panicked at crates/common/wchar/src/lib.rs:417:22:
index out of bounds: the len is 5 but the index is 5

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
