*** crates/common/wchar/src/lib.rs:458:12: replace += with -= in pg_utf2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_utf2wchar_with_len
@@ -450,17 +450,17 @@
             to[ti] = (c1 << 18) | (c2 << 12) | (c3 << 6) | c4;
             fi += 4;
             len -= 4;
         } else {
             to[ti] = b as pg_wchar;
             fi += 1;
             len -= 1;
         }
-        ti += 1;
+        ti -= /* ~ changed by cargo-mutants ~ */ 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_wchar2utf_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (21341) panicked at crates/common/wchar/src/lib.rs:458:9:
attempt to subtract with overflow

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
