*** crates/common/wchar/src/lib.rs:465:5: replace pg_wchar2utf_with_len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_wchar2utf_with_len -> i32 with 1
@@ -457,30 +457,17 @@
         }
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_wchar2utf_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    let mut cnt = 0i32;
-    while len > 0 && from[fi] != 0 {
-        unicode_to_utf8(from[fi], &mut to[ti..]);
-        let char_len = pg_utf_mblen_byte(to[ti]);
-        cnt += char_len;
-        ti += char_len as usize;
-        fi += 1;
-        len -= 1;
-    }
-    to[ti] = 0;
-    cnt
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {
     if b & 0x80 == 0 {
         1
     } else if b & 0xe0 == 0xc0 {
         2

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (21496) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 10218339290833013029
 right: 1083083656248983483

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
