*** crates/common/wchar/src/lib.rs:469:15: replace > with < in pg_wchar2utf_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with < in pg_wchar2utf_with_len
@@ -461,17 +461,17 @@
     ti as i32
 }
 
 fn pg_wchar2utf_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
-    while len > 0 && from[fi] != 0 {
+    while len < /* ~ changed by cargo-mutants ~ */ 0 && from[fi] != 0 {
         unicode_to_utf8(from[fi], &mut to[ti..]);
         let char_len = pg_utf_mblen_byte(to[ti]);
         cnt += char_len;
         ti += char_len as usize;
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (21677) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 9052592289448545061
 right: 1083083656248983483

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
