*** crates/common/wchar/src/lib.rs:472:13: replace += with *= in pg_wchar2utf_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2utf_with_len
@@ -464,17 +464,17 @@
 fn pg_wchar2utf_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {
         unicode_to_utf8(from[fi], &mut to[ti..]);
         let char_len = pg_utf_mblen_byte(to[ti]);
-        cnt += char_len;
+        cnt *= /* ~ changed by cargo-mutants ~ */ char_len;
         ti += char_len as usize;
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (21824) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 11564181245640428274
 right: 1083083656248983483

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.40s

*** result: Failure(101)
