*** crates/common/wchar/src/lib.rs:474:12: replace += with *= in pg_wchar2utf_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2utf_with_len
@@ -466,17 +466,17 @@
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {
         unicode_to_utf8(from[fi], &mut to[ti..]);
         let char_len = pg_utf_mblen_byte(to[ti]);
         cnt += char_len;
         ti += char_len as usize;
-        fi += 1;
+        fi *= /* ~ changed by cargo-mutants ~ */ 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (22022) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 13852097524882510629
 right: 1083083656248983483

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
