*** crates/common/wchar/src/lib.rs:483:10: replace & with ^ in pg_utf_mblen_byte

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in pg_utf_mblen_byte
@@ -475,17 +475,17 @@
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {
-    if b & 0x80 == 0 {
+    if b ^ /* ~ changed by cargo-mutants ~ */ 0x80 == 0 {
         1
     } else if b & 0xe0 == 0xc0 {
         2
     } else if b & 0xf0 == 0xe0 {
         3
     } else if b & 0xf8 == 0xf0 {
         4
     } else {

*** result: Success
