*** crates/common/wchar/src/lib.rs:483:17: replace == with != in pg_utf_mblen_byte

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_utf_mblen_byte
@@ -475,17 +475,17 @@
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {
-    if b & 0x80 == 0 {
+    if b & 0x80 != /* ~ changed by cargo-mutants ~ */ 0 {
         1
     } else if b & 0xe0 == 0xc0 {
         2
     } else if b & 0xf0 == 0xe0 {
         3
     } else if b & 0xf8 == 0xf0 {
         4
     } else {

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (22279) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 6 b 192
  left: 1
 right: 2

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (22280) panicked at crates/common/wchar/tests/c_parity.rs:242:5:
assertion `left == right` failed
  left: 1
 right: 4

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (22311) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 13878088826080116656
 right: 1083083656248983483

failures:
    mblen_tables_match_c
    or_incomplete_edge_cases
    utf8_codepoint_walk_matches_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.36s

*** result: Failure(101)
