*** crates/common/wchar/src/lib.rs:483:5: replace pg_utf_mblen_byte -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf_mblen_byte -> i32 with -1
@@ -475,27 +475,17 @@
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {
-    if b & 0x80 == 0 {
-        1
-    } else if b & 0xe0 == 0xc0 {
-        2
-    } else if b & 0xf0 == 0xe0 {
-        3
-    } else if b & 0xf8 == 0xf0 {
-        4
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn pg_utf_mblen(s: &[u8]) -> i32 {
     pg_utf_mblen_byte(s[0])
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn mbbisearch(ucs: pg_wchar, table: &[mbinterval]) -> bool {

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (22291) panicked at crates/common/wchar/tests/c_parity.rs:242:5:
assertion `left == right` failed
  left: -1
 right: 4

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (22289) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 6 b 0
  left: -1
 right: 1

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (22314) panicked at crates/common/wchar/src/lib.rs:470:42:
range start index 18446744073709551615 out of range for slice of length 513

failures:
    mblen_tables_match_c
    or_incomplete_edge_cases
    utf8_codepoint_walk_matches_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.40s

*** result: Failure(101)
