*** crates/common/wchar/src/lib.rs:487:17: replace & with | in pg_utf_mblen_byte

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with | in pg_utf_mblen_byte
@@ -479,17 +479,17 @@
 }
 
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {
     if b & 0x80 == 0 {
         1
     } else if b & 0xe0 == 0xc0 {
         2
-    } else if b & 0xf0 == 0xe0 {
+    } else if b | /* ~ changed by cargo-mutants ~ */ 0xf0 == 0xe0 {
         3
     } else if b & 0xf8 == 0xf0 {
         4
     } else {
         1
     }
 }

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (22693) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 6 b 224
  left: 1
 right: 3

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (22710) panicked at crates/common/wchar/src/lib.rs:1252:17:
attempt to subtract with overflow

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (22711) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 6
  left: 14141884138503027760
 right: 1083083656248983483

failures:
    mblen_tables_match_c
    utf8_codepoint_walk_matches_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
