*** crates/common/wchar/src/lib.rs:489:17: replace & with ^ in pg_utf_mblen_byte

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with ^ in pg_utf_mblen_byte
@@ -481,17 +481,17 @@
 #[inline(always)]
 fn pg_utf_mblen_byte(b: u8) -> i32 {
     if b & 0x80 == 0 {
         1
     } else if b & 0xe0 == 0xc0 {
         2
     } else if b & 0xf0 == 0xe0 {
         3
-    } else if b & 0xf8 == 0xf0 {
+    } else if b ^ /* ~ changed by cargo-mutants ~ */ 0xf8 == 0xf0 {
         4
     } else {
         1
     }
 }
 
 pub fn pg_utf_mblen(s: &[u8]) -> i32 {
     pg_utf_mblen_byte(s[0])

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (22874) panicked at crates/common/wchar/tests/c_parity.rs:242:5:
assertion `left == right` failed
  left: 1
 right: 4

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (22873) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 6 b 240
  left: 1
 right: 4

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (22881) panicked at crates/common/wchar/src/lib.rs:1252:17:
attempt to subtract with overflow

failures:
    mblen_tables_match_c
    or_incomplete_edge_cases
    utf8_codepoint_walk_matches_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
