*** crates/common/wchar/src/lib.rs:497:5: replace pg_utf_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf_mblen -> i32 with -1
@@ -489,17 +489,17 @@
     } else if b & 0xf8 == 0xf0 {
         4
     } else {
         1
     }
 }
 
 pub fn pg_utf_mblen(s: &[u8]) -> i32 {
-    pg_utf_mblen_byte(s[0])
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn mbbisearch(ucs: pg_wchar, table: &[mbinterval]) -> bool {
     let mut min = 0i32;
     let mut max = table.len() as i32 - 1;
     if ucs < table[0].first || ucs > table[max as usize].last {
         return false;

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (23086) panicked at crates/common/wchar/tests/c_parity.rs:242:5:
assertion `left == right` failed
  left: -1
 right: 4

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (23084) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 6 b 0
  left: -1
 right: 1

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (23089) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 3732108516685586712
 right: 3252569362715540940

failures:
    mblen_tables_match_c
    or_incomplete_edge_cases
    utf8_codepoint_walk_matches_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.42s

*** result: Failure(101)
