*** crates/common/wchar/src/lib.rs:503:38: replace - with / in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace - with / in mbbisearch
@@ -495,17 +495,17 @@
 
 pub fn pg_utf_mblen(s: &[u8]) -> i32 {
     pg_utf_mblen_byte(s[0])
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn mbbisearch(ucs: pg_wchar, table: &[mbinterval]) -> bool {
     let mut min = 0i32;
-    let mut max = table.len() as i32 - 1;
+    let mut max = table.len() as i32 / /* ~ changed by cargo-mutants ~ */ 1;
     if ucs < table[0].first || ucs > table[max as usize].last {
         return false;
     }
     while max >= min {
         let mid = (min + max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
             min = mid + 1;

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (23262) panicked at crates/common/wchar/src/lib.rs:504:38:
index out of bounds: the len is 334 but the index is 334

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (23268) panicked at crates/common/wchar/src/lib.rs:504:38:
index out of bounds: the len is 334 but the index is 334

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.30s

*** result: Failure(101)
