*** crates/common/wchar/src/lib.rs:504:12: replace < with > in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in mbbisearch
@@ -496,17 +496,17 @@
 pub fn pg_utf_mblen(s: &[u8]) -> i32 {
     pg_utf_mblen_byte(s[0])
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn mbbisearch(ucs: pg_wchar, table: &[mbinterval]) -> bool {
     let mut min = 0i32;
     let mut max = table.len() as i32 - 1;
-    if ucs < table[0].first || ucs > table[max as usize].last {
+    if ucs > /* ~ changed by cargo-mutants ~ */ table[0].first || ucs > table[max as usize].last {
         return false;
     }
     while max >= min {
         let mid = (min + max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
             min = mid + 1;
         } else if ucs < iv.first {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (23337) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 204
  left: 1
 right: 0

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (23343) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 494327278684119486
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
