*** crates/common/wchar/src/lib.rs:504:29: replace || with && in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace || with && in mbbisearch
@@ -496,17 +496,17 @@
 pub fn pg_utf_mblen(s: &[u8]) -> i32 {
     pg_utf_mblen_byte(s[0])
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn mbbisearch(ucs: pg_wchar, table: &[mbinterval]) -> bool {
     let mut min = 0i32;
     let mut max = table.len() as i32 - 1;
-    if ucs < table[0].first || ucs > table[max as usize].last {
+    if ucs < table[0].first && /* ~ changed by cargo-mutants ~ */ ucs > table[max as usize].last {
         return false;
     }
     while max >= min {
         let mid = (min + max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
             min = mid + 1;
         } else if ucs < iv.first {

*** result: Success
