*** crates/common/wchar/src/lib.rs:508:24: replace + with * in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace + with * in mbbisearch
@@ -500,17 +500,17 @@
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn mbbisearch(ucs: pg_wchar, table: &[mbinterval]) -> bool {
     let mut min = 0i32;
     let mut max = table.len() as i32 - 1;
     if ucs < table[0].first || ucs > table[max as usize].last {
         return false;
     }
     while max >= min {
-        let mid = (min + max) / 2;
+        let mid = (min * /* ~ changed by cargo-mutants ~ */ max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
             min = mid + 1;
         } else if ucs < iv.first {
             max = mid - 1;
         } else {
             return true;
         }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (23820) panicked at crates/common/wchar/src/lib.rs:509:18:
index out of bounds: the len is 334 but the index is 710

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (23836) panicked at crates/common/wchar/src/lib.rs:509:18:
index out of bounds: the len is 334 but the index is 710

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.30s

*** result: Failure(101)
