*** crates/common/wchar/src/lib.rs:511:23: replace + with - in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace + with - in mbbisearch
@@ -503,17 +503,17 @@
     let mut max = table.len() as i32 - 1;
     if ucs < table[0].first || ucs > table[max as usize].last {
         return false;
     }
     while max >= min {
         let mid = (min + max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
-            min = mid + 1;
+            min = mid - /* ~ changed by cargo-mutants ~ */ 1;
         } else if ucs < iv.first {
             max = mid - 1;
         } else {
             return true;
         }
     }
     false
 }

*** result: Timeout
