*** crates/common/wchar/src/lib.rs:512:23: replace < with == in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with == in mbbisearch
@@ -504,17 +504,17 @@
     if ucs < table[0].first || ucs > table[max as usize].last {
         return false;
     }
     while max >= min {
         let mid = (min + max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
             min = mid + 1;
-        } else if ucs < iv.first {
+        } else if ucs == /* ~ changed by cargo-mutants ~ */ iv.first {
             max = mid - 1;
         } else {
             return true;
         }
     }
     false
 }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (24075) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 195
  left: 0
 right: 1

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (24081) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 2399472560433167864
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
