*** crates/common/wchar/src/lib.rs:513:23: replace - with / in mbbisearch

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace - with / in mbbisearch
@@ -505,17 +505,17 @@
         return false;
     }
     while max >= min {
         let mid = (min + max) / 2;
         let iv = table[mid as usize];
         if ucs > iv.last {
             min = mid + 1;
         } else if ucs < iv.first {
-            max = mid - 1;
+            max = mid / /* ~ changed by cargo-mutants ~ */ 1;
         } else {
             return true;
         }
     }
     false
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.

*** result: Timeout
