*** crates/common/wchar/src/lib.rs:523:12: replace == with != in ucs_wcwidth

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in ucs_wcwidth
@@ -515,17 +515,17 @@
             return true;
         }
     }
     false
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn ucs_wcwidth(ucs: pg_wchar) -> i32 {
-    if ucs == 0 {
+    if ucs != /* ~ changed by cargo-mutants ~ */ 0 {
         return 0;
     }
     if ucs < 0x20 || (0x7f..0xa0).contains(&ucs) || ucs > 0x10ffff {
         return -1;
     }
     if mbbisearch(ucs, &NONSPACING) {
         return 0;
     }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (24467) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 0
  left: -1
 right: 0

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (24473) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 754130978109024629
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
