*** crates/common/wchar/src/lib.rs:523:5: replace ucs_wcwidth -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace ucs_wcwidth -> i32 with -1
@@ -515,29 +515,17 @@
             return true;
         }
     }
     false
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn ucs_wcwidth(ucs: pg_wchar) -> i32 {
-    if ucs == 0 {
-        return 0;
-    }
-    if ucs < 0x20 || (0x7f..0xa0).contains(&ucs) || ucs > 0x10ffff {
-        return -1;
-    }
-    if mbbisearch(ucs, &NONSPACING) {
-        return 0;
-    }
-    if mbbisearch(ucs, &EAST_ASIAN_FW) {
-        return 2;
-    }
-    1
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_utf_dsplen(s: &[u8]) -> i32 {
     ucs_wcwidth(utf8_to_unicode(s))
 }
 
 fn pg_mule2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (24418) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 0
  left: -1
 right: 0

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (24424) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 16226540275744505561
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
