*** crates/common/wchar/src/lib.rs:526:57: replace > with >= in ucs_wcwidth

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with >= in ucs_wcwidth
@@ -518,17 +518,17 @@
     false
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn ucs_wcwidth(ucs: pg_wchar) -> i32 {
     if ucs == 0 {
         return 0;
     }
-    if ucs < 0x20 || (0x7f..0xa0).contains(&ucs) || ucs > 0x10ffff {
+    if ucs < 0x20 || (0x7f..0xa0).contains(&ucs) || ucs >= /* ~ changed by cargo-mutants ~ */ 0x10ffff {
         return -1;
     }
     if mbbisearch(ucs, &NONSPACING) {
         return 0;
     }
     if mbbisearch(ucs, &EAST_ASIAN_FW) {
         return 2;
     }

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (24898) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 10378047756404032577
 right: 3252569362715540940

failures:
    utf8_codepoint_walk_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
