*** crates/common/wchar/src/lib.rs:527:16: delete - in ucs_wcwidth

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in ucs_wcwidth
@@ -519,17 +519,17 @@
 }
 
 // pub (visibility only) for the proofs/utf8 Kani equivalence harnesses.
 pub fn ucs_wcwidth(ucs: pg_wchar) -> i32 {
     if ucs == 0 {
         return 0;
     }
     if ucs < 0x20 || (0x7f..0xa0).contains(&ucs) || ucs > 0x10ffff {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     if mbbisearch(ucs, &NONSPACING) {
         return 0;
     }
     if mbbisearch(ucs, &EAST_ASIAN_FW) {
         return 2;
     }
     1

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (24909) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 1
  left: 1
 right: -1

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (24915) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 9907985568682063236
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
