*** crates/common/wchar/src/lib.rs:539:5: replace pg_utf_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_utf_dsplen -> i32 with 1
@@ -531,17 +531,17 @@
     }
     if mbbisearch(ucs, &EAST_ASIAN_FW) {
         return 2;
     }
     1
 }
 
 fn pg_utf_dsplen(s: &[u8]) -> i32 {
-    ucs_wcwidth(utf8_to_unicode(s))
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_mule2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (25039) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 6 b 0
  left: 1
 right: 0

---- utf8_codepoint_walk_matches_c stdout ----

thread 'utf8_codepoint_walk_matches_c' (25045) panicked at crates/common/wchar/tests/c_parity.rs:154:5:
assertion `left == right` failed
  left: 13851358903305871732
 right: 3252569362715540940

failures:
    dsplen_tables_match_c
    utf8_codepoint_walk_matches_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
