*** crates/common/wchar/src/lib.rs:543:5: replace pg_mule2wchar_with_len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_mule2wchar_with_len -> i32 with 1
@@ -535,72 +535,17 @@
     1
 }
 
 fn pg_utf_dsplen(s: &[u8]) -> i32 {
     ucs_wcwidth(utf8_to_unicode(s))
 }
 
 fn pg_mule2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        let b = from[fi];
-        if is_lc1(b) {
-            if len < 2 {
-                break;
-            }
-            to[ti] = (from[fi] as u32) << 16;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 2;
-        } else if is_lcprv1(b) {
-            if len < 3 {
-                break;
-            }
-            fi += 1;
-            to[ti] = (from[fi] as u32) << 16;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 3;
-        } else if is_lc2(b) {
-            if len < 3 {
-                break;
-            }
-            to[ti] = (from[fi] as u32) << 16;
-            fi += 1;
-            to[ti] |= (from[fi] as u32) << 8;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 3;
-        } else if is_lcprv2(b) {
-            if len < 4 {
-                break;
-            }
-            fi += 1;
-            to[ti] = (from[fi] as u32) << 16;
-            fi += 1;
-            to[ti] |= (from[fi] as u32) << 8;
-            fi += 1;
-            to[ti] |= from[fi] as u32;
-            fi += 1;
-            len -= 4;
-        } else {
-            to[ti] = from[fi] as pg_wchar;
-            fi += 1;
-            len -= 1;
-        }
-        ti += 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn is_lc1(b: u8) -> bool {
     (0x81..=0x8d).contains(&b)
 }
 
 #[inline(always)]

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (25188) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 7
  left: 16247039651405997125
 right: 4694492117092106448

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.24s

*** result: Failure(101)
