*** crates/common/wchar/src/lib.rs:549:20: replace < with > in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_mule2wchar_with_len
@@ -541,17 +541,17 @@
 
 fn pg_mule2wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];
         if is_lc1(b) {
-            if len < 2 {
+            if len > /* ~ changed by cargo-mutants ~ */ 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else if is_lcprv1(b) {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (25547) panicked at crates/common/wchar/src/lib.rs:554:23:
index out of bounds: the len is 2 but the index is 2

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
