*** crates/common/wchar/src/lib.rs:552:40: replace << with >> in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace << with >> in pg_mule2wchar_with_len
@@ -544,17 +544,17 @@
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         let b = from[fi];
         if is_lc1(b) {
             if len < 2 {
                 break;
             }
-            to[ti] = (from[fi] as u32) << 16;
+            to[ti] = (from[fi] as u32) >> /* ~ changed by cargo-mutants ~ */ 16;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else if is_lcprv1(b) {
             if len < 3 {
                 break;
             }

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (25646) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 7
  left: 17247520062801570945
 right: 4694492117092106448

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
