*** crates/common/wchar/src/lib.rs:556:17: replace -= with /= in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with /= in pg_mule2wchar_with_len
@@ -548,17 +548,17 @@
         if is_lc1(b) {
             if len < 2 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
-            len -= 2;
+            len /= /* ~ changed by cargo-mutants ~ */ 2;
         } else if is_lcprv1(b) {
             if len < 3 {
                 break;
             }
             fi += 1;
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= from[fi] as u32;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (25988) panicked at crates/common/wchar/src/lib.rs:546:22:
index out of bounds: the len is 4 but the index is 4

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
