*** crates/common/wchar/src/lib.rs:558:20: replace < with > in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_mule2wchar_with_len
@@ -550,17 +550,17 @@
                 break;
             }
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 2;
         } else if is_lcprv1(b) {
-            if len < 3 {
+            if len > /* ~ changed by cargo-mutants ~ */ 3 {
                 break;
             }
             fi += 1;
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (26087) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 7
  left: 16633196154689038925
 right: 4694492117092106448

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
