*** crates/common/wchar/src/lib.rs:55:14: replace >= with < in pg_valid_encoding

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace >= with < in pg_valid_encoding
@@ -47,17 +47,17 @@
 pub const PG_JOHAB: pg_enc = 40;
 pub const PG_SHIFT_JIS_2004: pg_enc = 41;
 pub const _PG_LAST_ENCODING_: pg_enc = 42;
 
 pub const PG_ENCODING_BE_LAST: pg_enc = PG_KOI8U;
 pub const MAX_MULTIBYTE_CHAR_LEN: i32 = 4;
 
 pub const fn pg_valid_encoding(encoding: pg_enc) -> bool {
-    encoding >= 0 && encoding < _PG_LAST_ENCODING_
+    encoding < /* ~ changed by cargo-mutants ~ */ 0 && encoding < _PG_LAST_ENCODING_
 }
 
 pub const fn pg_valid_be_encoding(encoding: pg_enc) -> bool {
     encoding >= 0 && encoding <= PG_ENCODING_BE_LAST
 }
 
 pub const fn pg_valid_fe_encoding(encoding: pg_enc) -> bool {
     pg_valid_encoding(encoding)

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (504) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 1 b 128
  left: 1
 right: 2

---- max_length_matches_c stdout ----

thread 'max_length_matches_c' (505) panicked at crates/common/wchar/src/lib.rs:1384:5:
assertion failed: pg_valid_encoding(encoding)

---- set_invalid_matches_c stdout ----

thread 'set_invalid_matches_c' (515) panicked at crates/common/wchar/src/lib.rs:1384:5:
assertion failed: pg_valid_encoding(encoding)

failures:
    dsplen_tables_match_c
    max_length_matches_c
    mblen_tables_match_c
    or_incomplete_edge_cases
    set_invalid_matches_c
    utf8_codepoint_walk_matches_c
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 2 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.84s

*** result: Failure(101)
