*** crates/common/wchar/src/lib.rs:568:20: replace < with == in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with == in pg_mule2wchar_with_len
@@ -560,17 +560,17 @@
             }
             fi += 1;
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_lc2(b) {
-            if len < 3 {
+            if len == /* ~ changed by cargo-mutants ~ */ 3 {
                 break;
             }
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (26675) panicked at crates/common/wchar/src/lib.rs:573:24:
index out of bounds: the len is 3 but the index is 3

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
