*** crates/common/wchar/src/lib.rs:579:20: replace < with == in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with == in pg_mule2wchar_with_len
@@ -571,17 +571,17 @@
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_lcprv2(b) {
-            if len < 4 {
+            if len == /* ~ changed by cargo-mutants ~ */ 4 {
                 break;
             }
             fi += 1;
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (27410) panicked at crates/common/wchar/src/lib.rs:585:24:
index out of bounds: the len is 3 but the index is 3

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
