*** crates/common/wchar/src/lib.rs:579:20: replace < with <= in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_mule2wchar_with_len
@@ -571,17 +571,17 @@
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
             len -= 3;
         } else if is_lcprv2(b) {
-            if len < 4 {
+            if len <= /* ~ changed by cargo-mutants ~ */ 4 {
                 break;
             }
             fi += 1;
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;

*** result: Success
