*** crates/common/wchar/src/lib.rs:589:17: replace -= with += in pg_mule2wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with += in pg_mule2wchar_with_len
@@ -581,17 +581,17 @@
             }
             fi += 1;
             to[ti] = (from[fi] as u32) << 16;
             fi += 1;
             to[ti] |= (from[fi] as u32) << 8;
             fi += 1;
             to[ti] |= from[fi] as u32;
             fi += 1;
-            len -= 4;
+            len += /* ~ changed by cargo-mutants ~ */ 4;
         } else {
             to[ti] = from[fi] as pg_wchar;
             fi += 1;
             len -= 1;
         }
         ti += 1;
     }
     to[ti] = 0;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (28148) panicked at crates/common/wchar/src/lib.rs:546:22:
index out of bounds: the len is 33 but the index is 33

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
