*** crates/common/wchar/src/lib.rs:603:5: replace is_lc1 -> bool with true

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_lc1 -> bool with true
@@ -595,17 +595,17 @@
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 #[inline(always)]
 fn is_lc1(b: u8) -> bool {
-    (0x81..=0x8d).contains(&b)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn is_lc2(b: u8) -> bool {
     (0x90..=0x99).contains(&b)
 }
 
 #[inline(always)]

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (28571) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 7 b 144
  left: 1
 right: 2

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (28574) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 0
  left: 2
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (28582) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 25 enc 7
  left: 64
 right: 60

failures:
    dsplen_tables_match_c
    mb2wchar_matches_c
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 5 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
