*** crates/common/wchar/src/lib.rs:603:5: replace is_lc1 -> bool with false

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_lc1 -> bool with false
@@ -595,17 +595,17 @@
         ti += 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 #[inline(always)]
 fn is_lc1(b: u8) -> bool {
-    (0x81..=0x8d).contains(&b)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn is_lc2(b: u8) -> bool {
     (0x90..=0x99).contains(&b)
 }
 
 #[inline(always)]

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (28590) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 129
  left: 1
 right: 2

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (28598) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 236 enc 7
  left: 2
 right: 1

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (28589) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 7
  left: 8879500540120844637
 right: 4694492117092106448

failures:
    mb2wchar_matches_c
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 6 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
