*** crates/common/wchar/src/lib.rs:608:5: replace is_lc2 -> bool with false

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_lc2 -> bool with false
@@ -600,17 +600,17 @@
 
 #[inline(always)]
 fn is_lc1(b: u8) -> bool {
     (0x81..=0x8d).contains(&b)
 }
 
 #[inline(always)]
 fn is_lc2(b: u8) -> bool {
-    (0x90..=0x99).contains(&b)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn is_lcprv1(b: u8) -> bool {
     b == LCPRV1_A || b == LCPRV1_B
 }
 
 #[inline(always)]

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (28717) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 7 b 144
  left: 1
 right: 2

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (28720) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 144
  left: 1
 right: 3

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (28728) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 27 enc 7
  left: 1024
 right: 1021

failures:
    dsplen_tables_match_c
    mb2wchar_matches_c
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c
    wchar2mb_matches_c

test result: FAILED. 5 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
