*** crates/common/wchar/src/lib.rs:613:19: replace || with && in is_lcprv1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace || with && in is_lcprv1
@@ -605,17 +605,17 @@
 
 #[inline(always)]
 fn is_lc2(b: u8) -> bool {
     (0x90..=0x99).contains(&b)
 }
 
 #[inline(always)]
 fn is_lcprv1(b: u8) -> bool {
-    b == LCPRV1_A || b == LCPRV1_B
+    b == LCPRV1_A && /* ~ changed by cargo-mutants ~ */ b == LCPRV1_B
 }
 
 #[inline(always)]
 fn is_lcprv2(b: u8) -> bool {
     b == LCPRV2_A || b == LCPRV2_B
 }
 
 fn pg_wchar2mule_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (28867) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 154
  left: 1
 right: 3

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (28875) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 25 enc 7
  left: 61
 right: 60

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (28866) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 7
  left: 14870046224479914051
 right: 4694492117092106448

failures:
    mb2wchar_matches_c
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
