*** crates/common/wchar/src/lib.rs:613:7: replace == with != in is_lcprv1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in is_lcprv1
@@ -605,17 +605,17 @@
 
 #[inline(always)]
 fn is_lc2(b: u8) -> bool {
     (0x90..=0x99).contains(&b)
 }
 
 #[inline(always)]
 fn is_lcprv1(b: u8) -> bool {
-    b == LCPRV1_A || b == LCPRV1_B
+    b != /* ~ changed by cargo-mutants ~ */ LCPRV1_A || b == LCPRV1_B
 }
 
 #[inline(always)]
 fn is_lcprv2(b: u8) -> bool {
     b == LCPRV2_A || b == LCPRV2_B
 }
 
 fn pg_wchar2mule_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (28881) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 7 b 144
  left: 1
 right: 2

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (28884) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 0
  left: 3
 right: 1

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (28883) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 7
  left: 10211436157953183024
 right: 4694492117092106448

failures:
    dsplen_tables_match_c
    mb2wchar_matches_c
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 6 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.56s

*** result: Failure(101)
