*** crates/common/wchar/src/lib.rs:618:7: replace == with != in is_lcprv2

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in is_lcprv2
@@ -610,17 +610,17 @@
 
 #[inline(always)]
 fn is_lcprv1(b: u8) -> bool {
     b == LCPRV1_A || b == LCPRV1_B
 }
 
 #[inline(always)]
 fn is_lcprv2(b: u8) -> bool {
-    b == LCPRV2_A || b == LCPRV2_B
+    b != /* ~ changed by cargo-mutants ~ */ LCPRV2_A || b == LCPRV2_B
 }
 
 fn pg_wchar2mule_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (29158) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 7 b 0
  left: 2
 right: 1

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (29161) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 0
  left: 4
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (29169) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 25 enc 7
  left: 64
 right: 60

failures:
    dsplen_tables_match_c
    mb2wchar_matches_c
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 6 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
