*** crates/common/wchar/src/lib.rs:626:19: replace && with || in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace && with || in pg_wchar2mule_with_len
@@ -618,17 +618,17 @@
     b == LCPRV2_A || b == LCPRV2_B
 }
 
 fn pg_wchar2mule_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
-    while len > 0 && from[fi] != 0 {
+    while len > 0 || /* ~ changed by cargo-mutants ~ */ from[fi] != 0 {
         let w = from[fi];
         let lb = (w >> 16) as u8;
         if is_lc1(lb) {
             to[ti] = lb;
             to[ti + 1] = w as u8;
             ti += 2;
             cnt += 2;
         } else if is_lc2(lb) {

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (29382) panicked at crates/common/wchar/src/lib.rs:626:57:
index out of bounds: the len is 128 but the index is 128

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
