*** crates/common/wchar/src/lib.rs:628:21: replace >> with << in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace >> with << in pg_wchar2mule_with_len
@@ -620,17 +620,17 @@
 
 fn pg_wchar2mule_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {
         let w = from[fi];
-        let lb = (w >> 16) as u8;
+        let lb = (w << /* ~ changed by cargo-mutants ~ */ 16) as u8;
         if is_lc1(lb) {
             to[ti] = lb;
             to[ti + 1] = w as u8;
             ti += 2;
             cnt += 2;
         } else if is_lc2(lb) {
             to[ti] = lb;
             to[ti + 1] = (w >> 8) as u8;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (29627) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 7
  left: 530525522686060325
 right: 3133501182798477778

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
