*** crates/common/wchar/src/lib.rs:632:16: replace += with -= in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_wchar2mule_with_len
@@ -624,17 +624,17 @@
     let mut ti = 0;
     let mut cnt = 0i32;
     while len > 0 && from[fi] != 0 {
         let w = from[fi];
         let lb = (w >> 16) as u8;
         if is_lc1(lb) {
             to[ti] = lb;
             to[ti + 1] = w as u8;
-            ti += 2;
+            ti -= /* ~ changed by cargo-mutants ~ */ 2;
             cnt += 2;
         } else if is_lc2(lb) {
             to[ti] = lb;
             to[ti + 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (0xa0..=0xdf).contains(&lb) {

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (29774) panicked at crates/common/wchar/src/lib.rs:632:13:
attempt to subtract with overflow

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
