*** crates/common/wchar/src/lib.rs:636:19: replace + with - in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace + with - in pg_wchar2mule_with_len
@@ -628,17 +628,17 @@
         let lb = (w >> 16) as u8;
         if is_lc1(lb) {
             to[ti] = lb;
             to[ti + 1] = w as u8;
             ti += 2;
             cnt += 2;
         } else if is_lc2(lb) {
             to[ti] = lb;
-            to[ti + 1] = (w >> 8) as u8;
+            to[ti - /* ~ changed by cargo-mutants ~ */ 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (0xa0..=0xdf).contains(&lb) {
             to[ti] = LCPRV1_A;
             to[ti + 1] = lb;
             to[ti + 2] = w as u8;
             ti += 3;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (29970) panicked at crates/common/wchar/src/lib.rs:636:16:
attempt to subtract with overflow

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
