*** crates/common/wchar/src/lib.rs:638:16: replace += with *= in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2mule_with_len
@@ -630,17 +630,17 @@
             to[ti] = lb;
             to[ti + 1] = w as u8;
             ti += 2;
             cnt += 2;
         } else if is_lc2(lb) {
             to[ti] = lb;
             to[ti + 1] = (w >> 8) as u8;
             to[ti + 2] = w as u8;
-            ti += 3;
+            ti *= /* ~ changed by cargo-mutants ~ */ 3;
             cnt += 3;
         } else if (0xa0..=0xdf).contains(&lb) {
             to[ti] = LCPRV1_A;
             to[ti + 1] = lb;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (0xe0..=0xef).contains(&lb) {

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (30264) panicked at crates/common/wchar/src/lib.rs:667:13:
index out of bounds: the len is 513 but the index is 984

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
