*** crates/common/wchar/src/lib.rs:645:17: replace += with -= in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_wchar2mule_with_len
@@ -637,17 +637,17 @@
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (0xa0..=0xdf).contains(&lb) {
             to[ti] = LCPRV1_A;
             to[ti + 1] = lb;
             to[ti + 2] = w as u8;
             ti += 3;
-            cnt += 3;
+            cnt -= /* ~ changed by cargo-mutants ~ */ 3;
         } else if (0xe0..=0xef).contains(&lb) {
             to[ti] = LCPRV1_B;
             to[ti + 1] = lb;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (0xf0..=0xf4).contains(&lb) {
             to[ti] = LCPRV2_A;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (30705) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 7
  left: 11927994510431667734
 right: 3133501182798477778

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
