*** crates/common/wchar/src/lib.rs:655:19: replace + with * in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace + with * in pg_wchar2mule_with_len
@@ -647,17 +647,17 @@
             to[ti] = LCPRV1_B;
             to[ti + 1] = lb;
             to[ti + 2] = w as u8;
             ti += 3;
             cnt += 3;
         } else if (0xf0..=0xf4).contains(&lb) {
             to[ti] = LCPRV2_A;
             to[ti + 1] = lb;
-            to[ti + 2] = (w >> 8) as u8;
+            to[ti * /* ~ changed by cargo-mutants ~ */ 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
             ti += 4;
             cnt += 4;
         } else if (0xf5..=0xfe).contains(&lb) {
             to[ti] = LCPRV2_B;
             to[ti + 1] = lb;
             to[ti + 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (31420) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 7
  left: 10211530456899718203
 right: 3133501182798477778

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.29s

*** result: Failure(101)
