*** crates/common/wchar/src/lib.rs:662:19: replace + with - in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace + with - in pg_wchar2mule_with_len
@@ -654,17 +654,17 @@
             to[ti + 1] = lb;
             to[ti + 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
             ti += 4;
             cnt += 4;
         } else if (0xf5..=0xfe).contains(&lb) {
             to[ti] = LCPRV2_B;
             to[ti + 1] = lb;
-            to[ti + 2] = (w >> 8) as u8;
+            to[ti - /* ~ changed by cargo-mutants ~ */ 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
             ti += 4;
             cnt += 4;
         } else {
             to[ti] = w as u8;
             ti += 1;
             cnt += 1;
         }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (31832) panicked at crates/common/wchar/src/lib.rs:662:16:
attempt to subtract with overflow

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
