*** crates/common/wchar/src/lib.rs:664:16: replace += with *= in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2mule_with_len
@@ -656,17 +656,17 @@
             to[ti + 3] = w as u8;
             ti += 4;
             cnt += 4;
         } else if (0xf5..=0xfe).contains(&lb) {
             to[ti] = LCPRV2_B;
             to[ti + 1] = lb;
             to[ti + 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
-            ti += 4;
+            ti *= /* ~ changed by cargo-mutants ~ */ 4;
             cnt += 4;
         } else {
             to[ti] = w as u8;
             ti += 1;
             cnt += 1;
         }
         fi += 1;
         len -= 1;

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (32224) panicked at crates/common/wchar/src/lib.rs:667:13:
index out of bounds: the len is 513 but the index is 576

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.43s

*** result: Failure(101)
