*** crates/common/wchar/src/lib.rs:669:17: replace += with *= in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2mule_with_len
@@ -661,17 +661,17 @@
             to[ti + 1] = lb;
             to[ti + 2] = (w >> 8) as u8;
             to[ti + 3] = w as u8;
             ti += 4;
             cnt += 4;
         } else {
             to[ti] = w as u8;
             ti += 1;
-            cnt += 1;
+            cnt *= /* ~ changed by cargo-mutants ~ */ 1;
         }
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (32420) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 7
  left: 8625512473950355778
 right: 3133501182798477778

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.48s

*** result: Failure(101)
