*** crates/common/wchar/src/lib.rs:672:13: replace -= with /= in pg_wchar2mule_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace -= with /= in pg_wchar2mule_with_len
@@ -664,17 +664,17 @@
             ti += 4;
             cnt += 4;
         } else {
             to[ti] = w as u8;
             ti += 1;
             cnt += 1;
         }
         fi += 1;
-        len -= 1;
+        len /= /* ~ changed by cargo-mutants ~ */ 1;
     }
     to[ti] = 0;
     cnt
 }
 
 pub fn pg_mule_mblen(s: &[u8]) -> i32 {
     let b = s[0];
     if is_lc1(b) {

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (32598) panicked at crates/common/wchar/src/lib.rs:626:22:
index out of bounds: the len is 128 but the index is 128

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
