*** crates/common/wchar/src/lib.rs:679:5: replace pg_mule_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_mule_mblen -> i32 with 0
@@ -671,28 +671,17 @@
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 pub fn pg_mule_mblen(s: &[u8]) -> i32 {
-    let b = s[0];
-    if is_lc1(b) {
-        2
-    } else if is_lcprv1(b) {
-        3
-    } else if is_lc2(b) {
-        3
-    } else if is_lcprv2(b) {
-        4
-    } else {
-        1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_mule_dsplen(s: &[u8]) -> i32 {
     let b = s[0];
     if is_lc1(b) {
         1
     } else if is_lcprv1(b) {
         1

*** result: Timeout
