*** crates/common/wchar/src/lib.rs:679:5: replace pg_mule_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_mule_mblen -> i32 with -1
@@ -671,28 +671,17 @@
         fi += 1;
         len -= 1;
     }
     to[ti] = 0;
     cnt
 }
 
 pub fn pg_mule_mblen(s: &[u8]) -> i32 {
-    let b = s[0];
-    if is_lc1(b) {
-        2
-    } else if is_lcprv1(b) {
-        3
-    } else if is_lc2(b) {
-        3
-    } else if is_lcprv2(b) {
-        4
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_mule_dsplen(s: &[u8]) -> i32 {
     let b = s[0];
     if is_lc1(b) {
         1
     } else if is_lcprv1(b) {
         1

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (32777) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 7 b 0
  left: -1
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (32800) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 7
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (32798) panicked at crates/common/wchar/src/lib.rs:950:28:
index out of bounds: the len is 1 but the index is 1

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.63s

*** result: Failure(101)
