*** crates/common/wchar/src/lib.rs:67:14: replace > with >= in pg_encoding_is_client_only

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace > with >= in pg_encoding_is_client_only
@@ -59,17 +59,17 @@
     encoding >= 0 && encoding <= PG_ENCODING_BE_LAST
 }
 
 pub const fn pg_valid_fe_encoding(encoding: pg_enc) -> bool {
     pg_valid_encoding(encoding)
 }
 
 pub const fn pg_encoding_is_client_only(encoding: pg_enc) -> bool {
-    encoding > PG_ENCODING_BE_LAST && encoding < _PG_LAST_ENCODING_
+    encoding >= /* ~ changed by cargo-mutants ~ */ PG_ENCODING_BE_LAST && encoding < _PG_LAST_ENCODING_
 }
 
 #[derive(Clone, Copy, PartialEq, Eq, Debug)]
 pub struct mbinterval {
     pub first: u32,
     pub last: u32,
 }

*** result: Success
