*** crates/common/wchar/src/lib.rs:694:5: replace pg_mule_dsplen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_mule_dsplen -> i32 with -1
@@ -686,28 +686,17 @@
     } else if is_lcprv2(b) {
         4
     } else {
         1
     }
 }
 
 fn pg_mule_dsplen(s: &[u8]) -> i32 {
-    let b = s[0];
-    if is_lc1(b) {
-        1
-    } else if is_lcprv1(b) {
-        1
-    } else if is_lc2(b) {
-        2
-    } else if is_lcprv2(b) {
-        2
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_latin12wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         to[ti] = from[fi] as pg_wchar;

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (32894) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 7 b 0
  left: -1
 right: 1

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
