*** crates/common/wchar/src/lib.rs:709:5: replace pg_latin12wchar_with_len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_latin12wchar_with_len -> i32 with 1
@@ -701,27 +701,17 @@
     } else if is_lcprv2(b) {
         2
     } else {
         1
     }
 }
 
 fn pg_latin12wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        to[ti] = from[fi] as pg_wchar;
-        fi += 1;
-        ti += 1;
-        len -= 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_wchar2single_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         to[ti] = from[fi] as u8;

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (33034) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 8
  left: 16247039651405997125
 right: 2878253948976624651

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
