*** crates/common/wchar/src/lib.rs:714:12: replace += with *= in pg_latin12wchar_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_latin12wchar_with_len
@@ -706,17 +706,17 @@
 }
 
 fn pg_latin12wchar_with_len(from: &[u8], to: &mut [pg_wchar]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         to[ti] = from[fi] as pg_wchar;
-        fi += 1;
+        fi *= /* ~ changed by cargo-mutants ~ */ 1;
         ti += 1;
         len -= 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_wchar2single_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {

---- mb2wchar_matches_c stdout ----

thread 'mb2wchar_matches_c' (33390) panicked at crates/common/wchar/tests/c_parity.rs:184:9:
assertion `left == right` failed: enc 8
  left: 14842134392122751869
 right: 2878253948976624651

failures:
    mb2wchar_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
