*** crates/common/wchar/src/lib.rs:723:5: replace pg_wchar2single_with_len -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_wchar2single_with_len -> i32 with 1
@@ -715,27 +715,17 @@
         ti += 1;
         len -= 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_wchar2single_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
-    let mut len = from.len();
-    let mut fi = 0;
-    let mut ti = 0;
-    while len > 0 && from[fi] != 0 {
-        to[ti] = from[fi] as u8;
-        fi += 1;
-        ti += 1;
-        len -= 1;
-    }
-    to[ti] = 0;
-    ti as i32
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_latin1_mblen(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_latin1_dsplen(s: &[u8]) -> i32 {
     pg_ascii_dsplen(s)

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (33694) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 0
  left: 10218339290833013029
 right: 530525522686060325

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
