*** crates/common/wchar/src/lib.rs:728:12: replace += with *= in pg_wchar2single_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with *= in pg_wchar2single_with_len
@@ -720,17 +720,17 @@
 }
 
 fn pg_wchar2single_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         to[ti] = from[fi] as u8;
-        fi += 1;
+        fi *= /* ~ changed by cargo-mutants ~ */ 1;
         ti += 1;
         len -= 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_latin1_mblen(_s: &[u8]) -> i32 {

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (34088) panicked at crates/common/wchar/tests/c_parity.rs:223:9:
assertion `left == right` failed: enc 0
  left: 8797963615149968165
 right: 530525522686060325

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.34s

*** result: Failure(101)
