*** crates/common/wchar/src/lib.rs:729:12: replace += with -= in pg_wchar2single_with_len

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace += with -= in pg_wchar2single_with_len
@@ -721,17 +721,17 @@
 
 fn pg_wchar2single_with_len(from: &[pg_wchar], to: &mut [u8]) -> i32 {
     let mut len = from.len();
     let mut fi = 0;
     let mut ti = 0;
     while len > 0 && from[fi] != 0 {
         to[ti] = from[fi] as u8;
         fi += 1;
-        ti += 1;
+        ti -= /* ~ changed by cargo-mutants ~ */ 1;
         len -= 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_latin1_mblen(_s: &[u8]) -> i32 {
     1

---- wchar2mb_matches_c stdout ----

thread 'wchar2mb_matches_c' (34135) panicked at crates/common/wchar/src/lib.rs:729:9:
attempt to subtract with overflow

failures:
    wchar2mb_matches_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
