*** crates/common/wchar/src/lib.rs:737:5: replace pg_latin1_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_latin1_mblen -> i32 with -1
@@ -729,17 +729,17 @@
         ti += 1;
         len -= 1;
     }
     to[ti] = 0;
     ti as i32
 }
 
 fn pg_latin1_mblen(_s: &[u8]) -> i32 {
-    1
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_latin1_dsplen(s: &[u8]) -> i32 {
     pg_ascii_dsplen(s)
 }
 
 fn pg_sjis_mblen(s: &[u8]) -> i32 {
     if (0xa1..=0xdf).contains(&s[0]) {

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (34403) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 8 b 0
  left: -1
 right: 1

failures:
    mblen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.35s

*** result: Failure(101)
