*** crates/common/wchar/src/lib.rs:741:5: replace pg_latin1_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_latin1_dsplen -> i32 with 1
@@ -733,17 +733,17 @@
     ti as i32
 }
 
 fn pg_latin1_mblen(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_latin1_dsplen(s: &[u8]) -> i32 {
-    pg_ascii_dsplen(s)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_sjis_mblen(s: &[u8]) -> i32 {
     if (0xa1..=0xdf).contains(&s[0]) {
         1
     } else if is_highbit_set(s[0]) {
         2
     } else {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (34535) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 8 b 0
  left: 1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
