*** crates/common/wchar/src/lib.rs:745:5: replace pg_sjis_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_sjis_mblen -> i32 with 0
@@ -737,23 +737,17 @@
     1
 }
 
 fn pg_latin1_dsplen(s: &[u8]) -> i32 {
     pg_ascii_dsplen(s)
 }
 
 fn pg_sjis_mblen(s: &[u8]) -> i32 {
-    if (0xa1..=0xdf).contains(&s[0]) {
-        1
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_sjis_dsplen(s: &[u8]) -> i32 {
     if (0xa1..=0xdf).contains(&s[0]) {
         1
     } else if is_highbit_set(s[0]) {
         2
     } else {

*** result: Timeout
