*** crates/common/wchar/src/lib.rs:745:5: replace pg_sjis_mblen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_sjis_mblen -> i32 with 1
@@ -737,23 +737,17 @@
     1
 }
 
 fn pg_latin1_dsplen(s: &[u8]) -> i32 {
     pg_ascii_dsplen(s)
 }
 
 fn pg_sjis_mblen(s: &[u8]) -> i32 {
-    if (0xa1..=0xdf).contains(&s[0]) {
-        1
-    } else if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_sjis_dsplen(s: &[u8]) -> i32 {
     if (0xa1..=0xdf).contains(&s[0]) {
         1
     } else if is_highbit_set(s[0]) {
         2
     } else {

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (34655) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 35 b 128
  left: 1
 right: 2

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (34673) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 35
  left: 16
 right: 14

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (34671) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 35
  left: 1677996718092854053
 right: 17553182011663015525

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.27s

*** result: Failure(101)
