*** crates/common/wchar/src/lib.rs:781:5: replace pg_gbk_mblen -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gbk_mblen -> i32 with -1
@@ -773,21 +773,17 @@
     if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn pg_gbk_mblen(s: &[u8]) -> i32 {
-    if is_highbit_set(s[0]) {
-        2
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gbk_dsplen(s: &[u8]) -> i32 {
     if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (35253) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 37 b 0
  left: -1
 right: 1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (35261) panicked at crates/common/wchar/src/lib.rs:1031:12:
index out of bounds: the len is 5 but the index is 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (35260) panicked at crates/common/wchar/src/lib.rs:1031:12:
index out of bounds: the len is 1 but the index is 1

failures:
    mblen_tables_match_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 8 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.47s

*** result: Failure(101)
