*** crates/common/wchar/src/lib.rs:789:5: replace pg_gbk_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gbk_dsplen -> i32 with 1
@@ -781,21 +781,17 @@
     if is_highbit_set(s[0]) {
         2
     } else {
         1
     }
 }
 
 fn pg_gbk_dsplen(s: &[u8]) -> i32 {
-    if is_highbit_set(s[0]) {
-        2
-    } else {
-        pg_ascii_dsplen(s)
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_uhc_mblen(s: &[u8]) -> i32 {
     if is_highbit_set(s[0]) {
         2
     } else {
         1
     }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (35348) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 37 b 0
  left: 1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
