*** crates/common/wchar/src/lib.rs:805:5: replace pg_uhc_dsplen -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_uhc_dsplen -> i32 with 1
@@ -797,21 +797,17 @@
     if is_highbit_set(s[0]) {
         2
     } else {
         1
     }
 }
 
 fn pg_uhc_dsplen(s: &[u8]) -> i32 {
-    if is_highbit_set(s[0]) {
-        2
-    } else {
-        pg_ascii_dsplen(s)
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Like the C, reads `s[1]` when the high bit is set — callers must supply the
 /// lookahead byte or use [`pg_encoding_mblen_or_incomplete`].
 fn pg_gb18030_mblen(s: &[u8]) -> i32 {
     if !is_highbit_set(s[0]) {
         1
     } else if (0x30..=0x39).contains(&s[1]) {

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (35675) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 38 b 0
  left: 1
 right: 0

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
