*** crates/common/wchar/src/lib.rs:815:5: replace pg_gb18030_mblen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gb18030_mblen -> i32 with 0
@@ -807,23 +807,17 @@
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 /// Like the C, reads `s[1]` when the high bit is set — callers must supply the
 /// lookahead byte or use [`pg_encoding_mblen_or_incomplete`].
 fn pg_gb18030_mblen(s: &[u8]) -> i32 {
-    if !is_highbit_set(s[0]) {
-        1
-    } else if (0x30..=0x39).contains(&s[1]) {
-        4
-    } else {
-        2
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_gb18030_dsplen(s: &[u8]) -> i32 {
     if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (35777) panicked at crates/common/wchar/tests/c_parity.rs:240:5:
assertion `left == right` failed
  left: 0
 right: 4

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (35776) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 39 b 0
  left: 0
 right: 1

failures:
    mblen_tables_match_c
    or_incomplete_edge_cases

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
