*** crates/common/wchar/src/lib.rs:825:5: replace pg_gb18030_dsplen -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_gb18030_dsplen -> i32 with 0
@@ -817,21 +817,17 @@
     } else if (0x30..=0x39).contains(&s[1]) {
         4
     } else {
         2
     }
 }
 
 fn pg_gb18030_dsplen(s: &[u8]) -> i32 {
-    if is_highbit_set(s[0]) {
-        2
-    } else {
-        pg_ascii_dsplen(s)
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn nul_pos(s: &[u8]) -> i32 {
     match s.iter().position(|&b| b == 0) {
         Some(p) => p as i32,
         None => s.len() as i32,
     }
 }

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (35969) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 39 b 1
  left: 0
 right: -1

failures:
    dsplen_tables_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.31s

*** result: Failure(101)
