*** crates/common/wchar/src/lib.rs:833:36: replace == with != in nul_pos

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in nul_pos
@@ -825,17 +825,17 @@
     if is_highbit_set(s[0]) {
         2
     } else {
         pg_ascii_dsplen(s)
     }
 }
 
 fn nul_pos(s: &[u8]) -> i32 {
-    match s.iter().position(|&b| b == 0) {
+    match s.iter().position(|&b| b != /* ~ changed by cargo-mutants ~ */ 0) {
         Some(p) => p as i32,
         None => s.len() as i32,
     }
 }
 
 fn pg_ascii_verifychar(_s: &[u8]) -> i32 {
     1
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (36241) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 0
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (36238) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 0
  left: 5794005156280541989
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (36239) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 0
  left: 12483593086889308564
 right: 11667988157482215828

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
