*** crates/common/wchar/src/lib.rs:840:5: replace pg_ascii_verifychar -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_ascii_verifychar -> i32 with -1
@@ -832,17 +832,17 @@
 fn nul_pos(s: &[u8]) -> i32 {
     match s.iter().position(|&b| b == 0) {
         Some(p) => p as i32,
         None => s.len() as i32,
     }
 }
 
 fn pg_ascii_verifychar(_s: &[u8]) -> i32 {
-    1
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_ascii_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
     let len = s.len();

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (36339) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 0
  left: 7420765353468896037
 right: 1677996718092854053

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (36337) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 0
  left: 5201729652674800421
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (36338) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 0
  left: 11689162146291675316
 right: 11667988157482215828

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
