*** crates/common/wchar/src/lib.rs:844:5: replace pg_ascii_verifystr -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_ascii_verifystr -> i32 with 0
@@ -836,17 +836,17 @@
     }
 }
 
 fn pg_ascii_verifychar(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_ascii_verifystr(s: &[u8]) -> i32 {
-    nul_pos(s)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
         if len < 2 {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (36388) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 0
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (36385) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 0
  left: 5794005156280541989
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (36386) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 0
  left: 4196782767312347941
 right: 11667988157482215828

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
