*** crates/common/wchar/src/lib.rs:848:5: replace pg_eucjp_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_eucjp_verifychar -> i32 with 0
@@ -840,45 +840,17 @@
     1
 }
 
 fn pg_ascii_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
-    let len = s.len();
-    let c1 = s[0];
-    if c1 == SS2 {
-        if len < 2 {
-            return -1;
-        }
-        if !(0xa1..=0xdf).contains(&s[1]) {
-            return -1;
-        }
-        2
-    } else if c1 == SS3 {
-        if len < 3 {
-            return -1;
-        }
-        if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
-            return -1;
-        }
-        3
-    } else if is_highbit_set(c1) {
-        if len < 2 {
-            return -1;
-        }
-        if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
-            return -1;
-        }
-        2
-    } else {
-        1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_eucjp_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_eucjp_verifychar)
 }
 
 fn pg_euckr_verifychar(s: &[u8]) -> i32 {
     let c1 = s[0];

*** result: Timeout
