*** crates/common/wchar/src/lib.rs:848:5: replace pg_eucjp_verifychar -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_eucjp_verifychar -> i32 with -1
@@ -840,45 +840,17 @@
     1
 }
 
 fn pg_ascii_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
-    let len = s.len();
-    let c1 = s[0];
-    if c1 == SS2 {
-        if len < 2 {
-            return -1;
-        }
-        if !(0xa1..=0xdf).contains(&s[1]) {
-            return -1;
-        }
-        2
-    } else if c1 == SS3 {
-        if len < 3 {
-            return -1;
-        }
-        if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
-            return -1;
-        }
-        3
-    } else if is_highbit_set(c1) {
-        if len < 2 {
-            return -1;
-        }
-        if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
-            return -1;
-        }
-        2
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_eucjp_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_eucjp_verifychar)
 }
 
 fn pg_euckr_verifychar(s: &[u8]) -> i32 {
     let c1 = s[0];

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (36633) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 1
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (36632) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 7420765353468896037
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (36630) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 13398812283729224485
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.57s

*** result: Failure(101)
