*** crates/common/wchar/src/lib.rs:851:16: replace < with > in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_eucjp_verifychar
@@ -843,17 +843,17 @@
 fn pg_ascii_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
-        if len < 2 {
+        if len > /* ~ changed by cargo-mutants ~ */ 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
         if len < 3 {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (36780) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 329 enc 1
  left: 0
 right: 4

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (36779) panicked at crates/common/wchar/src/lib.rs:854:37:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (36777) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 7771547502799074597
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
