*** crates/common/wchar/src/lib.rs:851:16: replace < with <= in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_eucjp_verifychar
@@ -843,17 +843,17 @@
 fn pg_ascii_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
-        if len < 2 {
+        if len <= /* ~ changed by cargo-mutants ~ */ 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
         if len < 3 {

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (36829) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 2764323770761133621
 right: 16530433274840858579

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (36828) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 15991515597056386981
 right: 2498594579922710343

failures:
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.85s

*** result: Failure(101)
