*** crates/common/wchar/src/lib.rs:852:20: delete - in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_eucjp_verifychar
@@ -844,17 +844,17 @@
     nul_pos(s)
 }
 
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
         if len < 2 {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
         if len < 3 {
             return -1;

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (36877) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 16370551080647595987
 right: 16530433274840858579

failures:
    verifychar_pairs_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
