*** crates/common/wchar/src/lib.rs:855:20: delete - in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_eucjp_verifychar
@@ -847,17 +847,17 @@
 fn pg_eucjp_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
         if len < 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
         2
     } else if c1 == SS3 {
         if len < 3 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (36976) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 25 enc 1
  left: 3
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (36975) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 11305840778648721718
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (36973) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 9693274414356115043
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
