*** crates/common/wchar/src/lib.rs:858:18: replace == with != in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_eucjp_verifychar
@@ -850,17 +850,17 @@
     if c1 == SS2 {
         if len < 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
-    } else if c1 == SS3 {
+    } else if c1 != /* ~ changed by cargo-mutants ~ */ SS3 {
         if len < 3 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (37025) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 1
  left: 3
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (37024) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 11643679908729153987
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37022) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 16139493320257242770
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
