*** crates/common/wchar/src/lib.rs:859:16: replace < with == in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with == in pg_eucjp_verifychar
@@ -851,17 +851,17 @@
         if len < 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
-        if len < 3 {
+        if len == /* ~ changed by cargo-mutants ~ */ 3 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
         if len < 2 {

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (37073) panicked at crates/common/wchar/src/lib.rs:862:32:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37071) panicked at crates/common/wchar/src/lib.rs:862:61:
index out of bounds: the len is 2 but the index is 2

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (37072) panicked at crates/common/wchar/src/lib.rs:862:32:
index out of bounds: the len is 1 but the index is 1

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
