*** crates/common/wchar/src/lib.rs:859:16: replace < with > in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_eucjp_verifychar
@@ -851,17 +851,17 @@
         if len < 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
-        if len < 3 {
+        if len > /* ~ changed by cargo-mutants ~ */ 3 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
         if len < 2 {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (37123) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 331 enc 1
  left: 0
 right: 4

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (37122) panicked at crates/common/wchar/src/lib.rs:862:32:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37120) panicked at crates/common/wchar/src/lib.rs:862:61:
index out of bounds: the len is 2 but the index is 2

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
