*** crates/common/wchar/src/lib.rs:859:16: replace < with <= in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_eucjp_verifychar
@@ -851,17 +851,17 @@
         if len < 2 {
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
-        if len < 3 {
+        if len <= /* ~ changed by cargo-mutants ~ */ 3 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
         if len < 2 {

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (37170) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 4629065562503363303
 right: 2498594579922710343

failures:
    verify_triples_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.86s

*** result: Failure(101)
