*** crates/common/wchar/src/lib.rs:860:20: delete - in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_eucjp_verifychar
@@ -852,17 +852,17 @@
             return -1;
         }
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
         if len < 3 {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
         if len < 2 {
             return -1;

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (37220) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 1511798177565009875
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37218) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 1465176060580910885
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (37219) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 1481198889548753159
 right: 2498594579922710343

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
