*** crates/common/wchar/src/lib.rs:862:41: delete ! in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_eucjp_verifychar
@@ -854,17 +854,17 @@
         if !(0xa1..=0xdf).contains(&s[1]) {
             return -1;
         }
         2
     } else if c1 == SS3 {
         if len < 3 {
             return -1;
         }
-        if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
+        if !is_euc_range_valid(s[1]) ||  /* ~ changed by cargo-mutants ~ */is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
         if len < 2 {
             return -1;
         }
         if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (37401) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 331 enc 1
  left: 0
 right: 4

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37398) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 7784926426096379026
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (37399) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 3017759816472933383
 right: 2498594579922710343

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
