*** crates/common/wchar/src/lib.rs:867:16: replace < with <= in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_eucjp_verifychar
@@ -859,17 +859,17 @@
         if len < 3 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) || !is_euc_range_valid(s[2]) {
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
-        if len < 2 {
+        if len <= /* ~ changed by cargo-mutants ~ */ 2 {
             return -1;
         }
         if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
             return -1;
         }
         2
     } else {
         1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (37597) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 44 enc 1
  left: 0
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (37596) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 5431113537889724867
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37594) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 12551592866662951058
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
