*** crates/common/wchar/src/lib.rs:871:20: delete - in pg_eucjp_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_eucjp_verifychar
@@ -863,17 +863,17 @@
             return -1;
         }
         3
     } else if is_highbit_set(c1) {
         if len < 2 {
             return -1;
         }
         if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
         2
     } else {
         1
     }
 }
 
 fn pg_eucjp_verifystr(s: &[u8]) -> i32 {

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (37808) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 10973471113327852803
 right: 16530433274840858579

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (37809) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 1
  left: 15
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37806) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 14848155278125898789
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
