*** crates/common/wchar/src/lib.rs:880:5: replace pg_eucjp_verifystr -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_eucjp_verifystr -> i32 with -1
@@ -872,17 +872,17 @@
         }
         2
     } else {
         1
     }
 }
 
 fn pg_eucjp_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_eucjp_verifychar)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euckr_verifychar(s: &[u8]) -> i32 {
     let c1 = s[0];
     if is_highbit_set(c1) {
         if s.len() < 2 {
             return -1;
         }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (37989) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 1
  left: -1
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (37986) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 15626733034296234277
 right: 1981323959443683474

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (37987) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 1
  left: 16625279894434712645
 right: 2498594579922710343

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
