*** crates/common/wchar/src/lib.rs:884:5: replace pg_euckr_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euckr_verifychar -> i32 with 0
@@ -876,28 +876,17 @@
     }
 }
 
 fn pg_eucjp_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_eucjp_verifychar)
 }
 
 fn pg_euckr_verifychar(s: &[u8]) -> i32 {
-    let c1 = s[0];
-    if is_highbit_set(c1) {
-        if s.len() < 2 {
-            return -1;
-        }
-        if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
-            return -1;
-        }
-        2
-    } else {
-        1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euckr_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euckr_verifychar)
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
     let len = s.len();

*** result: Timeout
