*** crates/common/wchar/src/lib.rs:884:5: replace pg_euckr_verifychar -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euckr_verifychar -> i32 with -1
@@ -876,28 +876,17 @@
     }
 }
 
 fn pg_eucjp_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_eucjp_verifychar)
 }
 
 fn pg_euckr_verifychar(s: &[u8]) -> i32 {
-    let c1 = s[0];
-    if is_highbit_set(c1) {
-        if s.len() < 2 {
-            return -1;
-        }
-        if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
-            return -1;
-        }
-        2
-    } else {
-        1
-    }
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euckr_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euckr_verifychar)
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
     let len = s.len();

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (38102) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 2
  left: 7420765353468896037
 right: 2764323770761133621

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (38103) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 2
  left: 0
 right: 5

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (38100) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 2
  left: 13398812283729224485
 right: 13153552384047741733

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
