*** crates/common/wchar/src/lib.rs:889:39: delete ! in pg_euckr_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_euckr_verifychar
@@ -881,17 +881,17 @@
 }
 
 fn pg_euckr_verifychar(s: &[u8]) -> i32 {
     let c1 = s[0];
     if is_highbit_set(c1) {
         if s.len() < 2 {
             return -1;
         }
-        if !is_euc_range_valid(c1) || !is_euc_range_valid(s[1]) {
+        if !is_euc_range_valid(c1) ||  /* ~ changed by cargo-mutants ~ */is_euc_range_valid(s[1]) {
             return -1;
         }
         2
     } else {
         1
     }
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (38446) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 2
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (38445) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 2
  left: 7514187859356753685
 right: 2764323770761133621

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (38443) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 2
  left: 2529827952574315301
 right: 13153552384047741733

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
