*** crates/common/wchar/src/lib.rs:88:5: replace is_highbit_set -> bool with false

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_highbit_set -> bool with false
@@ -80,17 +80,17 @@
 const LCPRV1_B: u8 = 0x9b;
 const LCPRV2_A: u8 = 0x9c;
 const LCPRV2_B: u8 = 0x9d;
 const NONUTF8_INVALID_BYTE0: u8 = 0x8d;
 const NONUTF8_INVALID_BYTE1: u8 = b' ';
 
 #[inline(always)]
 fn is_highbit_set(b: u8) -> bool {
-    b & HIGHBIT != 0
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[inline(always)]
 fn is_euc_range_valid(c: u8) -> bool {
     (0xa1..=0xfe).contains(&c)
 }
 
 pub type Mb2WcharConverter = fn(from: &[u8], to: &mut [pg_wchar]) -> i32;

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (1649) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 1 b 128
  left: 1
 right: 2

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (1658) panicked at crates/common/wchar/tests/c_parity.rs:239:5:
assertion `left == right` failed
  left: 1
 right: 2147483647

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (1656) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 1 b 128
  left: 1
 right: 2

failures:
    dsplen_tables_match_c
    mb2wchar_matches_c
    mblen_tables_match_c
    or_incomplete_edge_cases
    utf8_verify_3byte_exhaustive_matches_c
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 4 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.63s

*** result: Failure(101)
