*** crates/common/wchar/src/lib.rs:88:7: replace & with | in is_highbit_set

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace & with | in is_highbit_set
@@ -80,17 +80,17 @@
 const LCPRV1_B: u8 = 0x9b;
 const LCPRV2_A: u8 = 0x9c;
 const LCPRV2_B: u8 = 0x9d;
 const NONUTF8_INVALID_BYTE0: u8 = 0x8d;
 const NONUTF8_INVALID_BYTE1: u8 = b' ';
 
 #[inline(always)]
 fn is_highbit_set(b: u8) -> bool {
-    b & HIGHBIT != 0
+    b | /* ~ changed by cargo-mutants ~ */ HIGHBIT != 0
 }
 
 #[inline(always)]
 fn is_euc_range_valid(c: u8) -> bool {
     (0xa1..=0xfe).contains(&c)
 }
 
 pub type Mb2WcharConverter = fn(from: &[u8], to: &mut [pg_wchar]) -> i32;

---- dsplen_tables_match_c stdout ----

thread 'dsplen_tables_match_c' (1749) panicked at crates/common/wchar/tests/c_parity.rs:60:13:
assertion `left == right` failed: enc 1 b 0
  left: 2
 right: 0

---- mblen_tables_match_c stdout ----

thread 'mblen_tables_match_c' (1752) panicked at crates/common/wchar/tests/c_parity.rs:35:13:
assertion `left == right` failed: enc 1 b 0
  left: 2
 right: 1

---- or_incomplete_edge_cases stdout ----

thread 'or_incomplete_edge_cases' (1753) panicked at crates/common/wchar/tests/c_parity.rs:241:5:
assertion `left == right` failed
  left: 2147483647
 right: 1

failures:
    dsplen_tables_match_c
    mb2wchar_matches_c
    mblen_tables_match_c
    or_incomplete_edge_cases
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 5 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.64s

*** result: Failure(101)
