*** crates/common/wchar/src/lib.rs:899:5: replace pg_euckr_verifystr -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euckr_verifystr -> i32 with -1
@@ -891,17 +891,17 @@
         }
         2
     } else {
         1
     }
 }
 
 fn pg_euckr_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_euckr_verifychar)
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
         if len < 4 {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (38642) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 2
  left: -1
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (38639) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 2
  left: 14607699118281059109
 right: 13153552384047741733

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (38640) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 2
  left: 14769737077835658277
 right: 7041007743533753236

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
