*** crates/common/wchar/src/lib.rs:903:5: replace pg_euctw_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euctw_verifychar -> i32 with 0
@@ -895,42 +895,17 @@
     }
 }
 
 fn pg_euckr_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euckr_verifychar)
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
-    let len = s.len();
-    let c1 = s[0];
-    if c1 == SS2 {
-        if len < 4 {
-            return -1;
-        }
-        if !(0xa1..=0xa7).contains(&s[1]) {
-            return -1;
-        }
-        if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
-            return -1;
-        }
-        4
-    } else if c1 == SS3 {
-        -1
-    } else if is_highbit_set(c1) {
-        if len < 2 {
-            return -1;
-        }
-        if !is_euc_range_valid(s[1]) {
-            return -1;
-        }
-        2
-    } else {
-        1
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euctw_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euctw_verifychar)
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_johab_mblen(s);

*** result: Timeout
