*** crates/common/wchar/src/lib.rs:903:5: replace pg_euctw_verifychar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euctw_verifychar -> i32 with 1
@@ -895,42 +895,17 @@
     }
 }
 
 fn pg_euckr_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euckr_verifychar)
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
-    let len = s.len();
-    let c1 = s[0];
-    if c1 == SS2 {
-        if len < 4 {
-            return -1;
-        }
-        if !(0xa1..=0xa7).contains(&s[1]) {
-            return -1;
-        }
-        if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
-            return -1;
-        }
-        4
-    } else if c1 == SS3 {
-        -1
-    } else if is_highbit_set(c1) {
-        if len < 2 {
-            return -1;
-        }
-        if !is_euc_range_valid(s[1]) {
-            return -1;
-        }
-        2
-    } else {
-        1
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_euctw_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euctw_verifychar)
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_johab_mblen(s);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (38740) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 4
  left: 16
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (38739) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 4
  left: 1677996718092854053
 right: 9371664108075351349

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (38737) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 13540835691694531365
 right: 4552606478181788629

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
