*** crates/common/wchar/src/lib.rs:906:16: replace < with <= in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_euctw_verifychar
@@ -898,17 +898,17 @@
 fn pg_euckr_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euckr_verifychar)
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
-        if len < 4 {
+        if len <= /* ~ changed by cargo-mutants ~ */ 4 {
             return -1;
         }
         if !(0xa1..=0xa7).contains(&s[1]) {
             return -1;
         }
         if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
             return -1;
         }

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (38982) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 8533180740379665189
 right: 4552606478181788629

failures:
    verify_quads_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.32s

*** result: Failure(101)
