*** crates/common/wchar/src/lib.rs:907:20: delete - in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_euctw_verifychar
@@ -899,17 +899,17 @@
     verify_str(s, pg_euckr_verifychar)
 }
 
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
         if len < 4 {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
         if !(0xa1..=0xa7).contains(&s[1]) {
             return -1;
         }
         if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
             return -1;
         }
         4

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (39033) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 4
  left: 18037815619656951093
 right: 9371664108075351349

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (39032) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 4
  left: 6346772069751543333
 right: 18277913692564833172

failures:
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.86s

*** result: Failure(101)
