*** crates/common/wchar/src/lib.rs:910:20: delete - in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_euctw_verifychar
@@ -902,17 +902,17 @@
 fn pg_euctw_verifychar(s: &[u8]) -> i32 {
     let len = s.len();
     let c1 = s[0];
     if c1 == SS2 {
         if len < 4 {
             return -1;
         }
         if !(0xa1..=0xa7).contains(&s[1]) {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
         if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
             return -1;
         }
         4
     } else if c1 == SS3 {
         -1
     } else if is_highbit_set(c1) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (39132) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 25 enc 4
  left: 29
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39129) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 1296585776624925892
 right: 4552606478181788629

failures:
    verify_quads_match_c
    verifystr_corpora_match_c

test result: FAILED. 11 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
