*** crates/common/wchar/src/lib.rs:912:38: replace || with && in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace || with && in pg_euctw_verifychar
@@ -904,17 +904,17 @@
     let c1 = s[0];
     if c1 == SS2 {
         if len < 4 {
             return -1;
         }
         if !(0xa1..=0xa7).contains(&s[1]) {
             return -1;
         }
-        if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
+        if !is_euc_range_valid(s[2]) && /* ~ changed by cargo-mutants ~ */ !is_euc_range_valid(s[3]) {
             return -1;
         }
         4
     } else if c1 == SS3 {
         -1
     } else if is_highbit_set(c1) {
         if len < 2 {
             return -1;

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39178) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 3326653972649312821
 right: 4552606478181788629

failures:
    verify_quads_match_c

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.33s

*** result: Failure(101)
