*** crates/common/wchar/src/lib.rs:917:9: delete - in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_euctw_verifychar
@@ -909,17 +909,17 @@
         if !(0xa1..=0xa7).contains(&s[1]) {
             return -1;
         }
         if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
             return -1;
         }
         4
     } else if c1 == SS3 {
-        -1
+         /* ~ changed by cargo-mutants ~ */1
     } else if is_highbit_set(c1) {
         if len < 2 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) {
             return -1;
         }
         2

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (39426) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 331 enc 4
  left: 9
 right: 0

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (39425) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 4
  left: 11733579032240137525
 right: 9371664108075351349

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39423) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 4698999079493383125
 right: 4552606478181788629

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
