*** crates/common/wchar/src/lib.rs:919:16: replace < with == in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with == in pg_euctw_verifychar
@@ -911,17 +911,17 @@
         }
         if !is_euc_range_valid(s[2]) || !is_euc_range_valid(s[3]) {
             return -1;
         }
         4
     } else if c1 == SS3 {
         -1
     } else if is_highbit_set(c1) {
-        if len < 2 {
+        if len == /* ~ changed by cargo-mutants ~ */ 2 {
             return -1;
         }
         if !is_euc_range_valid(s[1]) {
             return -1;
         }
         2
     } else {
         1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (39475) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 44 enc 4
  left: 0
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (39474) panicked at crates/common/wchar/src/lib.rs:922:32:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39472) panicked at crates/common/wchar/src/lib.rs:922:32:
index out of bounds: the len is 1 but the index is 1

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
