*** crates/common/wchar/src/lib.rs:922:12: delete ! in pg_euctw_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_euctw_verifychar
@@ -914,17 +914,17 @@
         }
         4
     } else if c1 == SS3 {
         -1
     } else if is_highbit_set(c1) {
         if len < 2 {
             return -1;
         }
-        if !is_euc_range_valid(s[1]) {
+        if  /* ~ changed by cargo-mutants ~ */is_euc_range_valid(s[1]) {
             return -1;
         }
         2
     } else {
         1
     }
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (39671) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 4
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (39670) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 4
  left: 14550605998807265301
 right: 9371664108075351349

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39668) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 5428077888316084181
 right: 4552606478181788629

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
