*** crates/common/wchar/src/lib.rs:932:5: replace pg_euctw_verifystr -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_euctw_verifystr -> i32 with 1
@@ -924,17 +924,17 @@
         }
         2
     } else {
         1
     }
 }
 
 fn pg_euctw_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_euctw_verifychar)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_johab_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if !is_highbit_set(s[0]) {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (39818) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 1 enc 4
  left: 1
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39815) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 4
  left: 11187081234182084453
 right: 4552606478181788629

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (39816) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 4
  left: 11850457100670087717
 right: 18277913692564833172

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.61s

*** result: Failure(101)
