*** crates/common/wchar/src/lib.rs:936:5: replace pg_johab_verifychar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_johab_verifychar -> i32 with 1
@@ -928,29 +928,17 @@
     }
 }
 
 fn pg_euctw_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euctw_verifychar)
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_johab_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if !is_highbit_set(s[0]) {
-        return mbl;
-    }
-    for i in 1..mbl as usize {
-        if !is_euc_range_valid(s[i]) {
-            return -1;
-        }
-    }
-    mbl
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_johab_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_johab_verifychar)
 }
 
 fn pg_mule_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_mule_mblen(s);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (39965) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 40
  left: 16
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (39964) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 1677996718092854053
 right: 10372200427643310893

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (39962) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 40
  left: 13540835691694531365
 right: 2147744106610556197

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.13s

*** result: Failure(101)
