*** crates/common/wchar/src/lib.rs:937:25: replace < with <= in pg_johab_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_johab_verifychar
@@ -929,17 +929,17 @@
 }
 
 fn pg_euctw_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euctw_verifychar)
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_johab_mblen(s);
-    if (s.len() as i32) < mbl {
+    if (s.len() as i32) <= /* ~ changed by cargo-mutants ~ */ mbl {
         return -1;
     }
     if !is_highbit_set(s[0]) {
         return mbl;
     }
     for i in 1..mbl as usize {
         if !is_euc_range_valid(s[i]) {
             return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40161) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 44 enc 40
  left: 0
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40160) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 10230127906827019045
 right: 10372200427643310893

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40158) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 40
  left: 768245199090308389
 right: 2147744106610556197

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.13s

*** result: Failure(101)
