*** crates/common/wchar/src/lib.rs:938:16: delete - in pg_johab_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_johab_verifychar
@@ -930,17 +930,17 @@
 
 fn pg_euctw_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_euctw_verifychar)
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_johab_mblen(s);
     if (s.len() as i32) < mbl {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     if !is_highbit_set(s[0]) {
         return mbl;
     }
     for i in 1..mbl as usize {
         if !is_euc_range_valid(s[i]) {
             return -1;
         }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40210) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 72 enc 40
  left: 3
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40209) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 17166430310235789101
 right: 10372200427643310893

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40207) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 40
  left: 15300474196310806821
 right: 2147744106610556197

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.15s

*** result: Failure(101)
