*** crates/common/wchar/src/lib.rs:93:5: replace is_euc_range_valid -> bool with true

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace is_euc_range_valid -> bool with true
@@ -85,17 +85,17 @@
 
 #[inline(always)]
 fn is_highbit_set(b: u8) -> bool {
     b & HIGHBIT != 0
 }
 
 #[inline(always)]
 fn is_euc_range_valid(c: u8) -> bool {
-    (0xa1..=0xfe).contains(&c)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub type Mb2WcharConverter = fn(from: &[u8], to: &mut [pg_wchar]) -> i32;
 pub type Wchar2MbConverter = fn(from: &[pg_wchar], to: &mut [u8]) -> i32;
 pub type MblenConverter = fn(mbstr: &[u8]) -> i32;
 pub type DsplenConverter = fn(mbstr: &[u8]) -> i32;
 pub type MbCharVerifier = fn(mbstr: &[u8]) -> i32;
 pub type MbStrVerifier = fn(mbstr: &[u8]) -> i32;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (1869) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 1
  left: 16
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (1867) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 1
  left: 1708291602517320131
 right: 16530433274840858579

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (1864) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 1
  left: 16405769989245294226
 right: 1981323959443683474

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
