*** crates/common/wchar/src/lib.rs:940:8: delete ! in pg_johab_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_johab_verifychar
@@ -932,17 +932,17 @@
     verify_str(s, pg_euctw_verifychar)
 }
 
 fn pg_johab_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_johab_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
-    if !is_highbit_set(s[0]) {
+    if  /* ~ changed by cargo-mutants ~ */is_highbit_set(s[0]) {
         return mbl;
     }
     for i in 1..mbl as usize {
         if !is_euc_range_valid(s[i]) {
             return -1;
         }
     }
     mbl

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40259) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 40
  left: 16
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40258) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 4735279354606870309
 right: 10372200427643310893

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40256) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 40
  left: 6842495529740542757
 right: 2147744106610556197

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.12s

*** result: Failure(101)
