*** crates/common/wchar/src/lib.rs:945:20: delete - in pg_johab_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_johab_verifychar
@@ -937,17 +937,17 @@
     if (s.len() as i32) < mbl {
         return -1;
     }
     if !is_highbit_set(s[0]) {
         return mbl;
     }
     for i in 1..mbl as usize {
         if !is_euc_range_valid(s[i]) {
-            return -1;
+            return  /* ~ changed by cargo-mutants ~ */1;
         }
     }
     mbl
 }
 
 fn pg_johab_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_johab_verifychar)
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40357) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 40
  left: 15
 right: 2

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40356) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 40
  left: 5756590181461278021
 right: 10372200427643310893

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40354) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 40
  left: 13922386395918115621
 right: 2147744106610556197

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.17s

*** result: Failure(101)
