*** crates/common/wchar/src/lib.rs:952:5: replace pg_johab_verifystr -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_johab_verifystr -> i32 with 0
@@ -944,17 +944,17 @@
         if !is_euc_range_valid(s[i]) {
             return -1;
         }
     }
     mbl
 }
 
 fn pg_johab_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_johab_verifychar)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_mule_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_mule_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     for i in 1..mbl as usize {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40406) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 40
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40403) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 40
  left: 2684143106248561957
 right: 2147744106610556197

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (40404) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 40
  left: 15417386230024402437
 right: 5315921959151090676

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.06s

*** result: Failure(101)
