*** crates/common/wchar/src/lib.rs:956:5: replace pg_mule_verifychar -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_mule_verifychar -> i32 with 1
@@ -948,26 +948,17 @@
     mbl
 }
 
 fn pg_johab_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_johab_verifychar)
 }
 
 fn pg_mule_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_mule_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    for i in 1..mbl as usize {
-        if !is_highbit_set(s[i]) {
-            return -1;
-        }
-    }
-    mbl
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_mule_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_mule_verifychar)
 }
 
 fn pg_latin1_verifychar(_s: &[u8]) -> i32 {
     1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40602) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 25 enc 7
  left: 64
 right: 60

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40601) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 7
  left: 1677996718092854053
 right: 3698321501209814309

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40599) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 7
  left: 13540835691694531365
 right: 11266659970567000869

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
