*** crates/common/wchar/src/lib.rs:957:25: replace < with <= in pg_mule_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with <= in pg_mule_verifychar
@@ -949,17 +949,17 @@
 }
 
 fn pg_johab_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_johab_verifychar)
 }
 
 fn pg_mule_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_mule_mblen(s);
-    if (s.len() as i32) < mbl {
+    if (s.len() as i32) <= /* ~ changed by cargo-mutants ~ */ mbl {
         return -1;
     }
     for i in 1..mbl as usize {
         if !is_highbit_set(s[i]) {
             return -1;
         }
     }
     mbl

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40798) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 7
  left: 15
 right: 16

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40797) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 7
  left: 428799959189395237
 right: 3698321501209814309

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40795) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 7
  left: 9127974767805928229
 right: 11266659970567000869

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
