*** crates/common/wchar/src/lib.rs:961:12: delete ! in pg_mule_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_mule_verifychar
@@ -953,17 +953,17 @@
 }
 
 fn pg_mule_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_mule_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     for i in 1..mbl as usize {
-        if !is_highbit_set(s[i]) {
+        if  /* ~ changed by cargo-mutants ~ */is_highbit_set(s[i]) {
             return -1;
         }
     }
     mbl
 }
 
 fn pg_mule_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_mule_verifychar)

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (40896) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 7
  left: 3
 right: 16

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (40895) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 7
  left: 16503463934316832037
 right: 3698321501209814309

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (40893) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 7
  left: 443986940828734245
 right: 11266659970567000869

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
