*** crates/common/wchar/src/lib.rs:969:5: replace pg_mule_verifystr -> i32 with 1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_mule_verifystr -> i32 with 1
@@ -961,17 +961,17 @@
         if !is_highbit_set(s[i]) {
             return -1;
         }
     }
     mbl
 }
 
 fn pg_mule_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_mule_verifychar)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_latin1_verifychar(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_latin1_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (41043) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 1 enc 7
  left: 1
 right: 2

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41040) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 7
  left: 415235838265172773
 right: 11266659970567000869

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (41041) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 7
  left: 15360928742318834469
 right: 17329003597227702053

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.61s

*** result: Failure(101)
