*** crates/common/wchar/src/lib.rs:973:5: replace pg_latin1_verifychar -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_latin1_verifychar -> i32 with 0
@@ -965,17 +965,17 @@
     mbl
 }
 
 fn pg_mule_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_mule_verifychar)
 }
 
 fn pg_latin1_verifychar(_s: &[u8]) -> i32 {
-    1
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_latin1_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_sjis_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_sjis_mblen(s);

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (41140) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 8
  left: 18172517032833196837
 right: 1677996718092854053

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41138) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 8
  left: 717662651402036005
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (41139) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 8
  left: 15813227603212837044
 right: 11667988157482215828

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.59s

*** result: Failure(101)
