*** crates/common/wchar/src/lib.rs:977:5: replace pg_latin1_verifystr -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_latin1_verifystr -> i32 with 0
@@ -969,17 +969,17 @@
     verify_str(s, pg_mule_verifychar)
 }
 
 fn pg_latin1_verifychar(_s: &[u8]) -> i32 {
     1
 }
 
 fn pg_latin1_verifystr(s: &[u8]) -> i32 {
-    nul_pos(s)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_sjis_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_sjis_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
     if mbl == 1 {

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (41239) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 8
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41236) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 8
  left: 5794005156280541989
 right: 13540835691694531365

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (41237) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 8
  left: 4196782767312347941
 right: 11667988157482215828

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
