*** crates/common/wchar/src/lib.rs:981:5: replace pg_sjis_verifychar -> i32 with -1

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_sjis_verifychar -> i32 with -1
@@ -973,31 +973,17 @@
     1
 }
 
 fn pg_latin1_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_sjis_verifychar(s: &[u8]) -> i32 {
-    let mbl = pg_sjis_mblen(s);
-    if (s.len() as i32) < mbl {
-        return -1;
-    }
-    if mbl == 1 {
-        return mbl;
-    }
-    let c1 = s[0];
-    let c2 = s[1];
-    let head = (0x81..=0x9f).contains(&c1) || (0xe0..=0xfc).contains(&c1);
-    let tail = (0x40..=0x7e).contains(&c2) || (0x80..=0xfc).contains(&c2);
-    if !head || !tail {
-        return -1;
-    }
-    mbl
+    -1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn pg_sjis_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_sjis_verifychar)
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
     s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (41484) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 35
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (41483) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 35
  left: 7420765353468896037
 right: 17553182011663015525

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41481) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 35
  left: 13398812283729224485
 right: 446253531800824613

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.20s

*** result: Failure(101)
