*** crates/common/wchar/src/lib.rs:982:25: replace < with > in pg_sjis_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace < with > in pg_sjis_verifychar
@@ -974,17 +974,17 @@
 }
 
 fn pg_latin1_verifystr(s: &[u8]) -> i32 {
     nul_pos(s)
 }
 
 fn pg_sjis_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_sjis_mblen(s);
-    if (s.len() as i32) < mbl {
+    if (s.len() as i32) > /* ~ changed by cargo-mutants ~ */ mbl {
         return -1;
     }
     if mbl == 1 {
         return mbl;
     }
     let c1 = s[0];
     let c2 = s[1];
     let head = (0x81..=0x9f).contains(&c1) || (0xe0..=0xfc).contains(&c1);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (41582) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 35
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (41581) panicked at crates/common/wchar/src/lib.rs:989:14:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41579) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 35
  left: 13398812283729224485
 right: 446253531800824613

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.10s

*** result: Failure(101)
