*** crates/common/wchar/src/lib.rs:985:12: replace == with != in pg_sjis_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace == with != in pg_sjis_verifychar
@@ -977,17 +977,17 @@
     nul_pos(s)
 }
 
 fn pg_sjis_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_sjis_mblen(s);
     if (s.len() as i32) < mbl {
         return -1;
     }
-    if mbl == 1 {
+    if mbl != /* ~ changed by cargo-mutants ~ */ 1 {
         return mbl;
     }
     let c1 = s[0];
     let c2 = s[1];
     let head = (0x81..=0x9f).contains(&c1) || (0xe0..=0xfc).contains(&c1);
     let tail = (0x40..=0x7e).contains(&c2) || (0x80..=0xfc).contains(&c2);
     if !head || !tail {
         return -1;

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (41729) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 35
  left: 2
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (41728) panicked at crates/common/wchar/src/lib.rs:989:14:
index out of bounds: the len is 1 but the index is 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41726) panicked at crates/common/wchar/src/lib.rs:989:14:
index out of bounds: the len is 1 but the index is 1

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.10s

*** result: Failure(101)
