*** crates/common/wchar/src/lib.rs:992:8: delete ! in pg_sjis_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete ! in pg_sjis_verifychar
@@ -984,17 +984,17 @@
     }
     if mbl == 1 {
         return mbl;
     }
     let c1 = s[0];
     let c2 = s[1];
     let head = (0x81..=0x9f).contains(&c1) || (0xe0..=0xfc).contains(&c1);
     let tail = (0x40..=0x7e).contains(&c2) || (0x80..=0xfc).contains(&c2);
-    if !head || !tail {
+    if  /* ~ changed by cargo-mutants ~ */head || !tail {
         return -1;
     }
     mbl
 }
 
 fn pg_sjis_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_sjis_verifychar)
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (41925) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 21 enc 35
  left: 0
 right: 5

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (41924) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 35
  left: 1697310117186687893
 right: 17553182011663015525

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (41922) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 35
  left: 736759992169003813
 right: 446253531800824613

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.29s

*** result: Failure(101)
