*** crates/common/wchar/src/lib.rs:993:16: delete - in pg_sjis_verifychar

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ delete - in pg_sjis_verifychar
@@ -985,17 +985,17 @@
     if mbl == 1 {
         return mbl;
     }
     let c1 = s[0];
     let c2 = s[1];
     let head = (0x81..=0x9f).contains(&c1) || (0xe0..=0xfc).contains(&c1);
     let tail = (0x40..=0x7e).contains(&c2) || (0x80..=0xfc).contains(&c2);
     if !head || !tail {
-        return -1;
+        return  /* ~ changed by cargo-mutants ~ */1;
     }
     mbl
 }
 
 fn pg_sjis_verifystr(s: &[u8]) -> i32 {
     verify_str(s, pg_sjis_verifychar)
 }

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42023) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 22 enc 35
  left: 15
 right: 14

---- verifychar_pairs_match_c stdout ----

thread 'verifychar_pairs_match_c' (42022) panicked at crates/common/wchar/tests/c_parity.rs:80:9:
assertion `left == right` failed: enc 35
  left: 18095832360130699685
 right: 17553182011663015525

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (42020) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 35
  left: 2350559048460682597
 right: 446253531800824613

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifychar_pairs_match_c
    verifystr_corpora_match_c

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.30s

*** result: Failure(101)
