*** crates/common/wchar/src/lib.rs:999:5: replace pg_sjis_verifystr -> i32 with 0

*** mutation diff:
--- crates/common/wchar/src/lib.rs
+++ replace pg_sjis_verifystr -> i32 with 0
@@ -991,17 +991,17 @@
     let tail = (0x40..=0x7e).contains(&c2) || (0x80..=0xfc).contains(&c2);
     if !head || !tail {
         return -1;
     }
     mbl
 }
 
 fn pg_sjis_verifystr(s: &[u8]) -> i32 {
-    verify_str(s, pg_sjis_verifychar)
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn nonutf8_invalid_pair(s: &[u8]) -> bool {
     s[0] == NONUTF8_INVALID_BYTE0 && s[1] == NONUTF8_INVALID_BYTE1
 }
 
 fn pg_big5_verifychar(s: &[u8]) -> i32 {
     let mbl = pg_big5_mblen(s);

---- verifystr_corpora_match_c stdout ----

thread 'verifystr_corpora_match_c' (42072) panicked at crates/common/wchar/tests/c_parity.rs:162:13:
assertion `left == right` failed: corpus 0 enc 35
  left: 0
 right: 1

---- verify_quads_match_c stdout ----

thread 'verify_quads_match_c' (42069) panicked at crates/common/wchar/tests/c_parity.rs:124:9:
assertion `left == right` failed: enc 35
  left: 4727496487871206181
 right: 446253531800824613

---- verify_triples_match_c stdout ----

thread 'verify_triples_match_c' (42070) panicked at crates/common/wchar/tests/c_parity.rs:102:9:
assertion `left == right` failed: enc 35
  left: 6913609240534286117
 right: 10732941537432710437

failures:
    verify_quads_match_c
    verify_triples_match_c
    verifystr_corpora_match_c

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.20s

*** result: Failure(101)
